{"reviews": ["My wife had tried a smaller version of this humidifier for her plants to get through the winter months when humidity was low and liked it. This one is 1.5 L bigger. She likes that it fills from the top and it holds quite a bit of water but does not take up a lot of room. Over all it is a great humidifier. The tank part is fairly easy to clean but unfortunately the rotating nozzle is not. Black mold got in there and it was difficult to get it out. She tried a qtip  and a few small brushes but ended up having to take the lid apart and soak the pieces in a little bleach and water.", "I like the color changes. It's pretty big and work as a humidifier without being too loud and it does hold a lot of water", "I have used the expensive Canopy humidifiers, Walmart, Vicks, all of the majors and this humidifier outweighs all the rest! It is the most simple to use - you can just pour into the top. It is so easy to keep clean by simply wiping down one single part and this bad boy can humidify my master and still have enough water for the next night. If you are comparing, look no further. This is it. Its got great settings and the lights can turn off.", "This is a good size as far as humidifiers go - it holds a LOT of water... While I like the size, I still change out the water for every use since I add essential oils to mine at night.", "I have the worst luck with diffusers and humidifiers. No matter how closely I follow the instructions, they stop working after a short while. This one is wonderful, and probably the easiest one to set up and use. I have hand issues, and opening this humidifier to add water was incredibly easy. It stayed on all night, about 9 hours. It worked with 10 drops of my eucalyptus oil and I enjoyed the colors. It made very little noise. I was looking for something easy to use, and I wasn't interested in a lot of special features.  I just wanted something that worked. The price was good, and I would order another one.", "This holds a really nice amount of water without needing to refill it all the time.", "Runs easily through the night with water to spare. Great for a nursery to help prevent sore throat during dry winter months. Nice quality, easy controls, and lights up like a nightlight. Nice design features. Fast shipping", "This humidifier works great and holds a lot of water. It also has timing programs for either 2 or 4 hours or just continuous use. I had to get one as I've had a really bad sore throat for days now. Using this throughout the night should do the trick! It also changes colors in the water tank which is a cute, nice touch."], "reference": [1, 1, 1, 0, 0, 0, 0, 0], "score": [0.0062500000931322575, 0.6000000238418579, 0.4000000059604645, 0.11250000144354999, 0.5, 0.5, 0.4000000059604645, 0.699999988079071]}