{"reviews": ["Simple set up, high capacity reservoir, cool light color options, variable mist options, all in a compact unit. The video shows mist set at high and revolving light colors. There are also a low mist setting and a sleep mode (low mist/no lights). I counted 9 colors (pink, purple, blue, turquoise, green, lime, yellow, orange, red). When your fav color appears, hit the light button to switch from color cycling to constant chosen color. I added a few drops of essential oil and the scent was diffused within a couple of minutes. A low humming sound is constant. I’m a light sleeper and will place humidifier on other side of bedroom.", "I purchased this item when my daughter was sick and when I received it it wasn't working.  It lit up and made noise but no mist at all.", "I ordered this when my old humidifier stopped working in my plant room.  It's smaller than the 5L that I had, but it still puts out a very nice mist, and rather high output for it's size.  I really like it, even if I'll have to refill it more often.", "Absolutely love this Clarston Humidifier! The 4L capacity is perfect for bedrooms or larger rooms, giving a solid 40 hours of cool mist. The top-fill design makes it super easy to use and refill. Adding essential oils is a breeze, and it really enhances the room with my favorite scents. The nightlight feature is a nice touch, providing just enough light without being too bright. Plus, the auto shut-off function is a great safety feature. It's been wonderful for my plants and makes the nursery so comfortable for my baby. Highly recommend for anyone looking to improve their indoor air quality!", "I love that the entire top of this humidifier is a lid = that makes the unit really easy to fill, and also very easy to clean - as I can put my whole hand inside the unit. It is very quiet while opereference – listen to my video. The humidifier comes with a nicely written (and nicely-sized) instruction manual. The mist the unit emits is very fine and we have not noticed any dampness to surrounding objects. This is the perfect size humidifier to put in our bedroom. As we only turn the unit on at night, and then fill it each morning, we haven't experienced the auto shut-off feature. The colored lights feature is fun, but it's doubtful we will ever use that feature. We were just seeking a basic humidifier that was easy to fill, easy to clean, and quiet while opereference  – and this is it!", "Nice working humidifier that is quiet and lasts awhile. It ran all through the night and still had some water left in the morning. It gives out a good amount of mist and you can adjust where it’s dispersed."], "reference": [2, 0, 0, 0, 0, 0], "score": [0.0062500000931322575, 0.10000000149011612, 0.4000000059604645, 0.6000000238418579, 0.4000000059604645, 0.6000000238418579]}