{"reviews": ["I'm a very picky \"audiophile\" and was looking for a TWS set to use out and about. I've tried a bunch of different models in the past, and sold them because of sound, mostly. I've tried the Galaxy Buds, Buds+, Buds Pro, Buds2 Pro, Jabra Elite 7, Soundcore Liberty 2 Pro, AirPods, Sony WF-1000XM3, among others. These have the best sound I have personally heard out of any TWS earbuds.<br /><br />First let's talk non sound stuff. The build quality is acceptable for something in the $50-100 price range, the plastic feels cheap but the hinge is nice. Touch controls work well, and I appreciate the USB-C charging. No wireless charging is a disappointment. Fit isn't the best for me, they don't feel snug how I like but they don't fall out and seal well. This will be different for every person. ANC is mediocre at best, only mildly cancelling out noise. Nowhere near as good as the stuff from Sony or Samsung. (As to be expected, these are cheaper.)<br /><br />Looking at the FR graph (thanks, RTINGS) we can see almost perfect compliance with the Harman Target. If you don't know what this means, it basically indicates these follow an industry-standard researched data point on what the average person will think sounds better. With other TWS buds that follow this target well, like the Galaxy Buds 2 Pro and Jabra Elite 7, I've had issues with a \"compressed\" or a sharpness in the treble. This probably is due to some upper treble differences or my own HRTF. With these JBLs I don't get that. Excellent sound, these are scientifically and objectively great.", "Very disappointed with this product. There are several things that need to be fixed for this to be a good product, especially at $59+.<br /><br />I bought this to replace my Taotronics sound elite 71. I was seeking for active noise-cancelling feature as I use them for my gym workouts.<br /><br />1. Compared to the Taotronics, with the JBL I had to almost crank all the way up the volume to get the same audio level (I did a side by side comparison). The factory EQ is crap. I had to download JBL's app to set the EQ right. Once you tune the EQ the lows are good.<br /><br />2. Bluetooth: Very sensitive to interference. Even placing my hand behind my head would cause signal dropouts. Not to say the random drops.<br /><br />3. Fit: I don't know if it was my ears' shape or what, but the fit was very uncomfortable. I had a hard time figuring out the right tips size and earbud position to create a good seal. I even switched to the tips I use with my taotronics (which fit fantastic) and I wasn't 100% satisfied. I had to constantly fix the earbuds position, which lead to toggle the ANC on and off feature, or by pausing the music which was very annoying.  And speaking about ANC, it is just useless. I saw no difference between toggling it on and off. In fact, I could hear the noise louder with the ANC on.<br /><br />4. Battery life: probably the only thing that I can't complain about. Although I couldn't complete my test for battery duration (see next point)<br /><br />5. Finally, after 10 days of using these earbuds for 1 hour(ish) each day, the left earbud kind of died. Seems like the lows and miss stopped working. I paired them to my laptop to see if it was some sort of connection issue with my phone, but the problem persisted. Did factory reset and didn't solve the problem. So now I have a $59 completely useless pair of earbuds lying around.<br /><br />Conclusion: If you are looking for ANC earbuds, look somewhere else and don't waste your time and money with these.", "First of all, I think these are more comfortable than my AirPods Pro.<br /><br />BUT what is up with the volume? These are quieter than my AirPods Pro. I have to bump the volume higher to get that right volume. The problem is that my phone complains that the volume is too high for my ears. I can use 40% volume with the AirPods Pro, but I have to adjust to 60-75% with these.<br /><br />Not too happy with the ANC either. You have to download the app in order to enable it—I tried without the app and trust me, even though you can touch the bud and receive the beep that it is turned on it hasn’t. It only worked for me after installing the app and enabling it.<br /><br />The sound is OK. The good thing is the app has an eq you can use. After creating a quick custom setting they sound better and a little louder. But they are still quieter than the AirPods Pro.<br /><br />Is it unfair to compare the two? Probably. But for anyone who has used the AirPods Pro this may give give an idea of what to expect. I had to replace my AirPods Pro because one of the pieces “disappeared” and I needed a temporary replacement. These were on sale and I generally like JBL products.", "The manual is crap, printed in low contrast font, too small for a human to read.  The earbuds won't fit regardless of which of the three ear pieces I use.  The ANC doesn't work.  The sound drops out intermittently.  And, most importantly, the manual sucks.", "The main ANC feature didn't work...was just silent. Only the talk-thru and Ambient Aware features worked. I did connect with Harmon customer service and they offered to send a replacement but I really don't care for the fit of these in my ears to go through all that. Will be returning."], "reference": [39, 16, 4, 1, 0], "score": [-0.6000000238418579, -0.4000000059604645, -0.4000000059604645, -0.800000011920929, -0.800000011920929]}