{"reviews": ["I was pleasantly surprised with the sound quality of these buds. Battery life has been as advertised so far. The one downside of these is the touch controls on the buds. They are extremely sensitive, which makes adjusting thee buds positioning in your ear nearly impossible without changing something. Additionally the out of the box set up puts the ANC (active noise cancellation) controls on one of the buds. Turning on ANC will use more battery and honestly isn't much different than with it off. Highly recommend downloading the JBL app which will allow you to configure the controls to either switch to something other than ANC, or to make the buds have no active touch controls at all. App also gives you some stock equalizer options and a custom equalizer option.", "Too Quiet?? iPhone users you MUST adjust (or turn off) the “Headphone Safety” feature in iOS Settings. By default it will throttle all headphones to be very quiet. It’s not the fault of these headphones!<br /><br />Having gone through several pairs of no name head phones.. it makes sense to just buy a known name brand sometimes.<br /><br />These really sound great. Very clean deep satisfying bass but not overpowering. Excellent highs and overall a very bright and rich experience. I can hear extra elements of the music that I didn’t hear with cheaper headphones.<br /><br />The ANC is good (not perfect) but definitely fills a need. If you’re a person that plans to use them for ANC alone (no music play) these are NOT for you. They just help isolate the extra noise when you’re listening to music or movies or podcast.<br /><br />Make sure to download the app and setup a custom EQ etc etc. That’s a big part of what makes these headphones great.<br /><br />Are they the best I’ve ever heard? Or are they as good as my $400 Bose headphones? Absolutely not. But they’re comfortable and compact and don’t break the bank.<br /><br />JBL has always been great quality at an affordable price. Reliable and dependable.<br /><br />Thanks JBL!", "I like JBL as a brand, and they do get it right most of the time with their products. In terms of earbuds, I have the Tune 115 and these buds have proven to be a solid product. The Tune 115 has survived some series of falls and water submerging without even having an IPX rating. I have seen the 130NC  on sale and had to pull the trigger. IMHO The 130s buds are a great value for sure. Pretty good noise canceling with a solid bass presence. Understandably, they are not as loud and bass saturated as my Sony WF-XB700(which has bigger-sized buds). However, these JBLs have other features such as ambiance mode, good touch controls( and I am someone who prefers button controls), and of course: a decent ANC.  The sound is clear and well-balanced, as expected from JBL. I like the app a lot btw..very easy to control and customize an EQ. The fit is so-so sometimes, but that could be solved with non-JBL ear tips. The supplied ear tips are good, but the size jumps a little between the small and the large tips... This minor issue does not warrant a one-star fewer IMHO-Especially for the sale price. You get SO MUCH more than what you pay for..", "The headphones are first rate, sound great, have amazing ANC too. The app and instruction manual are terrible. Unless the unit is connected to your phone you cannot access the manual or any headphone settings/controls within the app. This is a critical flaw. Additionally the instructions and the manual are very poorly executed and somewhat unclear and or confusing.", "Awful sound and I tried many devices. Won't stay in, tried the various cup sizes. I had an older pair of JBL in-ear headphones that were awesome in sound and stayed in so I don't understand how these could be *sooo* much worse. I ensured they are not in \"headset mode\" for music and played with the JBL app config as well - no luck. The only positive is they seem to work good in headset mode as other people say the mic is clear and ANC removes background noise.", "Switched from AirPods Pro to these…no regrets. Transparent mode and ANC are light years better. I don’t have the same issues with people on the other line being able to hear me on calls either.", "It’s pretty darn good the ANC is perfect and the audio quality is pretty good to a solid 10/10", "Initially they sounded great and the ANC worked well. However, immediately you will discover they do not stay in your ears, even when sitting still.<br /><br />Shortly after the return window closed, the left side became substantially quieter than the right. Based on the other reviews there is no fix.<br /><br />I ended up going with the cheaper Anker Soundcores which work just as well and are super reliable."], "reference": [9, 7, 0, 0, 0, 0, 0, 0], "score": [0.10000000149011612, 0.20000000298023224, 0.4000000059604645, 0.8999999761581421, 0.699999988079071, 0.8999999761581421, 0.800000011920929, 0.6000000238418579]}