{"reviews": ["i charged this up when i received it 2 weeks ago. I have used it a bit over the last couple weeks and it hasn't needed a recharge yet. I spilled coffee grounds on the floor, and boom it was gone. I live in a very dusty environment so this baby has done wonders. I am very impressed with this unit as usually when I buy lower priced items like this they don't work well, this one has exceeded my expectations!", "This is the handheld vacuum i've been looking for. It's unlike any handheld vac on the market. The thin design is perfect for reaching tight spaces, and the long length allows you to clean the floor without breaking your back. The design also makes it easy to store/charge without taking up too much space. It also has multiple suction settings, so you can crank up the suction power when needed. It's also a great car vac. The thin, long design will make it easy to clean those hard to reach areas in a car.", "We were having problems with the battery not recharging on other name-brand hand vacs. Bought this one to try and it has been super. I loved it so much I bought two more, one for each floor of the house, and recommended it to a friend.  They arrived charged, quickly and for a great price!", "Easy to clean, charge and has great suction power. Takes very little space. I use it for my car and to spot clean the floor in between sweepings. My only complaint is that mine came banged up and scratched and something inside rattles. I hope that doesn't mean it's lifespan will be cut short... that is the reason I am giving 4 instead of 5 stars.", "I used the handheld vacuum to clean my SUV.  It was very powerful to remove the dust from the seats and floor.  The dust container holds a lot of dust and is very easy to remove and clean.  The charge was long enough complete all my cleaning and it still had power.  It is lightweight and charges quickly to reuse again and again."], "reference": [17, 1, 0, 0, 0], "score": [-0.20000000298023224, 0.6000000238418579, 0.30000001192092896, 0.30000001192092896, 0.6000000238418579]}