{"reviews": ["The indicator light doesn’t work and the vacuum<br />Doesn’t feel like it even sits against the charger. I can’t tell if this has power or not because it doesn’t charge. Waste. I’ll be returning it ASAP", "Suction power is awful. I don’t know how this has so many great reviews. It wouldn’t even suck up dog hair from the sofa. Trying it in the car was a joke. It wouldn’t pick up anything. I returned it. Don’t waste your money or time with this worthless vacuum.", "I was looking for the quietest vacuum I could get without spending a huge amount of money.  The vacuum I have now is so loud it hurts my ears and I just can't stand to use it.  This is only marginally quieter, not enough to make me give it a great rating.  It is easy to assemble and use and it works just fine so if you take out the noise factor I would give it 5 stars.", "This vacuum stopped working after 4 weeks of only using it for a few minutes several times a week.", "Suction power ceased to exist . It was an extremely loud vacuum .", "Suction power seemed weak when I held my hand to it, but I never actually used the vacuum.  This thing is tiny and the reason I want to return it. That is when I found out it cannot be returned. I've been spoiled by good sellers who accept returns. I will be more careful in the future.", "This vacuum has no suction to it", "The vacuum arrived charged so there was no need to charge it when I first used it. The suction power was decent. When I  placed vacuum on the charger, the charging light did not turn on and there was no indication that it was charging. I sent a message to  vaclife.service@gmai.com reporting the problem but have not heard back.  The vacuum is useless if I can't charge it", "[[VIDEOID:cacaec2314d6ddd7e8ff67f25aec8ebe]] Yesterday my daughter brought the vacuum to me and told me it wouldn't turn off.  Sure enough, as the power button was pressed, the vacuum would cycle between low, high, and low again when it should have turned off.  I included a video of it happening.  Occasionally there would be a whiff of smoke.  I dropped the vacuum in the yard and kept a fire extinguisher handy until the battery eventually ran out. Too bad, because for the two months we had it, the vacuum was pretty decent.  :("], "reference": [20, 19, 13, 3, 1, 0, 0, 0, 0], "score": [-0.30000001192092896, -0.800000011920929, -0.20000000298023224, -0.4000000059604645, -0.20000000298023224, -0.20000000298023224, -0.20000000298023224, -0.06666667014360428, -0.07500000111758709]}