{"reviews": ["Bought this car vacuum through a vendor promo and super happy with the purchase! Its so sleek and has great suction. No complaints!<br /><br />Update: Unfortunately the vacuum is not holding its charge. I charged for 3 hours and it worked for less than 1 minute. So then I charged overnight and it cut off 5 minutes inti vacuuming my car. Still great suction just bad with holding the charge. I am going to request a replacement with Amazon in hopes this particular vac is just defective.<br /><br />Update 2: Replacement received and its a winner! After charging it, I tested it throughout the day to see if the charge held up and it did. Also noticed the charger pieces fit together better than the origin vac, confirming the original was just defective.", "Suction power is awful. I don’t know how this has so many great reviews. It wouldn’t even suck up dog hair from the sofa. Trying it in the car was a joke. It wouldn’t pick up anything. I returned it. Don’t waste your money or time with this worthless vacuum.", "I added the picture because it looks even better than the product page. The barrel is actually not clear which I like. It looks very sleek sitting on the counter. The thing is so straightforward you almost don't need to read the instructions. It has an extra paper filter even though I think one would last a long time. When I first used it I didn't realize I was in \"first gear\" and it was already powerful enough that way. This replaces a much larget Ryobi. It seems to have 2 or 3 times the suction and is MUCH smaller and sturdier. It feels like a solid tool and not a handful of plastic. I'll use it mostly in the house but the shape makes it good for getting to hard to reach places in the car.", "I bought this after reading the great reviews. It was very easy to put together and is very easy to clean. Those are the positives. Holds charge for 20-30 minutes, as stated in the listing. That being said, it’s mediocre at best. I was expecting it to be powerful and pick up every hair, fiber and crumb. I used it in my car and was disappointed. However, I used it to pick up crumbs on the couch and on my stairs which are carpeted and it did well. So maybe it’s just not strong enough for vehicle use, which is why I bought it. So I’m disappointed in that but it works well for small messes and quick clean up on regularly carpeted areas.", "It did burn and smoke was coming out of it the first time i tried to clean up my car.", "If you have multiple kids (like me) that likes to make mess then this ain't it! The suction is very weak. I'll still have to go pay to vacuum the car out. I would not recommend.", "Great little vacuum. Took a couple hours to charge it, and started cleaning my car. Perfect to clean under the seats in those hard to reach crevices"], "reference": [41, 19, 17, 2, 0, 0, 0], "score": [-0.20000000298023224, -0.30000001192092896, -0.10000000149011612, -0.20000000298023224, -0.4000000059604645, -0.10000000149011612, -0.30000001192092896]}