{"reviews": ["Worth every penny I spent. Not only does it come in a convenient size, but it also has powerful suction and handy attachments for different surfaces. The usage time is about 45 minutes on a full charge which is pretty good compared to other cordless vacuum cleaners I've used in the past. It is lightweight, easy to handle, and does a great job of getting rid of dirt. I use it as a multi-purpose cleaner, both for my car and my room. At this price point, I don't think there are any other options as good as this.", "I was surprised by the small size. It has fairly good suction for picking up crumbs and lint, but I don't think it would be useful for  bigger cleanups. The cylindrical shape means that every time you set it down on a surface it rolls away. Tonight I set it down on the kitchen counter. It rolled away, fell off the counter, hit the floor and spilled dirt all over. The on-off switch is also in an awkward place. It is on the underside of the handle, which means it is way too easy to accidentally turn it off and on while vacuuming. You also have to remove the end part of the vac every time you want to set it in its stand and/or recharge it.  This hand vac is okay, but not great.", "I bought this handheld vacuum to clean the crevices in my bird room (for fallen seed and feathers. I also use it to clean my car. It's powerful for its size and easy to use. I will definitely buy it again if I ever need a replacement. I've had it for a few months now and it still works perfectly. Plus, it's cool looking so I don't have to hide the charging base.", "This vacuum is convenient and easy to use. The suction power is fine, given its size.", "Convenient mini handheld vaccum. Has great suction, picks up dust, crumbs, my long hair, etc.  The size of the vacuum is perfect for me to keep around the house. Doesn't take up too much space but does the job well. Especially for areas I can really reach to clean, such as the corner of my bed or the bottom of some furnitures. I even use it for the ceiling corner or areas that I see dust. I also like the indicator light, red when it is not fully charged, once it's done charging, it will show a blue light! Product is simple to use, putting it together and taking it apart for cleaning. I am unsure how well the battery life is. I do use it often but for a short period of time (10 mins or so). I would charge it once a week, so I never reach the low battery. No issues or complaints as of now, so 5 stars! Hope this helps :)", "This vacuum is quite powerful and light, making it super easy to clean my car. The power really got me for such a small size. I have used several handheld vacuum before but this one is really impressive I have to say", "I love this vacuum.  It's so different from my last handheld, which was a traditional shape and size.  This one is black, thin (it's similar in size to a rolling pin), very sleek and has its own stand/recharger - which makes it look more like a piece of art than a utility.<br /><br />It has very powerful suction, both on the low and high settings.  It's easy to take apart and clean and obviously very portable.  I keep it in my car until it runs out of power, then bring it back home for a quick recharge.<br /><br />Overall, it is one of the best vacuums I've ever purchased, love it.", "I only remember the dustbuster from the 80s/90s so I was hesitant to get this. So glad I did, it makes the little messes so much easier to clean, including the car. It is a couple steps to clean the filter, but still easy. The charging stand is why I went with this style. It's about the size of a bottle of wine and takes up less space than my coffee maker, just for reference.", "So far so good. Well made. Easy to put together and easy to empty. I like the hepafilter. The suction is pretty good considering the size of the vacuum. I should have bought one sooner.", "This portable vacuum is amazing!! I was really impressed when I opened up the box because it was so small. The vacuum is very sturdy and well worth the money. I have used it to vacuum my couch cushions, baseboards and under the beds. The suction is good for its size. Another thing I love about this vacuum is the recharging station. It sits nicely in a corner of my dining room ready to go for any spills. It’s super easy to clean too, just open the hatch and dump into the trash!!", "What a way to have this at such a compactable size yet so powerful. The suction is really great and the cleaning was so easy to do. This product have really reduced the efforts and have really worked well beyond my expectations.<br /><br />A must buy product..", "The vacuum has great suction power for its small size. The charging dock works well and holds the vacuum upright for storing. The attachments make it particularly great for use in the car and getting crumbs out of crevices!! I currently just leave it in the car and bring it in for charging.", "This handheld vacuum has great suction power. It isn’t noisy. Gets the job done fast and it’s easy to recharge. The size is perfect. Perfect for those small areas hard to reach or for people living in small places with not much storage.", "Only got it for a week but the vacuum is way smaller than I expected. It is definitely powerful for its size. I like keeping it in the car and be able to vacuum when needed.", "Perfect little size hand held vac. We have a very nice large vacuum but wanted something simple and small for lighter tasks. This vaclife mod was perfect. Very good looking and the size is so conveniently small. Works for what we needed it for", "Absolutely love the vaccum. Perfect size of a handheld vacuum. Easy to clean and strong suction", "Awesome small vacuum. Light weight with good suction power for the size. Great for detailing my car. Good battery life and super convenient. Love the attachments.", "This is a perfect vacuum for small jobs. Powerful suction. Its a bit heavy for the size but nothing that cannot be handled. The stand is very convenient to store the attachments and change the vacuum. Using it for small cleanups (not wet) in the bathroom.", "This vacuum was smaller than I pictured but it works better than I imagined! The only down side is it needs emptied frequently due to its size."], "reference": [18, 9, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.8999999761581421, 0.20000000298023224, 0.8999999761581421, 0.20000000298023224, 0.5, 0.30000001192092896, 0.29375001159496605, 0.5, 0.4000000059604645, 0.6000000238418579, 0.5, 0.699999988079071, 0.8999999761581421, 0.6000000238418579, 0.5, 0.699999988079071, 0.5, 0.20000000298023224, -0.30000001192092896]}