{"reviews": ["Worth every penny I spent. Not only does it come in a convenient size, but it also has powerful suction and handy attachments for different surfaces. The usage time is about 45 minutes on a full charge which is pretty good compared to other cordless vacuum cleaners I've used in the past. It is lightweight, easy to handle, and does a great job of getting rid of dirt. I use it as a multi-purpose cleaner, both for my car and my room. At this price point, I don't think there are any other options as good as this.", "so glad i found this so i can stop lugging the heavy vacuum downstairs to my car. it's main purpose, for me, is to keep the car mats and seats clean. it does a good job with that and didn't take very long to charge the first time. i had to use it twice for a bug emergency but while it did work and sucked them up, i advise against doing that because the bug has to be released. so if you're afraid of bugs (like me), probably not a good idea.", "I added the picture because it looks even better than the product page. The barrel is actually not clear which I like. It looks very sleek sitting on the counter. The thing is so straightforward you almost don't need to read the instructions. It has an extra paper filter even though I think one would last a long time. When I first used it I didn't realize I was in \"first gear\" and it was already powerful enough that way. This replaces a much larget Ryobi. It seems to have 2 or 3 times the suction and is MUCH smaller and sturdier. It feels like a solid tool and not a handful of plastic. I'll use it mostly in the house but the shape makes it good for getting to hard to reach places in the car.", "Purchased this vacuum for my car after reading lots of reviews tried it. The battery is short and the suction is not strong. Followed instructions. The charger has been on red meaning charging for over 4 hours and still hasn’t said fully charged.", "This little vacuum only gave me a few good days. Vacuumed my car and suction was just okay. After a few days of owning it, it turns off after 5 seconds, with a full day of charging. You get what you pay for/lesson learned. The positive reviews fooled me.", "This is the handheld vacuum i've been looking for. It's unlike any handheld vac on the market. The thin design is perfect for reaching tight spaces, and the long length allows you to clean the floor without breaking your back. The design also makes it easy to store/charge without taking up too much space. It also has multiple suction settings, so you can crank up the suction power when needed. It's also a great car vac. The thin, long design will make it easy to clean those hard to reach areas in a car.", "[[VIDEOID:8dfdb6a309c2fd7e115bf8f94ab9b623]] Bought this for my girlfriend to use in her car. After weeks of using, here is my pros and cons of this item:<br />Pros: Very easy to assemble and easy to use, you just need to follow the manual which is very straightforward.<br />Lightweight<br />Decently long battery life<br />Very easy to clean and maintain<br />Cons:<br />The suction power is a little weaker than the other model VL189 that I owned, so this vacuum is only good if you wanna clean the table or your car interior.<br />Note: Remember to charge the vacuum after3-4 months of usage, and also register the product on their website to get an extra 2 years warranty (which is very good in my opinion, they will send a new product if yours is broken)", "I like that it’s very light easy to use has a good battery life and I use it for cleaning all  areas in the car and the house furniture.", "Has high and medium power with multiple crevice tools. I use it in the car. So far, it holds its charge long enough and has not died while cleaning the car.", "Vacuum picks up very well, easy to clean. For me the best feature is the length of the tool, it reaches everywhere with out much bending over. I can vacuum the mats without getting in the car, gets between seats too. I'm going to buy another and give it as an  x-mas present. Very pleased.", "I bought this for my new car, I have 2 pugs and a lab and while I did also get a liner for the car I wanted something easy to use and cordless to get the hair off the liner once it builds up. Works great for what I need it for.", "Easy to clean, charge and has great suction power. Takes very little space. I use it for my car and to spot clean the floor in between sweepings. My only complaint is that mine came banged up and scratched and something inside rattles. I hope that doesn't mean it's lifespan will be cut short... that is the reason I am giving 4 instead of 5 stars.", "Very powerful hand vac. I like the 2 speeds. We have 2 big dogs that love car rides,  and this is great for the car. Runs long enough to clean out the truck.", "First, the packaging was impressive...sturdy and double boxed for shipping. Was pleasantly surprised to see an extra filter was included.  After one use (there was a lot of debris from the floor mats on the car) the filter was durable and easy to clean.  It has a small nozzle so it's meant for small areas, and there are 2 separate attachments.  I will use this mainly for small areas in the car, and for my sewing room to pick up small pieces of thread. Overall, this is a quality product and I'm pleased with my purchase.", "This vacuum is quite powerful and light, making it super easy to clean my car. The power really got me for such a small size. I have used several handheld vacuum before but this one is really impressive I have to say", "This product is really amazing and i can refer my friends.  This is so handy and has a powerful suction that cover every corner of my home.  This comes with a small LED light but has clear visibility during the night.  I can use it on my car too and don't need to stretch much as the handle is more convenient for in-depth cleaning where my hands are not reachable. This stand helps me to place the vacuum anywhere I like and does not occupy much space.  And it comes with two settings which are cool for this price.  It's worth having it for every home!!!!", "Very powerful hand vacuum, good for quick cleanups around the house, in the car etc. Easy to use and clean. Comes with extra filter and two attachments for edge and carpet work. Simple unlock to change/clean filter, and one button opens up container holding dirt to be emptied. Two power/speed settings. Charges quickly. Would recommend.", "I love this vacuum.  It's so different from my last handheld, which was a traditional shape and size.  This one is black, thin (it's similar in size to a rolling pin), very sleek and has its own stand/recharger - which makes it look more like a piece of art than a utility.<br /><br />It has very powerful suction, both on the low and high settings.  It's easy to take apart and clean and obviously very portable.  I keep it in my car until it runs out of power, then bring it back home for a quick recharge.<br /><br />Overall, it is one of the best vacuums I've ever purchased, love it.", "I like the vac very much.  It is slim so it tucks into any space.  Love the length because if I need get a bug I don’t need to get too close and it empties easily outdoors.  Also love the two speeds very convenient for different jobs around house and in car.", "This is the perfect vacuum for my needs - both for car and entry rugs!  Works great!", "- I like that it’s small enough to not be an eye sore (easy to store away)<br />- Low and high suction for carpet or hardwood floors<br />- Great for cleaning my car, car seats, & sofa<br />- I like that you can rinse the filter with water and re use it", "The vacuum that showed in my order was not the item actually purchased. There was a generic hand vac shown in the order. It all turned out ok, and the item came with both the everyday filter and the hepa version. Nice extension tip that appears to have good suction. Overall, for the $$ it was a good value. Should  be good for the car.", "[[VIDEOID:bc4adce216f874417e710245917f72bf]] Very useful for cleaning car from dust and dirt", "Needed to give my car a good vacuum and this did the trick!", "I only remember the dustbuster from the 80s/90s so I was hesitant to get this. So glad I did, it makes the little messes so much easier to clean, including the car. It is a couple steps to clean the filter, but still easy. The charging stand is why I went with this style. It's about the size of a bottle of wine and takes up less space than my coffee maker, just for reference.", "Great little cordless vac. Good power and sucking ability. Good for bugs too. Eats em right up. Amazing, flys are gone in an instant. Might even get another one. Excellent for car pick up as well. Would recommend to anyone.", "This elegant design cordless Vaccum is more helpful to clean all corners. I am using this to clean my car, book shelf, TV table and other small areas. 2 level suction power and battery run is very good. I had other cordless vaccum which is little heavy to carry. But this VacLife Handheld vaccum is more handy, light weight and compact to use.", "I have tried a few different handheld vacuums to use for little clean ups in the kitchen and to clean my car, and this one is my favorite. It has a nice modern design that is small to fit in tight spaces. It has a convenient charging station included that is really convenient. It holds a charge for plenty of time to vacuum out my car or use for kitchen clean up throughout the week. Great vacuum and great price!", "I like how small this vacuum is. Perfect for my car, smaller enough to keep it in my trunk but has enough power to clean.<br />Also perfect for light vacuuming around the house when you don’t feel like dragging out your huge vacuum.", "The best features Of this pump are that it also deflates your items and that it plugs into your car as well as a normal wall outlet. It works great to blow up our inflatable kayaks and other water toys.", "Vaclife is Exactly what I’ve been looking for in a portable vacuum. It’s easy to put together out of the box. The suction power is super impressive and more than I anticipated. Besides the suction power, the ease of cleaning the Vaclife is unbelievable! I know that this product will last so much longer just because I will do the upkeep on it. It’s too easy not to do it. Definitely a must in your car and light household cleaning!!", "I purchased this vacuum solely for my car. It did a good job with the charge lasting all the way around the car, cleaning the back and front floorboards. However, the suction, even on the highest setting, was quite poor. I found myself going over the same grass clipping at least 3 times.", "Convenient, small and great suction! Love having this little guy for my brand new car!", "Cleaned every crevasse of my car. It was filled with Cheerios and crumbs from my 1 year old and now my car has never looked better!!!", "My VacLife hand vac deserves 5 stars because ~<br />*it arrived quickly & well boxed<br />*the suction power is adjustable & quickly sucks up dirt & debris in my car & home<br />*the vac & charging stand is sleek & can be placed anywhere without a problem<br />*the battery charges quickly & stays charged for a reasonable time", "This is by far one of the best purchases I’ve made on Amazon.  I bought this to use for my car and it worked great!  The suction power and battery life are pretty good, considering it’s a mini handheld vacuum, so it’s meant to be used for spot cleaning and other smaller, shorter cleaning jobs.  For larger jobs, you obviously would need to bring out the big guns (aka, a regular vacuum).  But for spot cleaning, this tool is perfect.  It’s also very lightweight, aesthetically pleasing, and smaller than I expected, which is a plus.  It doesn’t take a long time to charge either, and it’s easy to clean.  It got rid of a lot of dirt and other small debris after only using it a couple of minutes.  Overall, I’m very happy with my purchase and would recommend this product!  Some people have said they received discounts or other rewards for their reviews, but I would like to clarify that I received no such thing, so this is 100% my genuine review.", "Best portable vaccume youll ever find super perfect for cleaning the car and worth every penny.", "The company offers you $30 dollars back if you give this product a 5 star review. It is not worth even a one star review for the price you pay. It has very poor suction and the battery does not last long. It doesn't have attachments that work well in your car. Don't waste your money.", "I absolutely love this little vacuum!! It is exactly what we need around the house with a baby that finds any little thing to put in her mouth! Instead of lugging the entire vacuum out for little messes this is perfect! It has great suction and has 2 speeds for extra suction. I use it for everything in my home, and also plan to use for our car as well since there is no way to vacuum our car any other way this portable vacuum is what we needed! I was so skeptical and took forever looking for vacuums and their reviews. Any bad review on here is a lie!! Seriously buy this vacuum it’s worth the money and works great!! #vaclife 🤣", "I already have one handheld vacuum but bought this one as it is cozy and light weight and don’t want to use my home vacuum in car. Overall solid build. Its not very powerful but it does it work. Because of its design it is very useful to vacuum edge and corner where regular size vacuum can’t reach. It has three level of filter to protect the motor which I like most.", "This is a good vacuum cleaner, its good for small cleanups like kids mess and to cleanup your car, its is very slim compared to other handheld vacuums. The suction power is good. It has two speed suction options and so far its battery life is good. It came with one extra filter and its easy to maintain and clean.", "The vacuum has great suction power for its small size. The charging dock works well and holds the vacuum upright for storing. The attachments make it particularly great for use in the car and getting crumbs out of crevices!! I currently just leave it in the car and bring it in for charging.", "Great powerful vacuum for small area in the car and corners", "Love this vacuum! I’ve been wanting a powerful vacuum for my car, stairs, kitchen, etc! This definitely exceeded my expectation! A definite must have!", "[[VIDEOID:ffae2b51358a91fb5b126c44c092ea73]] I had bought initiattly a car wired one... but then saw this one and felt inlove.. I even use this one for the car and have forgotten the other one! This is my new best friend... helps me a LOT with the dust and allergies! Don't hesitate to buy this one over. YOU WON'T REGRET IT!", "This vacuum cleaner is very powerfull.it is lightweight, runs well and good battery time. I tried to clean carpet & car and it cleaned very well. It comes with tons of attachments so you can clean all different kinds of messes also has a heavy duty metal filter which isn't easy to clean. This has a stand to charge.", "[[VIDEOID:a4b5c9538249c94bb4dd181e6a62ded4]] its very good looking feels expensive.<br />it does have some suction as you can see on the video and the battery holds good so far like 20 mins use and still have power.  those adapter extensions are very handy for my car in between the seats thats the main reason i got this vacuum, the only thin os the filters i dont know yet where i can get more ,  and they do keep the dust in the vacuum very good one. it charge fast and its a nice led on the power button red and green lets you know when fully charged.", "This is very compact to store inside the car. It looks so good with powerful suction in it.<br />Easy to clean and better battery life. I like this product very much.", "This is a great vacuum to have for your car! The sizing is perfect to keep in the car since it’s not too bulky of a product. It has 2 different suction power settings, you just press the power button twice. Suction is decent and since it has small storage for what ever you sucked up with it, I only recommend this product for people who don’t need to clean a big mess or have to use it for longer than 25 mins since it does get hot.", "The vaccum is powerful and clean my rug and my car like a charm!", "This little vacuum is powerful and just looks cool. Bought it for the car and works perfectly! Couldn’t be more pleased.", "Great vacuum , small , compact but soo much suction, great fir the couch, the car, kitchen counter, small spaces", "[[VIDEOID:26ac7d4e17a044f8a6f50ce633aea7e7]] I got this for my car and absolutely love this thing. It is so light weight and easy to use. The vacuum is very strong, it has two different power settings depending on how dirty your car is. I love that it has a filter which can be replaced if it gets to dirty. It's easy to clean the tubes, I can take off all of the parts to really clean it and they can be washed except for the filter. It also comes with an extra filter for replacement. It doesn't take to much space because of its slim design, and it fits right next to my car seat which is awesome. I love the cool design, it looks so much like a light saber. It comes with a stand which automatically charge the vacuum once it is placed. The stand also has a place to store the tips for the vacuum cleaner. The battery last pretty long, I've been using it for a week and it still hasn't run out any power. It comes with a 2 year warranty which is good considering the price you pay for. Definitely recommend for a car vacuum cleaner that doesn't take too much space and can be easily stored anywhere in the car.", "Bought this for a car and love this “handled” feature. This is small and has good battery life. Easy to reach small areas in the car and it’s super lightweight too.", "This vacuum is really helpful and very easy to use. It comes with multiple options to put in the front which help you clean what you want easily. It also has two different suctions. The charger is very good and the battery has long time to empty. It’s really good to stay your car cleaned! Highly recommend it.", "Over the years I have purchased several handheld vacs and I am very happy with this VacLife handheld vacuum.  It is: 1) Powerful - it picks up even hard to suction particles that are embedded in carpet and it's great for quick clean ups and to use to clean your car.  2) Great to Use - because of it's slim design I can get into spaces that other handheld vacs cannot enter or reach. 3) Sleek - the design is attractive. It is not a bulky eyesore on your counter top.  I recommend this vac to anyone who is looking to purchase a handheld vac.", "Only got it for a week but the vacuum is way smaller than I expected. It is definitely powerful for its size. I like keeping it in the car and be able to vacuum when needed.", "Having a dog + toddler, and constantly on the road, needed something to help keep my car clean - and this certainly does the job! Wish the crevice nozzle was a little longer to fully get under / in between my seats but for the price you can’t go wrong!", "I was surprised by the strong suction power this had! It’s the perfect vacuum for your car or getting into small tight spaces. I recommend!", "Things I really like are that it is compact rather than bulky and therefore fits into smaller spaces than other hand held vacs. It has 2 speeds, for better suction. The crevice tool is longer and fits into smaller spaces, making it ideal for quick pick ups in the car.", "I already had a couple of mini vacuums from VacLife before and have been very happy with them, one for the car and one for home.  I thought to give this one a try too to use it for cleaner areas like inside the fridge, the table top, etc. so that I don’t mix them.  It came very fast and it was a pleasant surprise to see how sleek and beautiful it is.  It is smaller than the other two, but mighty strong with two settings and two attachments.  Plus that it has a nice stand (it is about 18 inches when standing).  Works perfect for me!", "This handy cordless vacuum is easy to use and clean, even it has great suction power and easy to use in car, sofa, stairs and even in the kitchen floors.", "Perfect sized hand held vacuum to clean my car with. Has a more powerful suction compared to the other big brands.", "I bought this to vacuum the inside of my car. It's easy and fast to put together and charge. It comes with a brush attachment and a detailing attachment. It has 2 different suction powers. It was convenient to use to clean my car and got up all the leaves/dirt/rocks from the carpeting pretty easily especially if I applied some pressure. The detailing attachment was great for nooks and crannies. Best of all, it's super easy to disassemble and clean (which it says to do after each use). I also love that it's small, easy to store, and attractive.", "Very impressed with this vacuum! I was able to clean my car in less than 5 mins! Definitely found a winner and I’m going to get another one for my sister. So much easier than having to use a household vacuum.", "I love this hand vac!! It has made my cleaning life so much easier!!  I’ve had other handheld vacs that have been complete disappointments. I decided to give this one a try and I’m so glad I did!! It’s very versatile and is perfect for around the house and in the car. I even took it to work the other day to clean up some areas that get missed by the cleaning staff. I LOVE this vac!!", "I bought this handheld vacuum to vacuum my car. Hiking brings a lot of dirt into the car. This vacuum was amazing! It had a lot of power and was able to suction up the dirt in my car. It was also very easy to clean. I am very pleased with this product!", "Great for small light jobs. Use for dropped crumbs, and around my plants and after sweeping a small pile of dust and dirt. Okay for car but nothing heavy.  Love it! Works for me.", "Awesome small vacuum. Light weight with good suction power for the size. Great for detailing my car. Good battery life and super convenient. Love the attachments.", "Great little vacuum. Took a couple hours to charge it, and started cleaning my car. Perfect to clean under the seats in those hard to reach crevices"], "reference": [18, 18, 17, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.30000001192092896, 0.699999988079071, -0.10000000149011612, 0.20000000298023224, 0.5, 0.20000000298023224, 0.26250001043081284, 0.800000011920929, 0.1750000026077032, 0.10000000149011612, 0.10000000149011612, 0.4000000059604645, 0.4000000059604645, 0.03750000149011612, 0.800000011920929, 0.30000001192092896, 0.6000000238418579, 0.30000001192092896, 0.8999999761581421, 0.6000000238418579, 0.699999988079071, 0.30000001192092896, 0.6000000238418579, 0.6000000238418579, 0.8999999761581421, 0.8999999761581421, 0.10000000149011612, 0.30000001192092896, 0.6000000238418579, 0.4000000059604645, 0.699999988079071, 0.6249999897554517, 0.8999999761581421, 0.4000000059604645, 0.6000000238418579, 0.5, 0.8999999761581421, 0.30000001192092896, 0.48750000074505806, 0.4000000059604645, 0.6000000238418579, 0.02500000037252903, 0.5, 0.4000000059604645, 0.1625000024214387, 0.10000000149011612, 0.5, 0.20000000298023224, 0.6874999925494194, 0.8999999761581421, 0.699999988079071, 0.699999988079071, 0.3037036974672918, 0.6624999903142452, 0.800000011920929, 0.4000000059604645, 0.6000000238418579, 0.800000011920929, 0.4000000059604645, 0.20000000298023224, 0.6000000238418579, 0.800000011920929, 0.699999988079071, 0.5250000208616257, 0.800000011920929, 0.800000011920929, 0.21250000409781933, 0.10000000149011612, 0.800000011920929, -0.30000001192092896]}