{"reviews": ["If you intend to vacuum up the little spider webs in corners and crevices, this is not a good choice at all.  The suction is not strong enough and every little thing gets stuck in the bristles.  I've tried using it with each of the 3 attachments and these webs get caught on the inlet every time.  This vacuum is only good for very small/light weight debris, as illustrated in other reviews with videos.  We bought this to avoid having to break out the canister vacuum for quick jobs.  If you don't want to physically handle and remove each piece from the collection canister, then use another machine with a bag collector.  I personally don't like picking out each little bug or nastiness that I suck into this machine.  I read all the positive reviews and was a little suspicious because they were all made within a couple weeks of each other.  The reviews truly seemed too good to be true and I was right.  Since I through away the box, I probably can't return the item, but at least it was only 50 bucks.  That might be a real concern for someone else, so make sure to keep the original packaging.  One last note:  The battery may be \"fast charging\", but it still takes a long time.  I hope this helps someone and I rarely leave negative reviews unless it's important.", "[[VIDEOID:4d689f2c2c8554e81179f3d1360f14fd]] I purchased this vacuum to use primarily in our garage to keep our cars clean and for other light duty work.  We also have a Dyson available for higher demand jobs.  I tested the VacLife against the Dyson hand held  in an identical job cleaning white talcum powder off black car mats.  Arguably that's an unfair comparison given the Dyson costs 4 times more than the VacLife, but I was curious as to how well the VacLife would perform.  Surprisingly, it did very well.  On a first past test both vacuums did equally well.  A video of the VacLife's performance is attached.  Amazon only allows one video per review so I can't post the Dyson's performance or the video of the 2nd pass.  During that the VacLife removed all the remaining talcum powder residue.  In the attached video, I used both power settings (normal and high) so you can hear the difference.  Suction using both settings is strong and consistent.  The VacLife comes with two attachments which store nicely at the back of the base.  I can't review battery life yet as the unit is new, but it arrived fully charged, and only required a few minutes on the charger to fully charger after light use.", "so glad i found this so i can stop lugging the heavy vacuum downstairs to my car. it's main purpose, for me, is to keep the car mats and seats clean. it does a good job with that and didn't take very long to charge the first time. i had to use it twice for a bug emergency but while it did work and sucked them up, i advise against doing that because the bug has to be released. so if you're afraid of bugs (like me), probably not a good idea.", "This handheld vacuum is great! It has two different speeds to run at, so you have plenty of power available for tougher stuff. Runs for a long time between charges, but it has a really convenient to use charging base included with it. Came with a second replacement filter. Easy to empty. While it isn't heavy, it feels substantial and well made. Definitely recommend this vacuum.", "Straight forward vacuum. Base is convenient for charging and looks nice. Included 2 part filter keeps any particles from blowing back out and the entire unit minus the motor/electronic part is easily cleanable. It has two modes, Low and High. It is of average loudness, but it is a vacuum cleaner so I would be surprised if it was quiet. It also survived a 5 foot drop onto terazzo flooring with no issues.", "First of all, I was pleased to realize how small is this vacuum and yet so powerful. The suction is is very good even  at position number 1.  It is very lightweight which makes it very comfortable to use. I like the feature that both filters are washable so you do not need to buy any extra bags.<br />Nice addition to my full size vacuum when I need just to clean some spots. Overall, very good product. Highly recommended!", "I initially encountered some issues with this vacuum. It arrived with a broken filter, but I worked with the seller who was incredibly professional. I am a bit of a vacuum connoisseur having bought a number of cordless handheld vacuums over the years. In rating any product, it's important to remember the price. This is a less than $50 vacuum so I didn't go in expecting it to have incredible suction, and in my experience, you don't actually want gaudy suction because invariably the battery life will run out quickly. I have a Dibea cordless, handheld vacuum, which is excellent (and twice as expensive). It's an extremely powerful 1700PA at max-power (this one is. That's great, but it only lasts about ten minutes. The suction for this Vaclife is good, though on low-power it's not strong enough to suck up much of anything, so I only use it one full-power and the battery life lasts for about 15-16 minutes, but wanes in the final couple of minutes. The motor for this vacuum is AC. AC motors tend to be a bit louder and not quite as efficient or enduring as DC Brushless motors, which are a more recent invention and can be found in other cordless handheld vacuums, but they typically have higher price points. It takes approximate 3.5 HRs to charge this vacuum from empty (red) to full (green). Cleaning out these types of vacuums is always challenging since a lot of dust/particles get stuck to the paper filters, as opposed to getting trapped into the plastic collector cup. This means you have to actually pick the very debris you've vacuumed up out of the filter with your bear hands (I don't recommend using a brush or water, at least not often, as it will quickly degrade the paper filters, and you only get two of them and I've already contacted the seller about getting more filters and it seems as though it's not possible). It comes with two attachments, a crevice tool and an upholstery brush. The vacuum has a sleek design that will fit in with any decor and can be stored, along with the attachments, on a stand that charges it.", "[[VIDEOID:7f244655dfe885ecf6f55ba221d5ce00]] The reason I bought this vacuum is I like the look of it haha! It's uniquely slim instead of chubby looking like most other portable vacuums. It takes 2 hours to fully charge for the first use. It lasts about 30 mins for each charge. It's not bad compared to Dyson. Its slim design with a soft brush head that really to clean my super dirty fan easily. I've used it to clean the vent of my air purifier and my fan. It does the work very well. It's bagless so I only need to release the dirt into a garbage bag, rinse the stainless dust cup and the HEPA filter with water when the dust container is full. It's more environmentally friendly than bagged vacuums.", "[[VIDEOID:c5979a42f14a4dc28a21aaf187a02a0d]] This handheld vacuum is the BEST!!! It has two levels of suction that gets the mess cleaned all up in no time. I don't have to charge this vacuum often and when you're ready to clean your filter it's just so simple. I highly recommend this vacuum. I've been through two different other ones and this one by fair is my favorite.", "I purchased this vacuum for my home office. Sometimes I just want to vacuum a little bit to neaten out my work space without having to bust out the big vacuum. This little guy works perfectly for what I need it for. Ever since working from home became a thing, my office space was used a lot more. Obviously when you work at home you end up eating at home too so that included eating in my office. This vacuum has been very convenient because it's so compact and has enough suction to pick up all the little crumbs and dust around the office. It comes packed with everything you need, a charging stand, extra attachments, 2 dust filters and one even comes pre-installed. The unit I received had a battery charge so I was able to use it right away. I can't speak to exactly how long the total run time is or how long it takes to charge, but I purchased this with the understanding that this is a handheld vacuum designed for small jobs, if I need to do a deeper clean I'll have to bring out the bigger vacuum. If you need a stylish handheld vacuum that performs well, then you should give this vacuum a try.", "[[VIDEOID:5991a2baf8044f2a8403eff5e83e0135]] This vacuum is light weight and easy to use. The charging base looks sleek and at home in about any room in the house. I tried it out on a couch that had recently been visited by 3 dogs that tend to shed a lot.  It collected all the fur very nicely.", "This vacuum is for a very very simple job. I bought it because it had good reviews from people but it is definitely not good for me. Disappointed.", "Purchased this vacuum for my car after reading lots of reviews tried it. The battery is short and the suction is not strong. Followed instructions. The charger has been on red meaning charging for over 4 hours and still hasn’t said fully charged.", "This little vacuum is wonderful. Total life saver. I have two dogs that shed CONSTANTLY and, while I have a Roomba that keeps up with most of it, this vacuum is great at getting the corners and areas the Roomba can't get to. Gets all the dust on the furniture. Great for dog hair on couches too! Love this thing and the clean up and disposal is easy. .", "[[VIDEOID:a8dee4bd0779f449f47c19f828b398d]] Powerful and lightweight handheld vacuum that is compact enough to fit on a side table and it looks good too. It has great suction and the attachments are wonderful. It is easy to empty out too. Just had my 6 and 8 year old nieces over and they made a mess. They were both fighting over who would use the vacuum to clean up.", "[[VIDEOID:51e7eae754991cb5fe083e48c2a3de4e]] I got this vacuum for using on my car and cleaning furnitures etc. It has really nice design and it is very lightweight as well. Dissection power is as expected and does a good job of picking dust and stuff. Obviously you have your items it cannot pick because of the size and the container size is decent as well for a handheld vacuum for vacuum your car or sofa. Overall I think it's a good value for the money and does the job as expected I would recommend it if you're looking for a small handheld battery powered vacuum for cleaning your cars or furniture.", "[[VIDEOID:860f5697cf0acab0f76d8da25187af0d]] This slim handheld vacuum is a real winner in my book. It fits  easily in your hand, and with it's slim design it will get into tight areas that a regular dust buster or bigger vacuum just can't. Clean your car, spills in your kitchen, and in those hard to clean areas like under cabinets, or the fridge.  It charged up in a few hours and was cleaning up, and with those two speeds, it can get the crumbs and dust sucked up for you. This is a real winner in my eyes.", "Really like this vacuum. Looks modern, is definitely not cheap (materials feel strong), and I like that the filter is reusable. Charging dock is my favorite part—I like not having to grab a plug and plug it in every time I need to charge it. My only complaint is that the suction noise is a little high-pitch (as opposed to a lower pitch), but it's really not a big deal.", "This is the handheld vacuum i've been looking for. It's unlike any handheld vac on the market. The thin design is perfect for reaching tight spaces, and the long length allows you to clean the floor without breaking your back. The design also makes it easy to store/charge without taking up too much space. It also has multiple suction settings, so you can crank up the suction power when needed. It's also a great car vac. The thin, long design will make it easy to clean those hard to reach areas in a car.", "Not that bad of a mini handheld vacuum, however, they sent me a used vacuum. It was dirty and the box was clearly opened before.", "I received my VacLife Handheld vacuum, used it immediately and it worked perfectly but….. When I attempted to charge the unit, the unit wouldn’t charge. I packed it up and was ready to ship it back.  I bought a warranty with my purchase so I contacted the company instead. The next morning I received an email with her apology, asked that I show proof of purchase and was IMMEDIATELY sent a replacement unit. I am 1000% satisfied with my handheld vacuum and the company. The vacuum itself is amazing with at least a half hour usage before needing a charge. You will not be sorry if you purchase a VacLife Handheld Vacuum.", "[[VIDEOID:8dfdb6a309c2fd7e115bf8f94ab9b623]] Bought this for my girlfriend to use in her car. After weeks of using, here is my pros and cons of this item:<br />Pros: Very easy to assemble and easy to use, you just need to follow the manual which is very straightforward.<br />Lightweight<br />Decently long battery life<br />Very easy to clean and maintain<br />Cons:<br />The suction power is a little weaker than the other model VL189 that I owned, so this vacuum is only good if you wanna clean the table or your car interior.<br />Note: Remember to charge the vacuum after3-4 months of usage, and also register the product on their website to get an extra 2 years warranty (which is very good in my opinion, they will send a new product if yours is broken)", "This vacuum works well for sucking up the loose lint after I clean my dryer lint trap.  My only complaint is that the exhaust vent, if vac is held at a certain angle, will blow the lint away. Worked well with the attachments to clean the track of my sliding glass door too. Sometimes I press the power button accidentally and it shuts off. Overall, a good deal when it was on sale with a coupon.", "I wanted a small vacuum to pick up hair in my bathroom and this fit the bill to a T! It has just enough power to suck up stray hairs that my wife sheds and is small enough that I can stick it in my bathroom and not worry about it. Only gripe I have is that you can't leave it plugged in but battery seems to be holding up for the week I've used it so far.", "I was surprised how well this vacuum picks up! The different speed settings help too! I do camera installations and used it to pick up drywall dust on carpet and hardwood floors...it worked flawlessly!", "I love the style, suction power and battery life.  A great little vacuum for a quick crumb and cat hair cleanup!", "Great Product. Works well . Quick vacuum when needed.", "My old hand held vacuum finally was done.<br />I looked and looked through all of the reviews and finally decided on this one.<br />WORKS AMAZING!!!!", "This vacuum is convenient and easy to use. The suction power is fine, given its size.", "Highly impressed! So much, I purchased two more and will be purchasing more to gift to others for the convenience, and power, of this sleek, and sexy little vacuum. If you're in limbo based on some of the reviews. My advice. Don't think twice. 😊", "Convenient mini handheld vaccum. Has great suction, picks up dust, crumbs, my long hair, etc.  The size of the vacuum is perfect for me to keep around the house. Doesn't take up too much space but does the job well. Especially for areas I can really reach to clean, such as the corner of my bed or the bottom of some furnitures. I even use it for the ceiling corner or areas that I see dust. I also like the indicator light, red when it is not fully charged, once it's done charging, it will show a blue light! Product is simple to use, putting it together and taking it apart for cleaning. I am unsure how well the battery life is. I do use it often but for a short period of time (10 mins or so). I would charge it once a week, so I never reach the low battery. No issues or complaints as of now, so 5 stars! Hope this helps :)", "I LOVE the thin cylindrical shape of this vacuum.  It lets you get in tight spaces where I normally could not with a handheld vacuum before.  It is super easy to clean, charge, empty, use, etc.  LOVE it.  The only feedback I have (and it is a personal preference) is to just have an on/off mode.  There is an additional high powered mode that is not even necessary as the normal one does just fine and you have to toggle past it by pushing the on/off button twice.  It would be better to push it once.", "Great vacuum, designed intuitively - user-friendly.  Two levels of suction.  Relatively quiet.  Easy to assemble and easy to take apart to clean. Washable filters.  What's not to like about this thing?!<br />Thank you for very well-designed product.<br />One suggestion: discard little plastic brush, or make a Velcro or hole slot in base so it attaches and is ready to use for occasional cleaning.", "Works great for a little vacuum. The suction is strong. Has three power levels.", "This vacuum is quite powerful and light, making it super easy to clean my car. The power really got me for such a small size. I have used several handheld vacuum before but this one is really impressive I have to say", "Perfect little vacuum for my small condo with hardwoods! I use daily to suck up loose hair and debris on my floors. Love it!", "This product is really amazing and i can refer my friends.  This is so handy and has a powerful suction that cover every corner of my home.  This comes with a small LED light but has clear visibility during the night.  I can use it on my car too and don't need to stretch much as the handle is more convenient for in-depth cleaning where my hands are not reachable. This stand helps me to place the vacuum anywhere I like and does not occupy much space.  And it comes with two settings which are cool for this price.  It's worth having it for every home!!!!", "Very nice little vacuum, but comes with a standard 110/120-volt wall plugin and a stand designed for a countertop. Nothing that adapts it to a vehicle.", "I love this vacuum.  It's so different from my last handheld, which was a traditional shape and size.  This one is black, thin (it's similar in size to a rolling pin), very sleek and has its own stand/recharger - which makes it look more like a piece of art than a utility.<br /><br />It has very powerful suction, both on the low and high settings.  It's easy to take apart and clean and obviously very portable.  I keep it in my car until it runs out of power, then bring it back home for a quick recharge.<br /><br />Overall, it is one of the best vacuums I've ever purchased, love it.", "I love this new vacuum, took me long to do this review because being disappointed many times with this type of vacuum after few weeks use. This one is the best I have for daily use due to my old cat hair all day long. The battery last good I don’t know exactly how many hours running because I use few minutes everyday and just charge every few days. This one is very practical for pet hair and small dust", "Great little handheld vacuum! Pretty good suction for a handheld. It is also rechargeable which is nice!", "I was looking for the strong suction compact vacuum since long time and after reading all reviews thought to give it a try. I am so glad I bought it. Its very handy for all the small cleaning up jobs.", "This is the perfect vacuum for my needs - both for car and entry rugs!  Works great!", "I got this vacuum intending to use it mainly for my car but the length of it allows me to reach places in my house that I typically do not clean. It's very helpful! The slim design also allows me to get into small places to clean and pick up things I couldn't before with me main vacuum. I really like it so far, wish the battery life was longer so I didn't need to charge but for what it is, I can leave it charging to clean the next day. It's really portable and will suck up anything in it's path.", "This vacuum is very light weight and easy to use in narrow space and hard to reach corner.", "OMG! What a surprise! So when I opened up the box and I was shocked at how small it was - But this little thing packs a punch. I used it 10x already this morning( I have 2 little ones + a whole lot of crumbs). Small and powerful - the perfect fit in my family room.  This a must for hand held vacuum. What more can you ask for???? You won't regret this purchase.", "Needed to give my car a good vacuum and this did the trick!", "Awesome little vacuum, does everything you need it to do for much cheaper than the Sharks and Dysons of the world. Incredibly light, sleek and practical. The suction is strong, the look is elegant and the overall vacuum is great! Definitely would suggest this for all your vacuuming needs. I have a dog and it sucks up the hair with ease and I’m incredibly happy with the performance", "Good mini vacuum! I like that is has its own charging holder. It has two suction settings. The only thing I would change is where the power button is. My finger accidentally hits it when I am vacuuming. It also comes with two filters which is nice!", "I have tried a few different handheld vacuums to use for little clean ups in the kitchen and to clean my car, and this one is my favorite. It has a nice modern design that is small to fit in tight spaces. It has a convenient charging station included that is really convenient. It holds a charge for plenty of time to vacuum out my car or use for kitchen clean up throughout the week. Great vacuum and great price!", "So far so good. Well made. Easy to put together and easy to empty. I like the hepafilter. The suction is pretty good considering the size of the vacuum. I should have bought one sooner.", "Great vacuum", "I like how small this vacuum is. Perfect for my car, smaller enough to keep it in my trunk but has enough power to clean.<br />Also perfect for light vacuuming around the house when you don’t feel like dragging out your huge vacuum.", "Vaclife is Exactly what I’ve been looking for in a portable vacuum. It’s easy to put together out of the box. The suction power is super impressive and more than I anticipated. Besides the suction power, the ease of cleaning the Vaclife is unbelievable! I know that this product will last so much longer just because I will do the upkeep on it. It’s too easy not to do it. Definitely a must in your car and light household cleaning!!", "[[VIDEOID:7b629115ed878d693ae41467d19d6536]] This is the best little vacuum I have ever owned. It gets into the smallest crevices and has two power levels to get every little crumb. It is lite weight and easy to use. Battery lasts a long time. I would recommend it highly if you are looking for a small, light weight vacuum that has a lot of power. Love this little vacuum!", "I purchased this vacuum solely for my car. It did a good job with the charge lasting all the way around the car, cleaning the back and front floorboards. However, the suction, even on the highest setting, was quite poor. I found myself going over the same grass clipping at least 3 times.", "[[VIDEOID:2d4de6628f1e7b45d96753b25ea44647]] Love my handheld vacuum . Has a luxurious design with awesome suction power.it has a light weight and it comes with an extra filter.Charges fast and the battery lasts. Satisfied !", "Bought this handheld vacuum to clean my portable air conditioner and it's doing a good job so far. Decent weight and very easy to clean", "This portable vacuum is amazing!! I was really impressed when I opened up the box because it was so small. The vacuum is very sturdy and well worth the money. I have used it to vacuum my couch cushions, baseboards and under the beds. The suction is good for its size. Another thing I love about this vacuum is the recharging station. It sits nicely in a corner of my dining room ready to go for any spills. It’s super easy to clean too, just open the hatch and dump into the trash!!", "I bought this to do light cleaning after I go to the beach or have my dog in the car in between getting my car cleaned. The suction is a lot better than I was expecting it to be but not as great as one I had previously. This does what I need it to do though and I really like the look of it. Worth the purchase.<br /><br />Update 8/8/21: I have used this several times now since having it for about a month and it dies so quickly. I charge it, I go to use it and the red light comes on immediately and it turns off. Not sure why I’m having this issue, maybe a defect? I know it’s not a $100 vacuum but I wasn’t expecting it to die so quickly and not hold a charge. I gave it four stars originally but now I give it 2.", "Comes in a very intuitive, easy to use package.  Decent instructions and the vacuum has surprisingly strong suction.  Very handy to use in kitchen, on cat, or upholstery.  Very versatile package.  Very pleased.", "This is a very small and efficient handy dandy little vacuum. I bought it to use specifically for my minivan. The suctioning power seems decent enough to pick up scraps of dirt and yet small enough to fit easily in the trunk. It even comes with a free filter.", "I bought this vacuum to catch dust bunnies and clumps of pet hair.  It works great for that.  It makes it easy to keep up with the random little dust piles, dead bugs, etc when you don't want to bother with a broom or a larger vacuum.", "I absolutely love this little vacuum!! It is exactly what we need around the house with a baby that finds any little thing to put in her mouth! Instead of lugging the entire vacuum out for little messes this is perfect! It has great suction and has 2 speeds for extra suction. I use it for everything in my home, and also plan to use for our car as well since there is no way to vacuum our car any other way this portable vacuum is what we needed! I was so skeptical and took forever looking for vacuums and their reviews. Any bad review on here is a lie!! Seriously buy this vacuum it’s worth the money and works great!! #vaclife 🤣", "I already have one handheld vacuum but bought this one as it is cozy and light weight and don’t want to use my home vacuum in car. Overall solid build. Its not very powerful but it does it work. Because of its design it is very useful to vacuum edge and corner where regular size vacuum can’t reach. It has three level of filter to protect the motor which I like most.", "I bought this vacuum because I love to clean and it would really be useful for the dorms. This vacuum has good suction, great battery life, and you can literally bring it everywhere. It's easy to use and I love that it is easy to clean. I am satisfied with my purchase.", "My 95 year old mother with asthma sucks better than this vacuum.", "This vacuum was smaller than I pictured but it works better than I imagined! The only down side is it needs emptied frequently due to its size.", "Very neat portable cordless handheld vacuum! The design is very sleek and sits on a vertical stand when charging. There are indicator lights on the vacuum that will tell you when it is charging/fully charged. This ultra lightweight vacuum makes cleaning the stairs very easy - which is exactly what I was looking for! I no longer need to haul the main vacuum up and down the stairs anymore.<br /><br />The vacuum comes with two extra attachments for different needs/surfaces and a spare filter. Overall, I am very pleased with my purchase!", "I really love this little vacuum. It is super hardly. The battery goes fast, but still works for us.", "We wanted a handheld vacuum that had decent suction for quick and small jobs, but did not want to spend over $100 on something like the Shark. This vacuum exceeded our expectations with two adequate suction power levels. The customer service is exceptional as they sent us a replacement handhelf vacuum within days after the end piece broke while vacuuming. I highly recommend for the money.", "Great little vacuum! Two levels of suction and the second level seems pretty strong.  Delivered in one day!", "The vacuum has great suction power for its small size. The charging dock works well and holds the vacuum upright for storing. The attachments make it particularly great for use in the car and getting crumbs out of crevices!! I currently just leave it in the car and bring it in for charging.", "Great powerful vacuum for small area in the car and corners", "Love this vacuum! I’ve been wanting a powerful vacuum for my car, stairs, kitchen, etc! This definitely exceeded my expectation! A definite must have!", "It is perfect if you don't want to have this huge vacuum lying around the house! It is nice and sleek and pretty good suction!", "I love this vacuum, it is super sleek and easy to use, doesn’t take up much space.", "Easy to carry and use. Powerful motor with excellent suction. I highly recommend this vacuum.", "[[VIDEOID:a4b5c9538249c94bb4dd181e6a62ded4]] its very good looking feels expensive.<br />it does have some suction as you can see on the video and the battery holds good so far like 20 mins use and still have power.  those adapter extensions are very handy for my car in between the seats thats the main reason i got this vacuum, the only thin os the filters i dont know yet where i can get more ,  and they do keep the dust in the vacuum very good one. it charge fast and its a nice led on the power button red and green lets you know when fully charged.", "The vacuum looks good and is thinner than I thought it would be.  Suction is a bit disappointing, and it's not exactly quiet, but it gets the job done.  Easily cleaned out the inside of my 4-door sedan car with the vac on its highest setting before it ran out of battery.  This is definitely meant to be a quick cleaner for minor messes, so don't buy it thinking you can use it to clean your whole room.  Does what it says, so anyone complaining particularly hard about it probably just doesn't want to admit they overlooked info in the description.", "This is a great vacuum to have for your car! The sizing is perfect to keep in the car since it’s not too bulky of a product. It has 2 different suction power settings, you just press the power button twice. Suction is decent and since it has small storage for what ever you sucked up with it, I only recommend this product for people who don’t need to clean a big mess or have to use it for longer than 25 mins since it does get hot.", "I bought this vacuum for a mattress that we have, and it did a wonderful job. The suction is amazing.", "I got this vacuum to clean my guinea pigs’ cage, and it is amazing! No more achy back from slouching over their cage with a broom and dustpan daily. It is definitely a game changer and has made their cage so easy to clean. The suction power is perfect for sucking up the droppings and hay. It’s is super easy to empty the vacuum. It doesn’t clog from the hay!! I would definitely recommend.", "This is a great little vacuum. Fast charging. It has great suction for a little machine. Easy to empty. Love this vacuum!", "Great little vacuum. Took a couple hours to charge it, and started cleaning my car. Perfect to clean under the seats in those hard to reach crevices", "This vacuum is great! Very sleek and compact. It has great suction power and battery life as well. Glad we bought it!", "Amazing little mini vacuum the suction is much stronger then I anticipated and it’s small and stored easily. Nice slick design that isn’t to bulky. Easy I use even my kids can operate it", "This handheld vacuum has great suction power. It isn’t noisy. Gets the job done fast and it’s easy to recharge. The size is perfect. Perfect for those small areas hard to reach or for people living in small places with not much storage.", "This little vacuum is powerful and just looks cool. Bought it for the car and works perfectly! Couldn’t be more pleased.", "Great vacuum , small , compact but soo much suction, great fir the couch, the car, kitchen counter, small spaces", "This vacuum is really helpful and very easy to use. It comes with multiple options to put in the front which help you clean what you want easily. It also has two different suctions. The charger is very good and the battery has long time to empty. It’s really good to stay your car cleaned! Highly recommend it.", "Over the years I have purchased several handheld vacs and I am very happy with this VacLife handheld vacuum.  It is: 1) Powerful - it picks up even hard to suction particles that are embedded in carpet and it's great for quick clean ups and to use to clean your car.  2) Great to Use - because of it's slim design I can get into spaces that other handheld vacs cannot enter or reach. 3) Sleek - the design is attractive. It is not a bulky eyesore on your counter top.  I recommend this vac to anyone who is looking to purchase a handheld vac.", "The vacuum is great! I use it to clean my car and the carpet of the living room. Great product.", "Works really really good, especially for the price, as a truck driver I was looking for something small and powerful and this vacuum works awesome and fits anywhere", "Would highly recommend this vacuum due to its light weight nature and ease of use. It is particularly fantastic for small spaces and corners. My 3 year niece really enjoys using it too after she eats and she can actually maneuver it quite well as it is very light in weight. It also is durable and has good suctioning power so far. Really appreciate that they give two dust cups in the original package. Would definitely recommend this product", "The vacuum is so light weight and has great suction power. We primarily use this for Car cleaning. my wife loves this product and has extended battery life that we have seen other brand product.", "I’ve tried a lot of hand held vacuums and this one does everything I need. The suction is great on my carpeted stairs, and hard to reach places - it’s light weight, and it’s quiet (not loud like most).  This vacuum worked right out of the box without charging. I’m very happy with my purchase and I could tell this one is a keeper!", "I was surprised by the strong suction power this had! It’s the perfect vacuum for your car or getting into small tight spaces. I recommend!", "I'm impressed with the suction power, is a little vacuum but work very well. It's sleek and powerful. I love it.", "Strong little vacuum from a reputable company. Super convenient.", "Perfect little size hand held vac. We have a very nice large vacuum but wanted something simple and small for lighter tasks. This vaclife mod was perfect. Very good looking and the size is so conveniently small. Works for what we needed it for", "This is a great little vacuum for small clean ups. I purchased this to clean the sand out of my car floor after beach outings and it works absolutely perfect.", "This vacuum is awesome I love it already bout a vaccum off amazon before n the suction sucked but this one is awesome", "I needed a small vacuum to pick up the mess of three little boys when the big vacuum wasn't needed.  This works great for cleaning up crumbs, dirt, etc... far better than the previous handheld vacuum I bought that barely picked up anything.  It's also cool looking and has two speeds, which is handy.  Just what we needed.", "[[VIDEOID:2b07e3d1c7a335f4598be8cd6227d88d]] Suction power, battery life, easy to clean! This vacuum sucks, I mean it REALLY SUCKS! Thank you VacLife for putting your vacuum into my hand. It has really turned my whole world upside down!", "bought the vacuum when it was on sale because we really needed a handheld & it's actually better than i had thought it would be. use the attachments because it'll make the suction better. pleasantly surprised by this thing. it's pretty easy to clean too. only thing is you have to clean it after every use as it's compact.", "This handy cordless vacuum is easy to use and clean, even it has great suction power and easy to use in car, sofa, stairs and even in the kitchen floors.", "creative design, very simple installation,  and looks elegant!<br />the suction power is impressive, just like pictures show that the car trunk was easily cleaned.<br />light portable vacuum for travel or for students' use.", "Perfect sized hand held vacuum to clean my car with. Has a more powerful suction compared to the other big brands.", "Very impressed with this vacuum! I was able to clean my car in less than 5 mins! Definitely found a winner and I’m going to get another one for my sister. So much easier than having to use a household vacuum.", "It’s a small vacuum nothing fancy but it does get the job done for a quick vacuum. I am still upset at the fact the charger does not work 😩 A lot of reviews state the charger doesn’t work.<br />It’s bought by a third party company so if you see the discount drop to $20 instead of $40 i’m sure it’s bc of the charger<br />Returning it.", "I bought this handheld vacuum to vacuum my car. Hiking brings a lot of dirt into the car. This vacuum was amazing! It had a lot of power and was able to suction up the dirt in my car. It was also very easy to clean. I am very pleased with this product!", "Absolutely love the vaccum. Perfect size of a handheld vacuum. Easy to clean and strong suction", "Awesome small vacuum. Light weight with good suction power for the size. Great for detailing my car. Good battery life and super convenient. Love the attachments.", "This is a perfect vacuum for small jobs. Powerful suction. Its a bit heavy for the size but nothing that cannot be handled. The stand is very convenient to store the attachments and change the vacuum. Using it for small cleanups (not wet) in the bathroom.", "I bought the vacuum a few months ago and have been able to use it in a few areas. Though it doesn't do a perfect job, it does very well in most places I use it. The battery has been no problem for me, it has a solid holder, and is easy to clean out once done using. I appreciate having a backup filter on hand as well. I have used it in tight areas such as the car but also in some projects disassembling/cleaning electronics. The first speed is good for those detail projects and the second speed is good for car cleaning I have found. All in all, it's been able to do just what I needed!", "The vacuum that showed in my order was not the item actually purchased. There was a generic hand vac shown in the order. It all turned out ok, and the item came with both the everyday filter and the hepa version. Nice extension tip that appears to have good suction. Overall, for the $$ it was a good value. Should  be good for the car.", "Hand help cordless vacuum that sucks. It fills the need that it was purchased for without problems!", "[[VIDEOID:26ac7d4e17a044f8a6f50ce633aea7e7]] I got this for my car and absolutely love this thing. It is so light weight and easy to use. The vacuum is very strong, it has two different power settings depending on how dirty your car is. I love that it has a filter which can be replaced if it gets to dirty. It's easy to clean the tubes, I can take off all of the parts to really clean it and they can be washed except for the filter. It also comes with an extra filter for replacement. It doesn't take to much space because of its slim design, and it fits right next to my car seat which is awesome. I love the cool design, it looks so much like a light saber. It comes with a stand which automatically charge the vacuum once it is placed. The stand also has a place to store the tips for the vacuum cleaner. The battery last pretty long, I've been using it for a week and it still hasn't run out any power. It comes with a 2 year warranty which is good considering the price you pay for. Definitely recommend for a car vacuum cleaner that doesn't take too much space and can be easily stored anywhere in the car.", "Only got it for a week but the vacuum is way smaller than I expected. It is definitely powerful for its size. I like keeping it in the car and be able to vacuum when needed."], "reference": [42, 28, 18, 16, 4, 3, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.20000000298023224, 0.10000000149011612, 0.699999988079071, 0.834374999627471, 0.30000001192092896, 0.4000000059604645, 0.17916666933645806, 0.5, 0.45000000670552254, 0.4388888969120604, 0.5, 0.5, 0.4000000059604645, 0.5, 0.0625, 0.19687500782310963, 0.2625000011175871, 0.8999999761581421, 0.4000000059604645, 0.10000000149011612, 0.7296296297400087, 0.30000001192092896, -0.30000001192092896, 0.20000000298023224, 0.699999988079071, 0.699999988079071, 0.4000000059604645, 0.5, 0.8999999761581421, 0.5, 0.6000000238418579, 0.28749999962747097, 0.8999999761581421, 0.4000000059604645, 0.7124999910593033, 0.8999999761581421, 0.4000000059604645, 0.4000000059604645, 0.8999999761581421, 0.6000000238418579, 0.8999999761581421, 0.20000000298023224, 0.699999988079071, 0.4375, 0.800000011920929, 0.5, 0.6000000238418579, 0.8749999776482582, 0.8999999761581421, 0.8999999761581421, 0.4000000059604645, 0.8999999761581421, 0.7124999910593033, 0.699999988079071, 0.8999999761581421, 0.30000001192092896, 0.8999999761581421, 0.5, 0.8999999761581421, 0.10000000149011612, 0.800000011920929, 0.4000000059604645, 0.3500000052154064, 0.6375000015832484, 0.4000000059604645, 0.7500000111758709, 0.10000000149011612, 0.699999988079071, 0.2792000041604042, 0.8999999761581421, 0.20000000298023224, 0.8999999761581421, 0.5125000029802322, 0.699999988079071, 0.6375000178813934, 0.6000000238418579, 0.8999999761581421, 0.8999999761581421, 0.48750000074505806, 0.4000000059604645, 0.800000011920929, 0.6000000238418579, 0.6749999895691872, 0.8874999806284904, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.800000011920929, 0.800000011920929, 0.800000011920929, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.800000011920929, 0.8999999761581421, 0.800000011920929, 0.699999988079071, 0.699999988079071, 0.800000011920929, 0.6000000238418579, 0.5, 0.800000011920929, 0.699999988079071, 0.18888888811623608, 0.5624999888241291, 0.800000011920929, 0.800000011920929, 0.6000000238418579, 0.6000000238418579, 0.8999999761581421, 0.4000000059604645, 0.5, 0.699999988079071, 0.8999999761581421, 0.45000000670552254, 0.5, -0.10000000149011612, -0.20000000298023224, -0.012500000186264515, -0.10000000149011612]}