{"reviews": ["If you intend to vacuum up the little spider webs in corners and crevices, this is not a good choice at all.  The suction is not strong enough and every little thing gets stuck in the bristles.  I've tried using it with each of the 3 attachments and these webs get caught on the inlet every time.  This vacuum is only good for very small/light weight debris, as illustrated in other reviews with videos.  We bought this to avoid having to break out the canister vacuum for quick jobs.  If you don't want to physically handle and remove each piece from the collection canister, then use another machine with a bag collector.  I personally don't like picking out each little bug or nastiness that I suck into this machine.  I read all the positive reviews and was a little suspicious because they were all made within a couple weeks of each other.  The reviews truly seemed too good to be true and I was right.  Since I through away the box, I probably can't return the item, but at least it was only 50 bucks.  That might be a real concern for someone else, so make sure to keep the original packaging.  One last note:  The battery may be \"fast charging\", but it still takes a long time.  I hope this helps someone and I rarely leave negative reviews unless it's important.", "I love this hand vacuum! I’ve had countless 5-star rated hand vacs and they don’t hold a candle to this one. Fantastic suction power on carpets, stairs, in the cars and it gets all the mess up from our 2 toddlers on their endless daily mess. Every other cordless hand vac I’ve tried had weaker suction and shorter battery run but this can even pick up the random M&Ms and popcorn my kids seem to leave everywhere. It’s slim design is also perfect for getting in small nooks and crannies, like around radiators and along baseboards behind furniture. And it’s super lightweight so it doesn’t kill my back to do the stairs with it.", "I used it for some crumbs for about 5 minutes.  Then smelled electrical smell, then it stopped working.  Before that, I will say the suction wasn't that great and the on/off switch is in a place on the handle that you keep pressing while in use, turning it off and on.  UGH", "Purchased this vacuum for my car after reading lots of reviews tried it. The battery is short and the suction is not strong. Followed instructions. The charger has been on red meaning charging for over 4 hours and still hasn’t said fully charged.", "Less suction than expected. Smaller dirt cup than expected. I guess I don't find the \"wand\" style suits my needs. Sent it back.", "The suction is very weak, even on the highest setting. The product itself is smaller than it appeared as advertised. It's very difficult to clean and doesn't hold much dust, dirt, etc. It's not worth the price. I could have gotten one at Walmart for half the price and better functionality.", "Awful suction", "See photos for before and after. Easy to use with great suction. Click once for low suction and twice for high suction. Sleek, light weight design and fits in hard to reach places. Charges wirelessly in charging cradle. I use it primarily in my car. Very happy with my purchase!", "I purchased this vacuum solely for my car. It did a good job with the charge lasting all the way around the car, cleaning the back and front floorboards. However, the suction, even on the highest setting, was quite poor. I found myself going over the same grass clipping at least 3 times.", "If you have multiple kids (like me) that likes to make mess then this ain't it! The suction is very weak. I'll still have to go pay to vacuum the car out. I would not recommend.", "This vacuum has no suction to it", "The company offers you $30 dollars back if you give this product a 5 star review. It is not worth even a one star review for the price you pay. It has very poor suction and the battery does not last long. It doesn't have attachments that work well in your car. Don't waste your money.", "Not worth keeping..no suction", "I loved the looks of this hand-held vac abd was really excited about using it.  I’d use it for 5 minutes, and suction power was less than I expected, and then needed to be charged. It quit being able to charge altogether and was unusable about three weeks after I bought it.<br />I called customer service and they sent me another hand vac.  This unit was not better than the first.  This one must be charged after every use and has barely suction.  It quit being able to charge today:<br /><br />Do yourself a favor and DO NOT buy this product!"], "reference": [42, 20, 3, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0], "score": [-0.30000001192092896, -0.10000000149011612, -0.20000000298023224, -0.6000000238418579, -0.30000001192092896, -0.4000000059604645, -0.10000000149011612, -0.014814816415309906, -0.6000000238418579, -0.4000000059604645, -0.10000000149011612, -0.5, -0.800000011920929, -0.20000000298023224]}