{"reviews": ["Bought this car vacuum through a vendor promo and super happy with the purchase! Its so sleek and has great suction. No complaints!<br /><br />Update: Unfortunately the vacuum is not holding its charge. I charged for 3 hours and it worked for less than 1 minute. So then I charged overnight and it cut off 5 minutes inti vacuuming my car. Still great suction just bad with holding the charge. I am going to request a replacement with Amazon in hopes this particular vac is just defective.<br /><br />Update 2: Replacement received and its a winner! After charging it, I tested it throughout the day to see if the charge held up and it did. Also noticed the charger pieces fit together better than the origin vac, confirming the original was just defective.", "I love this hand vacuum! I’ve had countless 5-star rated hand vacs and they don’t hold a candle to this one. Fantastic suction power on carpets, stairs, in the cars and it gets all the mess up from our 2 toddlers on their endless daily mess. Every other cordless hand vac I’ve tried had weaker suction and shorter battery run but this can even pick up the random M&Ms and popcorn my kids seem to leave everywhere. It’s slim design is also perfect for getting in small nooks and crannies, like around radiators and along baseboards behind furniture. And it’s super lightweight so it doesn’t kill my back to do the stairs with it.", "Worth every penny I spent. Not only does it come in a convenient size, but it also has powerful suction and handy attachments for different surfaces. The usage time is about 45 minutes on a full charge which is pretty good compared to other cordless vacuum cleaners I've used in the past. It is lightweight, easy to handle, and does a great job of getting rid of dirt. I use it as a multi-purpose cleaner, both for my car and my room. At this price point, I don't think there are any other options as good as this.", "First of all, I was pleased to realize how small is this vacuum and yet so powerful. The suction is is very good even  at position number 1.  It is very lightweight which makes it very comfortable to use. I like the feature that both filters are washable so you do not need to buy any extra bags.<br />Nice addition to my full size vacuum when I need just to clean some spots. Overall, very good product. Highly recommended!", "I initially encountered some issues with this vacuum. It arrived with a broken filter, but I worked with the seller who was incredibly professional. I am a bit of a vacuum connoisseur having bought a number of cordless handheld vacuums over the years. In rating any product, it's important to remember the price. This is a less than $50 vacuum so I didn't go in expecting it to have incredible suction, and in my experience, you don't actually want gaudy suction because invariably the battery life will run out quickly. I have a Dibea cordless, handheld vacuum, which is excellent (and twice as expensive). It's an extremely powerful 1700PA at max-power (this one is. That's great, but it only lasts about ten minutes. The suction for this Vaclife is good, though on low-power it's not strong enough to suck up much of anything, so I only use it one full-power and the battery life lasts for about 15-16 minutes, but wanes in the final couple of minutes. The motor for this vacuum is AC. AC motors tend to be a bit louder and not quite as efficient or enduring as DC Brushless motors, which are a more recent invention and can be found in other cordless handheld vacuums, but they typically have higher price points. It takes approximate 3.5 HRs to charge this vacuum from empty (red) to full (green). Cleaning out these types of vacuums is always challenging since a lot of dust/particles get stuck to the paper filters, as opposed to getting trapped into the plastic collector cup. This means you have to actually pick the very debris you've vacuumed up out of the filter with your bear hands (I don't recommend using a brush or water, at least not often, as it will quickly degrade the paper filters, and you only get two of them and I've already contacted the seller about getting more filters and it seems as though it's not possible). It comes with two attachments, a crevice tool and an upholstery brush. The vacuum has a sleek design that will fit in with any decor and can be stored, along with the attachments, on a stand that charges it.", "[[VIDEOID:c5979a42f14a4dc28a21aaf187a02a0d]] This handheld vacuum is the BEST!!! It has two levels of suction that gets the mess cleaned all up in no time. I don't have to charge this vacuum often and when you're ready to clean your filter it's just so simple. I highly recommend this vacuum. I've been through two different other ones and this one by fair is my favorite.", "I purchased this vacuum for my home office. Sometimes I just want to vacuum a little bit to neaten out my work space without having to bust out the big vacuum. This little guy works perfectly for what I need it for. Ever since working from home became a thing, my office space was used a lot more. Obviously when you work at home you end up eating at home too so that included eating in my office. This vacuum has been very convenient because it's so compact and has enough suction to pick up all the little crumbs and dust around the office. It comes packed with everything you need, a charging stand, extra attachments, 2 dust filters and one even comes pre-installed. The unit I received had a battery charge so I was able to use it right away. I can't speak to exactly how long the total run time is or how long it takes to charge, but I purchased this with the understanding that this is a handheld vacuum designed for small jobs, if I need to do a deeper clean I'll have to bring out the bigger vacuum. If you need a stylish handheld vacuum that performs well, then you should give this vacuum a try.", "[[VIDEOID:a8dee4bd0779f449f47c19f828b398d]] Powerful and lightweight handheld vacuum that is compact enough to fit on a side table and it looks good too. It has great suction and the attachments are wonderful. It is easy to empty out too. Just had my 6 and 8 year old nieces over and they made a mess. They were both fighting over who would use the vacuum to clean up.", "This little vacuum only gave me a few good days. Vacuumed my car and suction was just okay. After a few days of owning it, it turns off after 5 seconds, with a full day of charging. You get what you pay for/lesson learned. The positive reviews fooled me.", "When purchasing this vaccuum, I ancitipated using for light jobs, and vaccuuming the interior of my car.  Upon charging it and using it, its much more powerful than anticipated, and given that suction power, can be used for a lot of other tasks.  It was very easy to assemble, and install in the charging base.  After a few hours it was charged (the light will change from red to blue when charged).  I only vaccuumed for around 20 minutes, but it provided strong suction the entire time, and still has charge remaining.  If you need a vaccuum with strong suction and relatively long battery life, this is a good choice.", "Easy-to-use..good battery life..suction does the job..", "Convenient mini handheld vaccum. Has great suction, picks up dust, crumbs, my long hair, etc.  The size of the vacuum is perfect for me to keep around the house. Doesn't take up too much space but does the job well. Especially for areas I can really reach to clean, such as the corner of my bed or the bottom of some furnitures. I even use it for the ceiling corner or areas that I see dust. I also like the indicator light, red when it is not fully charged, once it's done charging, it will show a blue light! Product is simple to use, putting it together and taking it apart for cleaning. I am unsure how well the battery life is. I do use it often but for a short period of time (10 mins or so). I would charge it once a week, so I never reach the low battery. No issues or complaints as of now, so 5 stars! Hope this helps :)", "Works great for a little vacuum. The suction is strong. Has three power levels.", "Great suction and small enough to get in tiny areas. Love that it’s cordless.", "[[VIDEOID:3782534f495b0e87c78bc580301e5a11]] I was excited this product to arrive in only two days. I tried it out on my 2 cars and it lasted. I like the suction and it really works well. I hope it last longer than my last one.", "This product is really amazing and i can refer my friends.  This is so handy and has a powerful suction that cover every corner of my home.  This comes with a small LED light but has clear visibility during the night.  I can use it on my car too and don't need to stretch much as the handle is more convenient for in-depth cleaning where my hands are not reachable. This stand helps me to place the vacuum anywhere I like and does not occupy much space.  And it comes with two settings which are cool for this price.  It's worth having it for every home!!!!", "Great suction for such a small device, glad I bought it for my RV.", "I love this vacuum.  It's so different from my last handheld, which was a traditional shape and size.  This one is black, thin (it's similar in size to a rolling pin), very sleek and has its own stand/recharger - which makes it look more like a piece of art than a utility.<br /><br />It has very powerful suction, both on the low and high settings.  It's easy to take apart and clean and obviously very portable.  I keep it in my car until it runs out of power, then bring it back home for a quick recharge.<br /><br />Overall, it is one of the best vacuums I've ever purchased, love it.", "Great little handheld vacuum! Pretty good suction for a handheld. It is also rechargeable which is nice!", "I was looking for the strong suction compact vacuum since long time and after reading all reviews thought to give it a try. I am so glad I bought it. Its very handy for all the small cleaning up jobs.", "- I like that it’s small enough to not be an eye sore (easy to store away)<br />- Low and high suction for carpet or hardwood floors<br />- Great for cleaning my car, car seats, & sofa<br />- I like that you can rinse the filter with water and re use it", "The vacuum that showed in my order was not the item actually purchased. There was a generic hand vac shown in the order. It all turned out ok, and the item came with both the everyday filter and the hepa version. Nice extension tip that appears to have good suction. Overall, for the $$ it was a good value. Should  be good for the car.", "Received this item as a promotion; This item is very sleek looking and shows off well as stand alone item; no need to hide it in corners; the suction is not as strong as you would expect from a dyson vac; but no complaints.", "Awesome little vacuum, does everything you need it to do for much cheaper than the Sharks and Dysons of the world. Incredibly light, sleek and practical. The suction is strong, the look is elegant and the overall vacuum is great! Definitely would suggest this for all your vacuuming needs. I have a dog and it sucks up the hair with ease and I’m incredibly happy with the performance", "Great lil vacuum, great suction and a spare filter, very easy to use, very handy tool.", "I checked sealed suction on the Vaclife and it measured 24 inches of lift at sealed orifice, this is excellent for a handvac.  The dust bin is easy to empty and the filters are accessible and easy to clean.  I got 25 minutes of run time on the lithium battery (high speed) and the cleaner is handsome setting on it's cradle on the kitchen counter.  Would buy again!", "So far so good. Well made. Easy to put together and easy to empty. I like the hepafilter. The suction is pretty good considering the size of the vacuum. I should have bought one sooner.", "Finally! This is a great little vac with excellent suction, decent battery life and is easy to empty!! Great for hard to reach spaces and very cool design!", "I bough this for picking up loose cat hair & dust on corners where my big vacuum cleaner cannot go.It hardly picks dust,the suction is low.The only thing good about this is the fan that keeps blowing in my face.hardly picks dust from blinds forget about picking cat hair from carpet :(& now I realize it’s not refundable!", "Lightweight, great suction. Held its charge for a long time.", "Convenient, small and great suction! Love having this little guy for my brand new car!", "This portable vacuum is amazing!! I was really impressed when I opened up the box because it was so small. The vacuum is very sturdy and well worth the money. I have used it to vacuum my couch cushions, baseboards and under the beds. The suction is good for its size. Another thing I love about this vacuum is the recharging station. It sits nicely in a corner of my dining room ready to go for any spills. It’s super easy to clean too, just open the hatch and dump into the trash!!", "Good suction.", "I bought this to do light cleaning after I go to the beach or have my dog in the car in between getting my car cleaned. The suction is a lot better than I was expecting it to be but not as great as one I had previously. This does what I need it to do though and I really like the look of it. Worth the purchase.<br /><br />Update 8/8/21: I have used this several times now since having it for about a month and it dies so quickly. I charge it, I go to use it and the red light comes on immediately and it turns off. Not sure why I’m having this issue, maybe a defect? I know it’s not a $100 vacuum but I wasn’t expecting it to die so quickly and not hold a charge. I gave it four stars originally but now I give it 2.", "Comes in a very intuitive, easy to use package.  Decent instructions and the vacuum has surprisingly strong suction.  Very handy to use in kitchen, on cat, or upholstery.  Very versatile package.  Very pleased.", "Even though the suction is good not good enough to pick up items/debris without positioning a certain way. Do not care for and not really used. I cannot comment on battery life - ordered another.", "I absolutely love this little vacuum!! It is exactly what we need around the house with a baby that finds any little thing to put in her mouth! Instead of lugging the entire vacuum out for little messes this is perfect! It has great suction and has 2 speeds for extra suction. I use it for everything in my home, and also plan to use for our car as well since there is no way to vacuum our car any other way this portable vacuum is what we needed! I was so skeptical and took forever looking for vacuums and their reviews. Any bad review on here is a lie!! Seriously buy this vacuum it’s worth the money and works great!! #vaclife 🤣", "What a way to have this at such a compactable size yet so powerful. The suction is really great and the cleaning was so easy to do. This product have really reduced the efforts and have really worked well beyond my expectations.<br /><br />A must buy product..", "I bought this vacuum because I love to clean and it would really be useful for the dorms. This vacuum has good suction, great battery life, and you can literally bring it everywhere. It's easy to use and I love that it is easy to clean. I am satisfied with my purchase.", "My old hand vacuum's battery life is almost over, so I looked for another affordable hand vacuum, and I found IT! Really nice slim design, not as heavy as the older model but still strong suction, and easy to recharge with a charging stand. Everything is upgraded from my old traditional hand vacuum. I am very satisfied with it and I recommend this to others.", "Had to go over crumbs and cereal pieces several times to suck them up. Size is great, just wish suction was 10x stronger.", "I have two portable vacuum cleaners, one of them being the VacLife. This one has very strong suction and it is very manageable (in terms of weight and overall portability). Very pleased with the purchase.", "We wanted a handheld vacuum that had decent suction for quick and small jobs, but did not want to spend over $100 on something like the Shark. This vacuum exceeded our expectations with two adequate suction power levels. The customer service is exceptional as they sent us a replacement handhelf vacuum within days after the end piece broke while vacuuming. I highly recommend for the money.", "Great little vacuum! Two levels of suction and the second level seems pretty strong.  Delivered in one day!", "I love this little hand handle vac. Its great two washable filters great suction. Sucks up cat litter like a champ. Its also appealing to the eye.", "It is perfect if you don't want to have this huge vacuum lying around the house! It is nice and sleek and pretty good suction!", "I have a fullsize vac this VacLife is quick and easy the suction is on point. I bought it for my messy animals that track litter and food everywhere so I don't have pull out the big boy.", "Easy to carry and use. Powerful motor with excellent suction. I highly recommend this vacuum.", "[[VIDEOID:a4b5c9538249c94bb4dd181e6a62ded4]] its very good looking feels expensive.<br />it does have some suction as you can see on the video and the battery holds good so far like 20 mins use and still have power.  those adapter extensions are very handy for my car in between the seats thats the main reason i got this vacuum, the only thin os the filters i dont know yet where i can get more ,  and they do keep the dust in the vacuum very good one. it charge fast and its a nice led on the power button red and green lets you know when fully charged.", "This is very compact to store inside the car. It looks so good with powerful suction in it.<br />Easy to clean and better battery life. I like this product very much.", "No power weak suction", "I bought this vacuum for a mattress that we have, and it did a wonderful job. The suction is amazing.", "This is a great little vacuum. Fast charging. It has great suction for a little machine. Easy to empty. Love this vacuum!", "I live this vaccum. Very well made. The suction is strong and picks up dust and crumps very well. Just a swipe forward and backwards and you're all clean.", "Amazing little mini vacuum the suction is much stronger then I anticipated and it’s small and stored easily. Nice slick design that isn’t to bulky. Easy I use even my kids can operate it", "Great vacuum , small , compact but soo much suction, great fir the couch, the car, kitchen counter, small spaces", "OMG....... I am once again blown away by a superior Vac Life product. It's light weight but still has Powerful suction. The battery life is very impressive. You can finsih most jobs without having to recharge the battery. The charging station is a convenient counter top cradle that is so easy to use. Like all vac life products I have tried, it is sturdy, well built and very attractive. Thank you again vac life..........", "I’ve tried a lot of hand held vacuums and this one does everything I need. The suction is great on my carpeted stairs, and hard to reach places - it’s light weight, and it’s quiet (not loud like most).  This vacuum worked right out of the box without charging. I’m very happy with my purchase and I could tell this one is a keeper!", "Very small and lightweight but really good suction I was very impressed", "Initially, this seemed to have good suction but that has waned.. plus you have to hold the unit at just the right angle to create a suction that tends to be uncomfortable for holding. Also, the on/off switch is positioned right where you hold the unit so it's continually turning off or decelerating or accelerating.  I would definitely return it if I could.", "Things I really like are that it is compact rather than bulky and therefore fits into smaller spaces than other hand held vacs. It has 2 speeds, for better suction. The crevice tool is longer and fits into smaller spaces, making it ideal for quick pick ups in the car.", "This vacuum is awesome I love it already bout a vaccum off amazon before n the suction sucked but this one is awesome", "bought the vacuum when it was on sale because we really needed a handheld & it's actually better than i had thought it would be. use the attachments because it'll make the suction better. pleasantly surprised by this thing. it's pretty easy to clean too. only thing is you have to clean it after every use as it's compact.", "I waited a couple of months before providing my review!  I’ve had this hand vac for 6 months and it’s unbelievable!  The battery stays charged for days!  The suction is awesome providing 2 speeds!  Very quick clean up!  Very small and doesn’t take up much space! Love Love Love this Hand Vac!", "Perfect sized hand held vacuum to clean my car with. Has a more powerful suction compared to the other big brands.", "This hand vacuum is compact, easy to maneuver, and has great suction. I use this hand vacuum to clean my jeep, it gets under the seats better than a standard hand vacuum. It charges quickly and the battery lasts for a long time. The collection chamber seems small, but it collects a lot.", "Absolutely love the vaccum. Perfect size of a handheld vacuum. Easy to clean and strong suction", "[[VIDEOID:9961bef9a9d39eb164fd78541e4066bb]] I love the sleekness! Super easy to attach and handle!  The suction on this baby is awesome! Vacuumed my whole truck and yes I needed to charge it after which isn't much of a big deal to me being that it did the job! Let's say it performed better than some other vacuums a waisted my money on! Oh & I was litte confused about how to place charger but I figured it out In Under 5 min lol", "This is a perfect vacuum for small jobs. Powerful suction. Its a bit heavy for the size but nothing that cannot be handled. The stand is very convenient to store the attachments and change the vacuum. Using it for small cleanups (not wet) in the bathroom.", "I love this thing. At first I was like this suction is not strong enough but then as I used it for hard to reach spots underneath my bed and in corners I was became a fan of this product. Great so far.", "See photos for before and after. Easy to use with great suction. Click once for low suction and twice for high suction. Sleek, light weight design and fits in hard to reach places. Charges wirelessly in charging cradle. I use it primarily in my car. Very happy with my purchase!"], "reference": [41, 20, 18, 3, 2, 2, 2, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.11249999701976776, -0.10000000149011612, 0.800000011920929, 0.699999988079071, 0.09629629773122293, 0.5, 0.699999988079071, 0.8999999761581421, 0.5, 0.30000001192092896, 0.8999999761581421, 0.30000001192092896, 0.800000011920929, 0.800000011920929, 0.8999999761581421, 0.699999988079071, 0.699999988079071, 0.30000001192092896, 0.699999988079071, 0.10000000149011612, 0.699999988079071, 0.800000011920929, 0.5, 0.800000011920929, 0.8999999761581421, 0.20000000298023224, 0.4000000059604645, 0.8999999761581421, 0.10000000149011612, 0.800000011920929, 0.8999999761581421, 0.4000000059604645, 0.8999999761581421, 0.6000000238418579, 0.699999988079071, 0.10000000149011612, 0.4000000059604645, 0.8999999761581421, 0.800000011920929, 0.699999988079071, 0.5, 0.5, 0.20000000298023224, 0.20000000298023224, 0.699999988079071, 0.800000011920929, 0.5, 0.8999999761581421, 0.5, 0.699999988079071, 0.6000000238418579, 0.8999999761581421, 0.4000000059604645, 0.6000000238418579, 0.8999999761581421, 0.699999988079071, 0.4000000059604645, 0.5, 0.699999988079071, 0.11250000167638063, 0.4000000059604645, 0.800000011920929, 0.10000000149011612, 0.800000011920929, 0.4000000059604645, 0.8999999761581421, 0.8999999761581421, 0.800000011920929, 0.800000011920929, 0.20000000298023224, -0.014814816415309906]}