{"reviews": ["I purchased this vacuum for my home office. Sometimes I just want to vacuum a little bit to neaten out my work space without having to bust out the big vacuum. This little guy works perfectly for what I need it for. Ever since working from home became a thing, my office space was used a lot more. Obviously when you work at home you end up eating at home too so that included eating in my office. This vacuum has been very convenient because it's so compact and has enough suction to pick up all the little crumbs and dust around the office. It comes packed with everything you need, a charging stand, extra attachments, 2 dust filters and one even comes pre-installed. The unit I received had a battery charge so I was able to use it right away. I can't speak to exactly how long the total run time is or how long it takes to charge, but I purchased this with the understanding that this is a handheld vacuum designed for small jobs, if I need to do a deeper clean I'll have to bring out the bigger vacuum. If you need a stylish handheld vacuum that performs well, then you should give this vacuum a try.", "[[VIDEOID:51e7eae754991cb5fe083e48c2a3de4e]] I got this vacuum for using on my car and cleaning furnitures etc. It has really nice design and it is very lightweight as well. Dissection power is as expected and does a good job of picking dust and stuff. Obviously you have your items it cannot pick because of the size and the container size is decent as well for a handheld vacuum for vacuum your car or sofa. Overall I think it's a good value for the money and does the job as expected I would recommend it if you're looking for a small handheld battery powered vacuum for cleaning your cars or furniture.", "[[VIDEOID:860f5697cf0acab0f76d8da25187af0d]] This slim handheld vacuum is a real winner in my book. It fits  easily in your hand, and with it's slim design it will get into tight areas that a regular dust buster or bigger vacuum just can't. Clean your car, spills in your kitchen, and in those hard to clean areas like under cabinets, or the fridge.  It charged up in a few hours and was cleaning up, and with those two speeds, it can get the crumbs and dust sucked up for you. This is a real winner in my eyes.", "Convenient mini handheld vaccum. Has great suction, picks up dust, crumbs, my long hair, etc.  The size of the vacuum is perfect for me to keep around the house. Doesn't take up too much space but does the job well. Especially for areas I can really reach to clean, such as the corner of my bed or the bottom of some furnitures. I even use it for the ceiling corner or areas that I see dust. I also like the indicator light, red when it is not fully charged, once it's done charging, it will show a blue light! Product is simple to use, putting it together and taking it apart for cleaning. I am unsure how well the battery life is. I do use it often but for a short period of time (10 mins or so). I would charge it once a week, so I never reach the low battery. No issues or complaints as of now, so 5 stars! Hope this helps :)", "I love this new vacuum, took me long to do this review because being disappointed many times with this type of vacuum after few weeks use. This one is the best I have for daily use due to my old cat hair all day long. The battery last good I don’t know exactly how many hours running because I use few minutes everyday and just charge every few days. This one is very practical for pet hair and small dust", "[[VIDEOID:bc4adce216f874417e710245917f72bf]] Very useful for cleaning car from dust and dirt", "I bough this for picking up loose cat hair & dust on corners where my big vacuum cleaner cannot go.It hardly picks dust,the suction is low.The only thing good about this is the fan that keeps blowing in my face.hardly picks dust from blinds forget about picking cat hair from carpet :(& now I realize it’s not refundable!", "I had issues with a crack in the barrel but the seller was incredibly accommodating and replaced it and I’m so glad because this is a useful tool to keep my home tidy! Works great and easy for crumbs and deep settled dust and dirt, easy to clean as well. I’m really enjoying this vac life vac!", "[[VIDEOID:ffae2b51358a91fb5b126c44c092ea73]] I had bought initiattly a car wired one... but then saw this one and felt inlove.. I even use this one for the car and have forgotten the other one! This is my new best friend... helps me a LOT with the dust and allergies! Don't hesitate to buy this one over. YOU WON'T REGRET IT!", "[[VIDEOID:a4b5c9538249c94bb4dd181e6a62ded4]] its very good looking feels expensive.<br />it does have some suction as you can see on the video and the battery holds good so far like 20 mins use and still have power.  those adapter extensions are very handy for my car in between the seats thats the main reason i got this vacuum, the only thin os the filters i dont know yet where i can get more ,  and they do keep the dust in the vacuum very good one. it charge fast and its a nice led on the power button red and green lets you know when fully charged.", "I live this vaccum. Very well made. The suction is strong and picks up dust and crumps very well. Just a swipe forward and backwards and you're all clean.", "I used the handheld vacuum to clean my SUV.  It was very powerful to remove the dust from the seats and floor.  The dust container holds a lot of dust and is very easy to remove and clean.  The charge was long enough complete all my cleaning and it still had power.  It is lightweight and charges quickly to reuse again and again."], "reference": [2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.699999988079071, 0.800000011920929, -0.20000000298023224, 0.22500000335276127, 0.6000000238418579, 0.5, 0.10000000149011612, 0.800000011920929, 0.8999999761581421, 0.5, 0.699999988079071, 0.6499999910593033]}