{"reviews": ["First of all, I was pleased to realize how small is this vacuum and yet so powerful. The suction is is very good even  at position number 1.  It is very lightweight which makes it very comfortable to use. I like the feature that both filters are washable so you do not need to buy any extra bags.<br />Nice addition to my full size vacuum when I need just to clean some spots. Overall, very good product. Highly recommended!", "I initially encountered some issues with this vacuum. It arrived with a broken filter, but I worked with the seller who was incredibly professional. I am a bit of a vacuum connoisseur having bought a number of cordless handheld vacuums over the years. In rating any product, it's important to remember the price. This is a less than $50 vacuum so I didn't go in expecting it to have incredible suction, and in my experience, you don't actually want gaudy suction because invariably the battery life will run out quickly. I have a Dibea cordless, handheld vacuum, which is excellent (and twice as expensive). It's an extremely powerful 1700PA at max-power (this one is. That's great, but it only lasts about ten minutes. The suction for this Vaclife is good, though on low-power it's not strong enough to suck up much of anything, so I only use it one full-power and the battery life lasts for about 15-16 minutes, but wanes in the final couple of minutes. The motor for this vacuum is AC. AC motors tend to be a bit louder and not quite as efficient or enduring as DC Brushless motors, which are a more recent invention and can be found in other cordless handheld vacuums, but they typically have higher price points. It takes approximate 3.5 HRs to charge this vacuum from empty (red) to full (green). Cleaning out these types of vacuums is always challenging since a lot of dust/particles get stuck to the paper filters, as opposed to getting trapped into the plastic collector cup. This means you have to actually pick the very debris you've vacuumed up out of the filter with your bear hands (I don't recommend using a brush or water, at least not often, as it will quickly degrade the paper filters, and you only get two of them and I've already contacted the seller about getting more filters and it seems as though it's not possible). It comes with two attachments, a crevice tool and an upholstery brush. The vacuum has a sleek design that will fit in with any decor and can be stored, along with the attachments, on a stand that charges it.", "[[VIDEOID:8dfdb6a309c2fd7e115bf8f94ab9b623]] Bought this for my girlfriend to use in her car. After weeks of using, here is my pros and cons of this item:<br />Pros: Very easy to assemble and easy to use, you just need to follow the manual which is very straightforward.<br />Lightweight<br />Decently long battery life<br />Very easy to clean and maintain<br />Cons:<br />The suction power is a little weaker than the other model VL189 that I owned, so this vacuum is only good if you wanna clean the table or your car interior.<br />Note: Remember to charge the vacuum after3-4 months of usage, and also register the product on their website to get an extra 2 years warranty (which is very good in my opinion, they will send a new product if yours is broken)", "great product", "It's compact and powerful. I like it very much. I definitely recommend this product.", "First, the packaging was impressive...sturdy and double boxed for shipping. Was pleasantly surprised to see an extra filter was included.  After one use (there was a lot of debris from the floor mats on the car) the filter was durable and easy to clean.  It has a small nozzle so it's meant for small areas, and there are 2 separate attachments.  I will use this mainly for small areas in the car, and for my sewing room to pick up small pieces of thread. Overall, this is a quality product and I'm pleased with my purchase.", "[[VIDEOID:3782534f495b0e87c78bc580301e5a11]] I was excited this product to arrive in only two days. I tried it out on my 2 cars and it lasted. I like the suction and it really works well. I hope it last longer than my last one.", "This product is really amazing and i can refer my friends.  This is so handy and has a powerful suction that cover every corner of my home.  This comes with a small LED light but has clear visibility during the night.  I can use it on my car too and don't need to stretch much as the handle is more convenient for in-depth cleaning where my hands are not reachable. This stand helps me to place the vacuum anywhere I like and does not occupy much space.  And it comes with two settings which are cool for this price.  It's worth having it for every home!!!!", "Couldn't believe how well this product actually worked<br />Gets every little piece and gets in the smallest places", "This tool works great!  We have a German Shepard and it handles her hair just fine. I would definitely recommend this product to anyone.", "[[VIDEOID:823a3dd350242f02f294764f4a58641f]] This is very easy to use, compact and has 2 suction powet settings. It does its job for easy clean up that you need around your house or anywhere else. Highly recommend this product if you are always on the go but need to do some quick clean up.", "I used this for my car interior. Everything you read in the reviews that is positive - - they are true. Very high quality product.", "We have purchased two of the VL model so far. We wanted to get something with a smaller for my car to use and also which is portable.I can leave in the car. Suction is pretty powerful and has 2 modes. Highly recommended this product if you are always on the go but need to do some quick clean up.", "Vaclife is Exactly what I’ve been looking for in a portable vacuum. It’s easy to put together out of the box. The suction power is super impressive and more than I anticipated. Besides the suction power, the ease of cleaning the Vaclife is unbelievable! I know that this product will last so much longer just because I will do the upkeep on it. It’s too easy not to do it. Definitely a must in your car and light household cleaning!!", "This is by far one of the best purchases I’ve made on Amazon.  I bought this to use for my car and it worked great!  The suction power and battery life are pretty good, considering it’s a mini handheld vacuum, so it’s meant to be used for spot cleaning and other smaller, shorter cleaning jobs.  For larger jobs, you obviously would need to bring out the big guns (aka, a regular vacuum).  But for spot cleaning, this tool is perfect.  It’s also very lightweight, aesthetically pleasing, and smaller than I expected, which is a plus.  It doesn’t take a long time to charge either, and it’s easy to clean.  It got rid of a lot of dirt and other small debris after only using it a couple of minutes.  Overall, I’m very happy with my purchase and would recommend this product!  Some people have said they received discounts or other rewards for their reviews, but I would like to clarify that I received no such thing, so this is 100% my genuine review.", "What a way to have this at such a compactable size yet so powerful. The suction is really great and the cleaning was so easy to do. This product have really reduced the efforts and have really worked well beyond my expectations.<br /><br />A must buy product..", "More than pleased with the product, using it to clean around my desk area and it was exactly what I needed.", "This is very compact to store inside the car. It looks so good with powerful suction in it.<br />Easy to clean and better battery life. I like this product very much.", "This is a great vacuum to have for your car! The sizing is perfect to keep in the car since it’s not too bulky of a product. It has 2 different suction power settings, you just press the power button twice. Suction is decent and since it has small storage for what ever you sucked up with it, I only recommend this product for people who don’t need to clean a big mess or have to use it for longer than 25 mins since it does get hot.", "Vry nice product", "I had been struggling to find a small hand held vaccum to clean up my  pets hair.This vacuum is definitely a good product. It has a modern and sleek design with 2 different speed settings. I use this mostly for living area couch and it has done a good job in picking up my dogs hair. Its convenient and easy to clean after use.", "Great product. handy for quick car cleaning.", "The vacuum is great! I use it to clean my car and the carpet of the living room. Great product.", "Would highly recommend this vacuum due to its light weight nature and ease of use. It is particularly fantastic for small spaces and corners. My 3 year niece really enjoys using it too after she eats and she can actually maneuver it quite well as it is very light in weight. It also is durable and has good suctioning power so far. Really appreciate that they give two dust cups in the original package. Would definitely recommend this product", "The vacuum is so light weight and has great suction power. We primarily use this for Car cleaning. my wife loves this product and has extended battery life that we have seen other brand product.", "OMG....... I am once again blown away by a superior Vac Life product. It's light weight but still has Powerful suction. The battery life is very impressive. You can finsih most jobs without having to recharge the battery. The charging station is a convenient counter top cradle that is so easy to use. Like all vac life products I have tried, it is sturdy, well built and very attractive. Thank you again vac life..........", "I chose this product because it had a sleek design and decent reviews. So far it has worked well. I really like that it has two suction speeds. I mainly want it for my furniture for cleaning pet hair. I’ll see how it holds up over time because I vacuum a lot!", "Purchased to use for quickly cleaning up crumbs and dusting, and so far this product exceeds expectations. I was happy to fine that it does come with two filters so you can still use it while the other filter is being washed/drying.", "I bought this handheld vacuum to vacuum my car. Hiking brings a lot of dirt into the car. This vacuum was amazing! It had a lot of power and was able to suction up the dirt in my car. It was also very easy to clean. I am very pleased with this product!", "I got this to use as a car vac and have waited until I’ve used it a few times before writing this.  It has two suction speeds and even the lower setting is powerful.  Easy to clean.  The charging stand could be improved but that is a minor issue.  Good product!", "I love this thing. At first I was like this suction is not strong enough but then as I used it for hard to reach spots underneath my bed and in corners I was became a fan of this product. Great so far."], "reference": [3, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.8999999761581421, 0.10000000149011612, 0.30000001192092896, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.5, 0.8999999761581421, 0.5, 0.8999999761581421, 0.30000001192092896, 0.8999999761581421, 0.20000000298023224, 0.20000000298023224, 0.8999999761581421, 0.6125000193715096, 0.800000011920929, 0.8999999761581421, 0.3375000134110451, 0.800000011920929, 0.20000000298023224, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.699999988079071, 0.800000011920929, 0.699999988079071, 0.30000001192092896, 0.8999999761581421, 0.8999999761581421, 0.30000001192092896]}