{"reviews": ["First of all, DOWNLOAD THE APP if your sound isn't to your liking! The app has an adjustable EQ and other important features like noise canceling and ambient sound adjustment. I use the largest ear pieces provided for a secure and tight fit, which enhances bass response. My only complaint is that I wish they were LOUDER! I mean, they're ok, but one more level would be best for me personally bc when I jam my music, I JAM my music!<br />My music preferences are classic rock, new rock, melodic rock, and 80s stuff (both rock and new wave)<br />Overall, they're not \"amazing\", but they're really good. Can't go wrong with a name like JBL<br />(For the reviewers who say they lack bass response, try tighter fitting ear pieces. You MUST have a tight fit to enhance bass!)<br /><br />EDIT: Just discovering these buds DO NOT have a touch volume control which kind of sucks! Volume is ONLY controlled via the device. I wish I had known that. I may return them due to this", "I had high hopes for these being JBL and something new that just came out. But they have the same tired scooped midrange sound, but odd with these buds because they make the high mids sound honky and annoying, with the hyped bass and tinny highs. I even tried using the EQ in the app to get them to sound as close to my pair of Sennheiser studio pro over ear headphones I use for tracking and mixing. That didn't work. Plus, the left bud kept randomly falling out of my ear. Like I stated to say the least... Disappointed.", "These do not fit in your ears well, they constantly fall out despite changing up the ear bud inserts.<br /><br />The “bass” is non-existent. They “worked” for two weeks before I lost them in my car for a month. Just started trying to use them again. The left one fell out of my ear on a walk into the grass. Upon returning it to my ear, the volume in my left is 10% of what it should be now. Apparently the speaker just quit working in the left pod.<br /><br />Save your money. These are going in the trash.<br />Wish I could give no stars.", "The bass is very low for jbl which is odd. I've had cheap Skullcandy that did more, but after using the app to put the bass EQ on it was a little better, I aslo use \"Poweramp\" as a music player which gives me another EQ that's way better but yeah. The treble and mids are perfect though. Very clear, crisp audio all around. I've honestly gotta say these were worth the 50$ while on sale. I would definitely recommend but again the bass isn't what I was expecting. Out of the box it's almost not even there but I've managed to tweak mine to give me enough. The treb/mid definitely make up for it though. 4 out 5 *", "Love the way they sound, the bass is very punch and pronounced. The talk through function also works very well. Unfortunately everything else that makes a good pair of earbuds falls short. The earbuds just wont stay in. I get everyone has different sized ear canals but you will see other reviews about them falling out. I have to constantly readjust them. The normal sized silicone cup is too small (wont seal so no bass and bad noise canceling) but the large cup is too big so wont seat in ear correctly. The active noise canceling is very minimal can hardly tell its on, and last the case is not all that great. The lid is very flimsy feels like it could break easy. I would definitely return them if I could, but through out the packaging. Might end up gifting them to someone who can maybe get a more comfortable fit. At the end I cant recommend them.", "Significant downgrade from the previous 125 version which I used for about 2 years. Worse sound quality, just a lot of bass for music. Voices have a slight echo and delay in videos which the previous version did not have. Noise cancellation does work ok for the price, more of a gimmick though. Touch controls on the sides are very sensitive. Overall I recommend just getting the previous 125 version without the useless extra features if you can.", "They didn't fit very well with any of the other ear size pieces and no bass for my music."], "reference": [24, 20, 2, 2, 2, 1, 0], "score": [-0.30000001192092896, -0.10000000149011612, -0.5, -0.29531251173466444, -0.30000001192092896, -0.4000000059604645, -0.30000001192092896]}