{"reviews": ["I actually like these headphones. The lost star is for the fact that they do not really sound that great without the jbl headphone app. Once I popped that on even just using the default eqs, 90% of my complaints evaporated.<br /><br />I've seen people compare these to skullcandy, I'll do the same since my last pair were skullcandy anyway.<br />While the skullcandy delivered solid bass it did so while stomping on mids pretty badly. These do not suffer that issue. While it can be said the bass is louder on the skullcandy set. These are offering a much clearer and well rounded bass without utterly destroying the mid range, and though quiet out of the box the installation of the app brings them to the same volume the skullcandy pushed if not a little louder.<br /><br />Fitting them to your ear can also be a bit of trial and error. I'm actually using a different sized cup on each ear to get the best results for myself.<br /><br />Biggest thing is the app though, it really was a night and day difference. The default club eq seems to work for most genre's or you can of course create your own if you want to get picky.<br /><br />Once the fit and app are out of the way, these are not bad at all. I suppose it bears mentioning that the advertised quick charge feature actually appears to work with these. (this is something that on skullcandy's side seemed like a point blank lie)<br /><br />The touch sensor may be a bit on the sensitive side, but that's been true of the last 4 or so of these I've owned.<br /><br />This review may sound a bit critical but I'm legitimately enjoying them, largely wondering why the default profile for them sounds so bad though. The app immediately clears that up fortunately.", "Too Quiet?? iPhone users you MUST adjust (or turn off) the “Headphone Safety” feature in iOS Settings. By default it will throttle all headphones to be very quiet. It’s not the fault of these headphones!<br /><br />Having gone through several pairs of no name head phones.. it makes sense to just buy a known name brand sometimes.<br /><br />These really sound great. Very clean deep satisfying bass but not overpowering. Excellent highs and overall a very bright and rich experience. I can hear extra elements of the music that I didn’t hear with cheaper headphones.<br /><br />The ANC is good (not perfect) but definitely fills a need. If you’re a person that plans to use them for ANC alone (no music play) these are NOT for you. They just help isolate the extra noise when you’re listening to music or movies or podcast.<br /><br />Make sure to download the app and setup a custom EQ etc etc. That’s a big part of what makes these headphones great.<br /><br />Are they the best I’ve ever heard? Or are they as good as my $400 Bose headphones? Absolutely not. But they’re comfortable and compact and don’t break the bank.<br /><br />JBL has always been great quality at an affordable price. Reliable and dependable.<br /><br />Thanks JBL!", "These earbuds are really good. sound quality is great and with eq settings in the app the bass is amazing. The noise canceling is ok, I've never had noise canceling earbuds so I don't have anything to compare them too but with the noise canceling on I can still hear a lot of stuff going on around me it's just quieter and muffled. without eq settings on the app they're pretty mid, they don't sound bad, but they don't sound amazing, so if you get these get the app. the earbuds aren't very loud either. I have to put them on max volume for them to be loud enough for me and I don't blast my music super loud or anything. Overall, these are the best earbuds I've ever used but there is still some room for improvement.", "Real bass!!", "Great Great sound, depth, stereo separation. Somehow these stay in your ear while your blasting out some great  80s 90s alternative.  They go very loud, and the phone app is really awesome with many different equalizers you can set. Probably the Samsung expensive buds are not much better.  Excellent deep bass, great highs.", "The JBL earbuds I got are amazing. I was looking for a pair of airbuds for working out, with a great quality of sound. This product is very versatile in the sound settings, which let you customize the sound settings such as bass and treble. I’ve had issues with earbuds falling out while working out, but these baby’s stay in great! Overall amazing product!", "It is physically impossible to get the same effect as over the ear headphones but they sound very good. A bit petter than stock Apple ear buds but no wires. Download the JBL equalizer to pump the bass and the sound even better. Good control surface and the battery life is like they made a deal with the devil.", "Will be returning. Overall sound quality is average for the price point. Not bad but not exceptional either. The mid tones are good but the bass is just slightly lacking compared to competitors. The problems I have are two:<br />Volume: There is a distinct lack of volume control on the devices. I can cycle through audio modes and mute using the bud controls but when changing between media and a phone call I have to pull out my phone to adjust the volume. When talking to someone on the phone who is speaking in a normal voice any background noise on my end like road noise in the car drowns out the person. My experience is that even with the volume all the way up on my phone these buds will only reach about 70% volume from Walmart's budget brand competition.<br />They fall out of my head while sitting still...<br />I dont have unusually large ear holes and most brand's medium pads fit snug. While the JBL medium pads appear to be the same size or larger than competitors they dont feel snug. I tried switching to the large pads which do snug up but dont feel entirely secure and do shift around requiring adjustment. If I shake my head once or twice like people do in the Raycon commercials these things go flying which means that expecting them to stay put while doing any kind of physical activity or is laughable. One fell out while I was walking to the kitchen for a snack. Just sitting on my couch or at my desk and not adjusting them every few minutes each has fallen out more than once.<br />All in all they are OK buds. I think they are slightly below average at the $50 price point I bought them at and are below average at the normal price of $100. The audio quality is ok but not above average. The first time I wore them they hurt my ears where the plastic meets the skin after about a half hour. The lack of volume controls and the need to keep adjusting them or else they fall out completely means I wont be keeping them.", "I loved these bluetooth headphones a lot! The bass and noice cancellation were fanatastic! There's also a \"talk-through\" mode that allows you to have a conversation with them in (the music becomes super soft). However, I had to return them due to their short battery life and the fact that they kept falling out of my ears. Consistently! I always had to adjust them or they would roll right out of my ear. And the battery is recommended to be fully charged only once every 3 months...but if you're like me and listen to them om average 5 hours a day, 4-5 days a week, the charge on the battery case wouldn't make it! Definitely returning!", "For the money, you can’t go wrong here.  I’m not an audiophile however I know good quality when I see and hear it.  Highs well defined and pretty good bass.  Holds a charge pretty well also.  Being a DJ I have quite a few speakers and headphones.  These make the cut for me.", "Mid- range is solid, could use deeper, richer, tighter, bass,but for the money not bad. Noise cancelation is excellent, just wish they were alittle louder,with deeper ,tighter, richer,BASS!*", "I like JBL as a brand, and they do get it right most of the time with their products. In terms of earbuds, I have the Tune 115 and these buds have proven to be a solid product. The Tune 115 has survived some series of falls and water submerging without even having an IPX rating. I have seen the 130NC  on sale and had to pull the trigger. IMHO The 130s buds are a great value for sure. Pretty good noise canceling with a solid bass presence. Understandably, they are not as loud and bass saturated as my Sony WF-XB700(which has bigger-sized buds). However, these JBLs have other features such as ambiance mode, good touch controls( and I am someone who prefers button controls), and of course: a decent ANC.  The sound is clear and well-balanced, as expected from JBL. I like the app a lot btw..very easy to control and customize an EQ. The fit is so-so sometimes, but that could be solved with non-JBL ear tips. The supplied ear tips are good, but the size jumps a little between the small and the large tips... This minor issue does not warrant a one-star fewer IMHO-Especially for the sale price. You get SO MUCH more than what you pay for..", "Great product but it’s what I would expect from JBL. The bass is really good. My kids have apple airpod pro-the newest ones and they do NOT sound as good as these. Apple does an incredible job marketing their products because they certainly are not superior-especially in the earbud department. Do yourself a favor and buy these. Excellent sound quality for an incredible price! It’s JBL-they know how to build speakers!", "They work well, my son never hears me! The sound is solid and clear. Amazing bass!", "I like the JBL product.  had already picked a pair up for me from a store and found that these little buds are better than some of the more expensive ones.  picked up another pair for my wife and she got jealous that I didn't need my headphones anymore.  good product for the price.  good bass and works great with your iPhone for phone calls, music and movies on a flight.", "I bought 3 of these. The sound is AMAZING! In my opinion they’re better then apple AirPods. If I had the money I’d purchase a bigger Bluetooth one for my home. The bass is great, it’s easy to answer calls with them. They’re compact and fit comfortably in my ears and typically I can’t stand earbuds. I love these. I got myself these and both my boys. My kids are in their teens and they LOVED them as well. The price was great!", "Nice small size with a lot of bass", "This is my first Amazon review. I bought these to replace my Galaxy Buds Plus. Much better sound so far. I'll see how battery is soon, but sound is much better. Much more bass. I will say that the app isn't very intuitive.", "There is not enough bass and sound quality", "Sound good, could use a little more bass but other than that are nice headphones and sound is clear. fit and are comfortable too", "Purchased for someone else.  She says “they’re a bit of a pain to use for the Bluetooth function.”  I listened to them, and thought they had a nice sound with strong bass.", "Awesome sound quality, noise cancellation, superb bass, and awesome jbl warranty and product", "Great bass! You have the option to adjust the equalizer. Great buy!", "Incredibly clear bass, I have studio monitors for mixing and mastering music at home and these are just as good as them if not better. Battery in one earbud lasts a whole 8 hour shift if charged. (Charges very fast) I use the small earbuds covers and they slip a little sometimes but I'm a janitor and I move around a lot and they don't fall out very often. Usually only when I'm wiping my face", "These have great sound and good bass. The noise cancelling feature works pretty well. I use them at work", "Amazing bass perfectly clear sound and the battery last forever", "First thing when they connect tht sudden feeling of the noise cancellation is just crazy ...then to when you turn the music up ...u feel so engulfed by the sound and that tru bass is immediately felt...if you looking for loud no ...but if you looking for balanced amazing sound this is it"], "reference": [37, 7, 6, 5, 4, 2, 2, 2, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.14951989248865097, 0.699999988079071, 0.800000011920929, 0.5, 0.8999999761581421, 0.30000001192092896, 0.4000000059604645, 0.4000000059604645, 0.20000000298023224, 0.800000011920929, 0.30000001192092896, 0.10000000149011612, 0.8999999761581421, 0.8999999761581421, 0.800000011920929, 0.800000011920929, 0.699999988079071, 0.30000001192092896, 0.10000000149011612, 0.5, 0.10000000149011612, 0.8999999761581421, 0.8999999761581421, 0.4000000059604645, 0.8999999761581421, 0.8999999761581421, 0.20000000298023224]}