{"reviews": ["This humidifier is GREAT!  Works well; very quiet.  Easy to fill.  Holds a good amount of water.  I really can't understand problems that people have had unless there's a high proportion of \"lemons\".  Mine is wonderful.  I really like the clear plastic so I can see how much water is left.  I highly recommend this product.  And I NEVER write reviews!!", "I love this humidifier, after using a bunch of different other kinds over the years. This one was clearly made for people who need to use humidifiers daily, like those of us who live in climates with dry air, especially in winter! First, I love that it had a huge capacity. It will last several nights without me needing to refill. Second, refilling is super easy. I can either remove the container and fill under the sink easily (with a wide opening so I'm not spilling water everywhere trying to pour water into a tiny hole!), or I can bring a pitcher of water to it to fill. When I'm not using it, I usually just remove the top to let it air dry for a bit. This helps immensely with keeping it clean and free of mold and mildew - SUPER important design for any humidifier. It is easy to clean.", "I want to give this one 5 stars. It works great. It holds well over 1 gallon of water. It operates for a long time. I just want it to put a little more moisture in the air. I'm in Tucson so with this working I do not wake feeling over dry, nauseated and sinus sick. That's good. But, if I go outside for a bit and walk back into the room where it's been running all day it doesn't FEEL super humid like other units have even on High full time. I've had units in the past of the same size and similar design where you walk in the room and it feels like a swamp. Not this one.", "Overall it’s great. Super easy to refill compared to standard humidifiers. It’s quiet. The tank is huge so it lasts a while. When the water runs out a red light turns on and it stops. As long as you stick to distilled water it’s very easy to clean. Only downside is the cord is a little short.", "I thought this was going to be a cheap humidifier but I was only half correct. It was cheap in price but not in quality!!! It’s so much easier to just take the top off and add water rather than having to remove the whole tank take it to the bathtub, fill it up. Don’t break anything. Dry it off. Take it back…. No. Just an easy lift and pour. It makes ZERO noise! Only downside is it doesn’t have a red light indicator to tell you water is out. You just have to check it daily. But having a bigger water tank means you won’t have to check as often depending on the output of humidity.", "I am buying this product is easy to clean and no noise because I use it in my 1 year old baby room. The other reason it is 5L tank, I keep using it from 9pm to 7am every night, one tank of full water it can use for 3-4 days long. super easy to use and my kid love it. Great product.", "A simple analog dial on the front of this smaller humidifier highlights its clean and simply design. The tank is the largest part of this, and it holds a lot of water for the footprint of the unit. Very quiet. I do recommend.", "good size for next to bed, great output, absolutely quiet, holds a lot of water for it’s size. it’s rectangular design fits on the nightstand much better than any other design, no accumulated water anywhere, easy to fill. easy to direct the mist anywhere you wish. really happy with this compared to others I have tried.", "Very easy to install, just fill the water tank with water, plug it in, turn it on and it works. The mist flow can be adjusted from light to heavy. The water mist is even and fine, very gentle, and it is very quiet, as if you are not in the room, so you don't have to worry even if there is a baby. Great product.", "The bear humidifier was delivered sooner than expected. The device is rather compact in size but the size specified. The instructions were simple in that there was one sheet describing the process and a small booklet  with 4 more pages of opereference instructions that did not encourage one to immediately setup the device. After setting up the device it worked as expected and quietly.  There is an ease of  adding water from the top cap assembly. One can add essential oil inside the base. The oils do not come with the device but the fragrance is quite spectacular when the humidifier is in operation.  Overall , the hard plastic is smooth and sturdy and worth the money.", "I love that this humidifier is an EASY top fill. Nothing to flip over or unscrew, just lift the square lid and pour your distilled water in! It's absolutely silent and has various settings for output. You should clean monthly to prevent mildew, as with any humidifier. I found this MUCH easier to clean than others I've had. I have 2 of these now for different rooms. Highly recommend this one!", "This humidifier is perfect for a large room. It has quite the output. In fact, I had to turn it off after few hours. I really like the teal color and smoky gray top, doesn’t make it look like a humidifier. It’s easy to fill from the top (and clean), the directional spout easy to turn. Does the job, it’s quiet, perfect for our living area to avoid those dry winter days and keep stuffy noses comfortable. I also like the turn off & on knob, easy to control output. Holds a lot of water to run for hours. Glad I chose this one.", "quiet, small footprint, easy to clean, top fill-so easy to add water", "Great color, it is not loud and holds lots of water.", "Whisper quiet. Runs great and I only have to refill 2-3 times per week.  I.use distilled water in the machine and have had no issues with leaks.", "I love the fact that this thing is so quiet. You don't hear it running. If the power goes out, it comes on when the power comes on. It holds a gallon of water but it uses a half a gallon probably in 8 hours.  So you do fill it up every other day at least.  The nice thing about it it's easy to feel you open the square part of the top and there's a big area to dump the water into. The directional flow is very nice. I just wish it was a little bigger to handle the room more than it does. But definitely was worth it.", "I got this for my plants and wanted something that would blend in more than a chunky white/blue humidifier. I like that you can change the direction the mist is coming out and it holds quite a bit of water. My plants are happy so no complaints!", "Very quiet , holds a large amount of  water", "I have purchased a few different types of humidifiers. They always work great, until they need to be cleaned. This humidifier is very easy to clean. You can easily access all areas the water gets to and can scrub away the buildup. I also really appreciate the size of the tank. It can run all day on low and won’t run out. The turn knob is easy to use to change the amount of flow as well!", "Holds a lot of water. Only have to fill every 4th night. 3 weeks in and all is good.", "Works perfectly and isn't big and bulky but holds a lot of water!", "This came quickly. I’m impressed by how far down you can turn the …vapor and then how long the water lasts.", "Top load so no more spilling you can actually see how much water is in there", "works well, needs distilled water or the minerals from tap water my land on surfaces nearby", "NEW UPDATED REVIEW- Okay, so I changed my review to a four star. This machine has an obvious filtration type system. This machine is NOT compatible with untreated well water. Old school machines don’t have parts that can get gummed-up, but this machine does. This would work totally fine for treated well water / city water. It’s a nice machine, and works well with the right type of water. The old review was unfair because I didn’t realize it wasn’t working properly due to my water type. This would be a visually pleasing item for someone with treated water. It just has extra parts internally, that old school machines don’t have.", "This is a game changer for dry households or can be a life saver for plant filled houses! It has a large capacity and can pretty much run at all times -- I change the water every week.", "I bought this for allergies and the winter cold season of living in New England (U.S.). The humidifier was so good, my windows would develop condensation. I clean it weekly with alcohol diluted in water and/or vinegar cycle to keep mildew at bay. My water is semi-harsh, so please note distilled water is used as advised. 8 months later, my humidifier does not work as efficiently as it used to. The 5 L tank rarely burns \"fuel\" in 24 hrs like it did prior and my room air is still very dry. I'm disappointed.", "Unit is attractive and does not leave a puddle of water around the base.  Basicly it will run overnight if you add water at bedtime.  When it turns off, there is still about an inch of water in the bottom of the resivoir.  Instructions caution against adding essential oils.", "Works fine; it’s quiet and the water lasts a long time. But the floor is always wet.", "This humidifier worked great for the first month or two and all of the sudden I would go into my kids room and it would be super hot in there muggy the windows would be frosted and there would be water pouring out everywhere. It ruined a brand new led side table in their bedroom, and I had to have an electrician come and Repair the outlet.", "Worked like a charm for about 4 months then no output at all. Only used filtered water so not from mineral buildup.", "I am completely disappointed at this product i bought these bear humidifiers back in October 2022 now I know what you’re thinking why would she wait this long tomorrow a review when it’s almost been a year but I actually don’t pour these out until around winter time so I bought a total of three and all are malfunctioning. They are retaining water at the bottom and are not releasing any missed. I have repeatedly clean these humidifiers and follow all instructions once they were open out of the box and I have continue to have issues with the lifespan of these humidifiers. I don’t have the original packaging but I’m sure it’s too late to even return these. I’m very disappointed that I’ve wasted my money on a product that does not last , I’ve used all three may be a total 3 to 4 times during the 2022 winter season now we are approaching 2023 winter season and I am having to purchase a completely different brand of humidifiers to get my family through the winter, I give these zero stars do not buy I repeat !!!!!!!", "I took super good care of this and only used filtered water from my Berkey. Still died in a month"], "reference": [12 , 11 , 8 , 7 , 5 , 5 , 3 , 3 , 2 , 2 , 1, 1 , 1 , 1 , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.550000011920929, 0.20000000298023224, 0.10000000149011612, 0.15000000596046448, 0.30000001192092896, 0.10000000149011612, 0.10000000149011612, 0.6500000059604645, 0.6000000238418579, 0.5, 0.30000001192092896, 0.30000001192092896, 0.8999999761581421, 0.5, 0.4000000059604645, 0.15000000596046448, 0.5, 0.20000000298023224, 0.20000000298023224, 0.10000000149011612, 0.699999988079071, 0.699999988079071, 0.30000001192092896, 0.4000000059604645, 0.36666667213042575, 0.10000000149011612, 0.033333333830038704, 0.26666667064030963, 0.699999988079071, 0.4000000059604645, 0.10000000149011612, 0.10000000149011612, 0.699999988079071]}