{"reviews": ["The mist is produced silently and without any annoying lights on the machine  (only one weak light to signal \"on.\")  I like the one-gallon tank for simplicity of refills.  But the machine allows for the production of lots of slime ..you'll need a small paint brush or something to get into the crevices to clean it out thoroughly.  Other than that, it's a pretty good device for its small size.", "This is a great humidifier! The only thing that could possibly make it better is if it could fill itself!! ( lol) it’s water reservoir is a size that’s easy to manage bringing it to the sink to fill , or , bring a jug over to fill it- the opening in the top of the reservoir is large for filling it up! And  the amount of humidity is adjustable. Also , it is QUIET !! Which is really a plus!", "good size for next to bed, great output, absolutely quiet, holds a lot of water for it’s size. it’s rectangular design fits on the nightstand much better than any other design, no accumulated water anywhere, easy to fill. easy to direct the mist anywhere you wish. really happy with this compared to others I have tried.", "I have been searching for a great humidifier. I've been through a few brands and they either don't work properly or actually break and stop working after a few days! It seems the digital ones are breaking down sooner. I love this humidifier for a few reasons. First off, it looks so cute and not \"medical\" looking - I love the size and color. But best of all, it's got an old-school knob that turns on and off. I love it! Quiet and large enough tank for all day and night. Just get it :)", "Great value, good size. Works throughout our large living room. Absolutely love the color, it's very stylish for a humidifier.", "The bear humidifier was delivered sooner than expected. The device is rather compact in size but the size specified. The instructions were simple in that there was one sheet describing the process and a small booklet  with 4 more pages of opereference instructions that did not encourage one to immediately setup the device. After setting up the device it worked as expected and quietly.  There is an ease of  adding water from the top cap assembly. One can add essential oil inside the base. The oils do not come with the device but the fragrance is quite spectacular when the humidifier is in operation.  Overall , the hard plastic is smooth and sturdy and worth the money.", "I have purchased a few different types of humidifiers. They always work great, until they need to be cleaned. This humidifier is very easy to clean. You can easily access all areas the water gets to and can scrub away the buildup. I also really appreciate the size of the tank. It can run all day on low and won’t run out. The turn knob is easy to use to change the amount of flow as well!", "Great size, runs for a good day and half when full. The spot for the oils is a little tricky, but overall looks nicer than most and works great!", "Works great, perfect size for all our bedrooms. Hate that it needs to be refilled almost daily and unplugged to refill. Poorly thought out design", "This is the perfect size. Works amazing. The baby loves it. It doesn’t leak at all. super easy to use. It’s not to bright.", "I like the very affordable price for the unit. The size is small and very portable.  The Bear humidifier is also very easy to use and clean, you only need a microfiber cleaning cloth.  The sound it makes is very quiet and  barely audible. One draw back is the water tank lid does not have a locking mechanism. Therefore, accidental spills may occur. The water filter that is included gives you the option of using tap or purified water. Filtered water from the refrigerator may also be used. However, if the water filter is ever physically damaged, it will need to be replaced."], "reference": [6, 3, 3, 2, 2, 2, 0, 0, 0, 0, 0], "score": [0.4000000059604645, 0.20000000298023224, 0.550000011920929, 0.4000000059604645, 0.8999999761581421, 0.10000000149011612, 0.800000011920929, 0.800000011920929, 0.699999988079071, 0.800000011920929, 0.6000000238418579]}