{"reviews": ["The mist is produced silently and without any annoying lights on the machine  (only one weak light to signal \"on.\")  I like the one-gallon tank for simplicity of refills.  But the machine allows for the production of lots of slime ..you'll need a small paint brush or something to get into the crevices to clean it out thoroughly.  Other than that, it's a pretty good device for its small size.", "I bought this for my in- laws room. It have a good power of mist I ended up switching this with my Honeywell humidifier that I bought last month after breaking 2 before. It was little tricky to use first time. I like the essential oil dispenser located at very bottom. I worked very well. Easy to clean and refill.", "good size for next to bed, great output, absolutely quiet, holds a lot of water for it’s size. it’s rectangular design fits on the nightstand much better than any other design, no accumulated water anywhere, easy to fill. easy to direct the mist anywhere you wish. really happy with this compared to others I have tried.", "I bought this to replace a 3 month old digital unit that was beeping loudly and randomly in the middle of the night. This is very quiet and easy to fill and clean. It's so quiet I often forget to turn it off in the morning. The only downside is that is doesn't put out as much mist as my old one due to a smaller spout opening, but it's a tradeoff for not being woken up in the middle of the night by beeping.", "A great little humidifier! It pumps out quite a bit of mist, and the top fill is a game changer. It's so nice not t have to haul a whole tank to a bathtub or someplace with enough clearance to actually fill it. I just have a large pitcher that I use to fill, and do it in the mornings while I'm waiting for my coffee and it's usually not even empty. It's quiet, low profile, and I love the green color as well! I wish they made towers for plant use as well.", "Nice looking humidifier, unusual green color.  Tank could be a little larger.  Dial works well, whether you want a lot of mist or light.  Has nice range.  So far, so good.", "The product is easy to clean and when new does exactly as advertised. The mist is strong and quiet. Bought in October, but come April/May the mist only works when you first turn it on. Water level has barley moved after 3 nights. Thinking it might be filter issue, but from what I’ve read nobody can find a replacement. We really enjoyed it when new. Will not purchase again. A waste to have to recycle this and try with another product.", "I got this for my plants and wanted something that would blend in more than a chunky white/blue humidifier. I like that you can change the direction the mist is coming out and it holds quite a bit of water. My plants are happy so no complaints!", "I love it. At a medium setting it lasts 24 hours. I bought two more for other rooms. Best of all because it is cool mist it is safe around my cats. They are very curious and it is nice to know they can not be harmed if it was too warm. Also I love that you can use tap water. It requires cleaning more often than using distilled water but it is a trade off I will take. Excellent product. I highly recommend it.", "Love it!!! Puts out plenty of mist.", "I really like this product. It puts a lot of mist which I need. Perfectly matches my bedroom decor too. I didn't plan on that but is a bonus", "I purchased this product for my daughter.  This humidifier produces a lot of mist.  Effectively relieve air dryness caused by air conditioning.  Suitable for small to medium sized bedrooms.  Hardly any sound could be heard.  After filling with water, it can be used for 2 days.  Easy to clean.  easy to use.  My daughter loves it.  The price is very cheap.  Highly recommended.", "I like the pressure of tye amount of mist coming out and it is top fillable.  However,  the sponge bit goes kinda weird in shape after repeated oils and oils like pure grapefruit we cannot smell anything.  A question for suppler...where can I purchase extra sponge bits?", "I'm returning it because the mist was mostly hot, not cold as advertised and I live in the Caribbean. All the rest was perfect: timing of arrival, first class packaging and very easy to assemble.", "The Bear Humidifier is quiet, puts out a satisfactory amount of mist. The spout has a nice size opening and able to turn any direction with ease. Easy to set up. Simple power on, turn the knob.  Min-Max level.  No unnecessary buttons and apps. It has a low water indicator and nice appearance.  Easy to clean and fill.  Large tank.  The cord is a bit short. If it came in different colors I would have bought more.", "really disappointed in this product and now cannot return.  It started off great and the mist was good.  now only 30 days later it overheats and clogs up.  Mist is intermittent so it is now almost useless.  Trying to clean one more time but this is a stinker.  Save your money", "This humidifier put out great mist but anything is only as good as its weakest part. Upon placing the tank back on the seal broke, very flimsy cheap plastic and rendered the entire until useless. The second day. It's junk."], "reference": [6, 3, 3, 3, 2, 1, 1 , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [-0.10000000149011612, 0.20000000298023224, 0.699999988079071, -0.10000000149011612, 0.4000000059604645, 0.6000000238418579, 0.34999999962747097, 0.5, 0.8999999761581421, 0.5, 0.30000001192092896, 0.10000000149011612, 0.699999988079071, 0.30000001192092896, 0.6000000238418579, 0.699999988079071, 0.5]}