{"reviews": ["Overall it’s great. Super easy to refill compared to standard humidifiers. It’s quiet. The tank is huge so it lasts a while. When the water runs out a red light turns on and it stops. As long as you stick to distilled water it’s very easy to clean. Only downside is the cord is a little short.", "It does an excellent job humidifying my huge bedroom. I live in the northeast and it gets incredibly dry inside in the winter. Other humidifiers struggled to get and stay slightly above 20%, while this one easily humidifies to 35% and even above. The retro design is cool. The tank can be filled using a pitcher from above, without removing from the base, which is great. A minor point is that it's a little awkward to fill and carry the tank to and from the tap if you're not using a pitcher as there is no handle and the rounded edges make it a bit hard to hold. That said, I am really happy with this unit and recommend it highly.", "The mist is produced silently and without any annoying lights on the machine  (only one weak light to signal \"on.\")  I like the one-gallon tank for simplicity of refills.  But the machine allows for the production of lots of slime ..you'll need a small paint brush or something to get into the crevices to clean it out thoroughly.  Other than that, it's a pretty good device for its small size.", "I thought this was going to be a cheap humidifier but I was only half correct. It was cheap in price but not in quality!!! It’s so much easier to just take the top off and add water rather than having to remove the whole tank take it to the bathtub, fill it up. Don’t break anything. Dry it off. Take it back…. No. Just an easy lift and pour. It makes ZERO noise! Only downside is it doesn’t have a red light indicator to tell you water is out. You just have to check it daily. But having a bigger water tank means you won’t have to check as often depending on the output of humidity.", "A simple analog dial on the front of this smaller humidifier highlights its clean and simply design. The tank is the largest part of this, and it holds a lot of water for the footprint of the unit. Very quiet. I do recommend.", "I have been searching for a great humidifier. I've been through a few brands and they either don't work properly or actually break and stop working after a few days! It seems the digital ones are breaking down sooner. I love this humidifier for a few reasons. First off, it looks so cute and not \"medical\" looking - I love the size and color. But best of all, it's got an old-school knob that turns on and off. I love it! Quiet and large enough tank for all day and night. Just get it :)", "A great little humidifier! It pumps out quite a bit of mist, and the top fill is a game changer. It's so nice not t have to haul a whole tank to a bathtub or someplace with enough clearance to actually fill it. I just have a large pitcher that I use to fill, and do it in the mornings while I'm waiting for my coffee and it's usually not even empty. It's quiet, low profile, and I love the green color as well! I wish they made towers for plant use as well.", "I like This little dude. Its tank is big. It’s a no brained to operate. Cute color. Basically quite. So far, no complaints but I’ve only had it two days.", "I have purchased a few different types of humidifiers. They always work great, until they need to be cleaned. This humidifier is very easy to clean. You can easily access all areas the water gets to and can scrub away the buildup. I also really appreciate the size of the tank. It can run all day on low and won’t run out. The turn knob is easy to use to change the amount of flow as well!", "I’ve never seen such a stylish humidifier! The big tank is incredible and so easy to fill. Will be buying another!", "It has a huge tank, and is very quiet. Easy to use and setup.", "The Bear Humidifier is quiet, puts out a satisfactory amount of mist. The spout has a nice size opening and able to turn any direction with ease. Easy to set up. Simple power on, turn the knob.  Min-Max level.  No unnecessary buttons and apps. It has a low water indicator and nice appearance.  Easy to clean and fill.  Large tank.  The cord is a bit short. If it came in different colors I would have bought more.", "Love this thing! It has helped so much with mine and my daughters congestion. I like how it auto shuts off when the tank is empty so the motor doesn't burn up. I would suggest turning it off every once in a while and not running it constantly. Mine acted like it was going to stop working but I left it off while I was at work and turned it on when I came home and it worked perfectly fine."], "reference": [7 , 7 , 6 , 5 , 3 , 2 , 2, 2, 0, 0, 0, 0, 0], "score": [0.30000001192092896, 0.19999999925494194, 0.800000011920929, 0.20000000298023224, 0.10000000149011612, 0.5, 0.30000001192092896, 0.4000000059604645, 0.800000011920929, 0.8999999761581421, 0.4000000059604645, 0.10000000149011612, 0.6000000238418579]}