{"reviews": ["The first week or so it worked just fine - the scent of any essential oil you put on the pad tends to be too light to detect even if you add a lot, but that didn't particularly bother me. However after a short time, it will only work if I have it full to the top - if it's around 1/4 full or so, it stops producing the vapor. If I nudge it and move it around a little, it'll produce a bit more for a few moments then stop as if it's empty again. I tried taking it apart and cleaning it - the water here is very hard so I figured calcium buildup might've formed - but that hasn't helped and it still stops well before it's empty.", "This worked fine for a day. Second day turned it on left and came back an all the water had leaked out all over, huge mess. So I took it apart did the troubleshooting. Turned it back on, it worked fine. Turned it off, came back a couple hours later and all the water leaked out again. Piece of junk. My rug is soaked and will take a day or two to dry.", "Wanted to love this but it stopped working the 1st time it ran out of water. I refilled it and it never worked again. It will just stay on the red light indicating lack of water and nothing I do will make it work again. Waited a few months before opening too which is even more of a bummer it quit already.", "It works but this is the worst humidifier I have ever purchased. I have used it for 2 weeks and my bedroom is covered in white dust. I tried a protec in the water and did not help at all. I have dark furniture so I can see it visibly white.", "We have a wood burner and needed a humidifier to help our respiratory system stay moist.  This product does help.  My hubby also purchased a gauge to let us know the temp and humidity level in the room.  It has definitely been a help.  The amount of humidity can be knob controlled and the direction of the mist is also controllable.  Downside:  We use it 24/7 so it needs filled a lot.  The good part is that you can fill from the top and the lid is open enough that it is easy.  Another downside is the condensation inside the plastic unit that holds water gets so thick you can't see the water line level or the mark showing where to stop!  I would buy again though as it does help us!", "My last humidifier lasted less than a year.  No matter how much cleaning, it eventually started making an agonizing noise so I assume something wrong with the motor.  I returned to Amazon to locate a new humidifier and fell on this one pretty fast.  So far, so good.  Remove the styro from the inside and also take the plastic off another piece - used to protect in shipping - then all you do is add water and you're ready to go.  I don't know the distance covered but I put mine on max setting and this thing is so quiet it's like it's not in the room.  Small green light in the front to show it's active.  Filling with tap water (allowed) the item is well-balanced and easy to carry.  My last one was ergonomically disastrous so this one is a relief.  UPDATE:  In late 2023 the humidifier began leaking out of the bottom while I was refilling it with water.  This was after the weekly cleaning.  Another humidifier into the trash!  At this point I've decided none of these are worth the trouble.", "I bought other humidifiers and they hold a cup or two of water and you have to refill them every night. I'm lazy, I don't want to get in bed, only then to realize I didn't fill it up and have to get up again. This one is awesome, I fill it once a week (keeping it on a medium-medium/low setting). It is fairly quiet in comparison to every other one I've bought. Love it, highly recommend, also its gorgeous.", "I've only had this for a few months, just long enough to be outside the return window, and it already stopped working. It won't put out any vapor at all and insists that there isn't enough water when the tank is almost half full.", "Bought this with the big tank because I’m tired of my old one running out of water in a few hours. On the lowest setting this put out a lot of humidity and the large tank lasts for 3 days of constant use. Tank is super easy to fill from the top.", "Love this quiet, powerful Bear humidifier, but I don’t like the white dust it leaves behind. I use the filters and filtered water and still I have white dust everywhere!", "Works well but hard water settles in and starts to cause a light sound. We ended up not able to use it after water stained nearby mirror(we did get most of it off). Only raises humidity by a few percent at best in dry household. Holds 18 hr-30hr reserve.", "Worked great for a few months , suddenly today it's just stopped working. There's the red light even when it's fills with water, it refuses to start working. The manual I received was for a model of humidifier I didn't buy so I can't troubleshoot", "I purchased this humidifier for my plants and it worked really great at first. I liked that I didn’t have to fill it up too often and it looked really chic, but I don’t think it automatically shuts off because it ran out of water once and then started making a noise and eventually stopped working at all. I would clean it and keep it full but it still just stopped working.", "I have had many top loaders and this is by far the worst. Every time I remove the lid to refill the water, condensation spills everywhere. My nightstand now has water damage. Do your research before purchasing Anything.", "This product was great until it broke and started leaking water everywhere. I’ve had it for about 3 months and then it broke", "I cleaned mine at least one a week and it still broke. I always had issues with the mist wasn’t comming out or the water just leaks straight out of the bottom. My plants and frogs are upset lol!", "It has a nice shap but it leeks water all over.", "If I could return this product, I would. I was excited at first after reading all of the positive reviews. For the first month it was a decent product. After a couple of weeks it was a little leaky, then it started to leak pools of water nightly. I put a dish underneath to prevent the humidifier from destroying my shelving/floors. I clean it regularly so you can imagine my surprise when I went to remove it and the water was dirty and yellowed (as seen in the attached photo). I have no clue where this water was stored but it leaked from the bottom of the humidifier when I went to pick it up. I have not neglected this product in any way that would cause the water to be so dirty. It’s disgusting. Now that I am past the return date I will just have to throw it away.", "I bought two of these humidifiers 9 months ago and one stopped working a month ago. It leaks water into the base due to a poorly designed/manufactured valve.  I'm waiting to see how long the second unit continues to work before it bites the dust too. Do not waste your money until the unit is redesigned.", "Humidifier looks nice, but days after unboxing it stopped working. No essential oils used, only purified water. No troubleshooting or reaching out to the seller has helped."], "reference": [13 , 6, 4, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [-0.30000001192092896, -0.5000000149011612, -0.30000001192092896, -0.8999999761581421, -0.20000000298023224, -0.10000000149011612, -0.10000000149011612, -0.20000000298023224, -0.20000000298023224, -0.20000000298023224, -0.05000000074505806, -0.30000001192092896, -0.4000000059604645, -0.20000000298023224, -0.5, -0.30000001192092896, -0.30000001192092896, -0.20000000298023224, -0.699999988079071, -0.20000000298023224]}