{"reviews": ["I loved this when I first bought it - it worked as advertised, and was great! However, I have hand-washed it a few a times (as directed). I washed it two days ago, as I have been, and the tank now leaks out of the sides. I contacted Amazon to return it, and because it's outside of the 30-day window, I am unable to return it or get a refund. So, now it's sitting in my garbage can. I'll be buying something cheaper next time, that way when it breaks it's not a huge loss.", "I've only had this for a few months, just long enough to be outside the return window, and it already stopped working. It won't put out any vapor at all and insists that there isn't enough water when the tank is almost half full.", "Bought this with the big tank because I’m tired of my old one running out of water in a few hours. On the lowest setting this put out a lot of humidity and the large tank lasts for 3 days of constant use. Tank is super easy to fill from the top.", "Worked perfectly until eventually it started throwing less and less mist, now it doesn’t work at all, tank is full and the empty light is on. Great product for little time", "Size was good and it worked great. I only used it in winter months and cleaned and dried it before storing. Brought it out again in November and worked until recently. I’m not sure what is broken, but now there are tiny drips from the seam where the tank and the bottom meet. Nothing seems cracked or loose, but I cannot figure out why there is a major puddle after a few hours. I’m disappointed since it is less than a 1 year old and wasn’t used frequently.", "This humidifier put out great mist but anything is only as good as its weakest part. Upon placing the tank back on the seal broke, very flimsy cheap plastic and rendered the entire until useless. The second day. It's junk.", "Have ordered this twice and both units stopped working and/or the tank cracked in less than a year … the newest one the tank cracked the next day. Would not recommend."], "reference": [5, 0, 0, 0, 0, 0, 0], "score": [-0.4000000059604645, -0.10000000149011612, -0.20000000298023224, -0.5, -0.30000001192092896, -0.5, -0.45000000298023224]}