{"reviews": ["The frutiger aero style seemingly lives on through humidifiers on Amazon, and this one is a shining example. Love the color tones and accented physical knob, and this thing BILLOWS refreshing humidity in a very fine vapor. Plants and I are loving it!", "I have been searching for a great humidifier. I've been through a few brands and they either don't work properly or actually break and stop working after a few days! It seems the digital ones are breaking down sooner. I love this humidifier for a few reasons. First off, it looks so cute and not \"medical\" looking - I love the size and color. But best of all, it's got an old-school knob that turns on and off. I love it! Quiet and large enough tank for all day and night. Just get it :)", "This humidifier is perfect for a large room. It has quite the output. In fact, I had to turn it off after few hours. I really like the teal color and smoky gray top, doesn’t make it look like a humidifier. It’s easy to fill from the top (and clean), the directional spout easy to turn. Does the job, it’s quiet, perfect for our living area to avoid those dry winter days and keep stuffy noses comfortable. I also like the turn off & on knob, easy to control output. Holds a lot of water to run for hours. Glad I chose this one.", "I have purchased a few different types of humidifiers. They always work great, until they need to be cleaned. This humidifier is very easy to clean. You can easily access all areas the water gets to and can scrub away the buildup. I also really appreciate the size of the tank. It can run all day on low and won’t run out. The turn knob is easy to use to change the amount of flow as well!", "I loved the looks of this humidifier and had read some good reviews so I decided to order it despite that it would take several weeks to receive. I received it today, and what a disappointment. It arrived in a UPS box about 4 times too big for the product. The product did not come in its own packaging or with directions. It was wrapped in torn paper and plastic and it was dirty. It also had obviously bounced around a lot in the big box and the humidifier's plastic was cracked and broken. Looked like it was just pulled out of the dump. I contacted the seller and they really apologized for the mix-up, they explained I had accidentally been shipped a return by Amazon. I was confused and not sure that was correct as it hadn't been received in an Amazon box, but UPS, and also,  even if so, the lack of packing material would have broken up even a new one. Update: They apologized and offered to replace the humidifier for free. By the time all this transpired, I had already bought a different brand of humidifier. I kept the new Bear one that they did send to me. It was received in its correct packaging with directions and in perfect condition. It is very standard but works fine and I use it for my plants. It is very pretty with the teal coloring and gold on the knob. I did have to follow up and request my refund because that was not automatically applied. Overall it is a simple small humidifier that seems to work well, its best feature to me I guess is that it is pretty. Customer service was responsive and cared about the problem and did resolve the issue.", "The Bear Humidifier is quiet, puts out a satisfactory amount of mist. The spout has a nice size opening and able to turn any direction with ease. Easy to set up. Simple power on, turn the knob.  Min-Max level.  No unnecessary buttons and apps. It has a low water indicator and nice appearance.  Easy to clean and fill.  Large tank.  The cord is a bit short. If it came in different colors I would have bought more."], "reference": [7, 2, 1, 0, 0,0], "score": [0.800000011920929, 0.5, 0.8999999761581421, 0.800000011920929, 0.5, 0.20000000298023224]}