{"reviews": ["I had high hopes for these being JBL and something new that just came out. But they have the same tired scooped midrange sound, but odd with these buds because they make the high mids sound honky and annoying, with the hyped bass and tinny highs. I even tried using the EQ in the app to get them to sound as close to my pair of Sennheiser studio pro over ear headphones I use for tracking and mixing. That didn't work. Plus, the left bud kept randomly falling out of my ear. Like I stated to say the least... Disappointed.", "Uh i can still hear everything around me just the same. I dont really get the differences between the modes available on the app, they all kindof sound the same.  None of the nib sizes fit my ear. The lil buggers fall out pretty often. and the touch surface is way too sensitive, any little bumps pause the music or turn up the volume", "I primarily use these for conference calls and listening to music while doing chores. Pairing is straight forward and it does well with changing device connections. Sound quality is fine, but sometime audio doesn't sync between each earbud. Mic is good as no one has ever mentioned my audio quality being bad. Overall, it is a decent pair of ear buds.<br /><br />My biggest frustration is the battery charging. I would not classify myself as a heavy user, maybe about 6 hours a day in total between conference calls and music. I keep them in their case and on my desk in between uses and each time I take them out it looks like they did not charge at all. Especially in the morning. The only time they actually charge is when I have the charging cable plugged in.<br /><br />I wouldn't recommend them.", "I rarely leave bad reviews but I had to say something because of the overall deception of higher price, higher quality.  The noise cancelation works, but only to a certain degree but the most disappointment comes from the terrible sound quality.  I've had better quality from $30 ear buds.  And second, these buds don't set comfortably within the ear.  No matter what size rubber grommet fitting I chase from [and even switching ears] they never seemed to stay in.  And a close runner up...was the wind noise..  if you are you using this to bike, run, exercise,  or even work outside,  consider these useless .", "When wearing these I need to constantly push them back in my ear. The sound is great if you jam them in your ear but the material or design make it so they never stay in for more than 10 mins without adjusting. Almost returned them first day when the sound was basically a whisper as I'm not used to putting earbuds that far into my ear. I don't know if it's the general design of the earbuds or the material but these sort of fail the basics of being an earbud which is simply \"goes in you ear, stays in your ear\". They come with three sizes and the big one is too big, the middle one wouldn't fit and small keeps falling out lol. Gonna return these and seek another brand.", "I was very pleased with these earbuds at first, great sound, and excellent noise canceling for the price.  Flash forward to 3 months later the sound quality in the right ear stopped working.  I have tried to clean, tried to reset everything but still have the same thing happen.  The weird thing is that at first, it starts ok then progresses back to quiet.  In the end, I should have gone with something more pricey that may have better quality.  I may try one more thing if it works I will remove the review, until then consider this my full review.<br />*Update*<br />Was able to bring it back by soaking the tip of the earbud (without the cover) in alcohol for about 20 min, blowing into it directly after,  and letting it dry fully.  Don't dip the whole thing though. after 24 hours of letting it sit it was perfectly fine.", "I couldn't return them because I threw away the box, but they are hell, they don't last 2 minutes in the ear.", "Love the way they sound, the bass is very punch and pronounced. The talk through function also works very well. Unfortunately everything else that makes a good pair of earbuds falls short. The earbuds just wont stay in. I get everyone has different sized ear canals but you will see other reviews about them falling out. I have to constantly readjust them. The normal sized silicone cup is too small (wont seal so no bass and bad noise canceling) but the large cup is too big so wont seat in ear correctly. The active noise canceling is very minimal can hardly tell its on, and last the case is not all that great. The lid is very flimsy feels like it could break easy. I would definitely return them if I could, but through out the packaging. Might end up gifting them to someone who can maybe get a more comfortable fit. At the end I cant recommend them.", "I am satisfied with my purchase. Only thing is that it doesn't fit in my ear. It's kinda loose but somehow manage to stay put. Noise cancellation works very well.", "These are great but they do not stay in your ear very well at all. Good if you just sitting and doing nothing but if you running, just doing casual things, or anything with moving expect them to fall out.", "Not for me because the earbuds keep coming out of my ear no matter which eartips i use. Decent sound quality though.", "These earbuds actually amplify noise instead of cancelling it out. They don't stay in my ear, and are very uncomfortable. The noise quality is okay, but worse than $30 buds I got at Walmart. I don't think I've ever hated a product before, but I really hate these. And the fact they have the audacity to charge $50 (and that's half off!) for these garbage buds..", "Sound quality and battery life is good.<br /><br />I really like that I can use noise dampening option to cut out noise.<br /><br />Good deal for $50.<br /><br />So far I've been very pleased with these. Only issue I've had is they tend to fall off my ear. I've tried multiple sizes but still have this issue.<br /><br />I only use them at work or home where I can be stationary so that I dont lose one from falling out.<br /><br />I'm not sure how people go running or hiking with these? Maybe I need a headband to go over them?", "I tried these because they were noise-cancelling and on sale and I’ve always loved JBL. The sound was fine but no matter what I did, they fell out of my ear. I tried all three sizes and even had a friend help me place them in my ear to no avail. If I had them in and started chewing or Bent down, they would fall right out.<br />I believe this is because of the design. They seem top heavy.<br />The other thing is the options are limited as far as controls. You had an either or choice for audio. Also, if I had more than one app open, my play/pause would not work.<br />I finally decided on another much less expensive brand and got MUCH more for my buck and they STAY comfortably IN my ear and have all the controls I need.<br />I’ve bought JBL in the past and love my speakers but these were a big let down. I do not recommend.", "I have tried way too many types of Bluetooth headphones. Either the dog eats the case or they go through the wash or I'm just too rough on my things. In any case I have tried many bargain types of this style headphones. I decided to try a more trusted brand and spend a little more. These are absolutely the worst headphones I have ever worn. I honestly can't tell which headphone goes to each ear, they are so uncomfortable in any position.", "These earbuds don't sound as good as a cheaper model being sibilant, fall easily off the ear, and unreliable buttons.", "Ear pieces don't fit well they fall out I have tried all three sizes none stay in my ear well, and the sound quality is ok, but there is a lag between video and sound. everytime I put it in my ear it automatically goes to transparency mode  so I have to go into app to turn it off", "The base and audio was good while it lasted. Disappointed they already broke. When you put it in your ear it is super super muffled and like audio is barely playing, like it got water damage or something but it has never dropped or been in water?? Not worth the money I should’ve believed the bad reviews I saw.", "Like the product, just keeps falling out of my ear. Not sure what to do about it.", "All 3 pairs of Buds won’t stay in my ear making it uncomfortable and constantly having to push them back in my ear before they fall out. I’m really contemplating on returning them, and just getting legit AirPods", "Won't stay comfortably in my ear, even with different options included. Quality sub par vs bose", "Sound quality is passable for the price, but the design is extremely non-ergonomic. It's as though they are always actively trying to fall out of my ear at the gym, on a bike, even just sitting down. I've tried every different size earpiece and it is always the same", "TLDR; bad sound, bad ear fit, bad charge.<br /><br />I bought these at Target, and they’ve been one of the worst headsets yet. They don’t stay in my ears very well. They don’t noise cancellation very well, they don’t produce much sound, and worst of all when I pull them out of the case they’re almost always dead for some reason.<br /><br />These also come with an app to operate the headphones and adjust sound levels but that’s pointless because I had to change the levels to max settings in order to hear anything normally.<br /><br />They do have some tap options that let you switch from music to hear voices it was kinda nice.<br /><br />But overall these are bad design and bad sound. I can not recommend these and advise looking else where. Which is weird since JBL usually has excellent products. I have nothing against JBL I bought the Charge 5 and that’s a great portable jukebox.", "Doesnt fit to ear", "does not stay in my ear even after I tried different sizes", "No matter how many times I change the tips, they don't fit in my ear. The volume on them is also very low and the buttons are super sensitive. Too sensitive.", "I highly recommend against these. I tried all sizes provided with the earbuds and they all fall out of my ear. Not a well designed product.", "So many frustrating things with these:<br />- The size: they're larger than you think; if you have smaller ears, they're going to be a tough fit.<br />- The 'Touch Control' is the entire face of the unit; you're not going to get them in your ear without changing the settings.<br />- The settings; why is Sound Mode the 'Default', and not Volume?<br />- Reception; the range is fine if your phone is in your pocket all the time, but they drop off quickly.<br /><br />A $25 set of JLAB IEM will be a better investment; in fact, you'll be able to buy several sets and still be ahead financially.<br /><br />UPDATE: After the (estimated) 4,964th time I changed the sound settings while putting them in, I unpaired them, tossed them in a drawer, and bought a set with a more rational control scheme.", "The audio quality is very good especially for the price. They are also durable and have great battery life. However it has happened to me multiple times where the earbud will get stuck in your ear. It is not a well-designed product.", "These do not seat in the ear and stay, fall out with little movement. Will be returning", "He doesn't have a good voice , Not comfortable to use, falls out of the ear, It is not comfortable to use, it falls out of the ear if you only use it while driving.", "So,when I first got it it was pretty loud. It seemed to lose it's sound after a while. Anytime I lost my headphone/s I just had to turn the volume all the way up and find. But unfortunately I lost the box and had to get me a different pair of headphones.<br />The fitting in your ear comes out pretty easily and doesn't stay in. If you touch it barley on accident it screws up your music and skips your favorite songs or whatever. But that might of just been the packing I got. Don't know. It's just work the $50 you spend for it. just not more then that.", "Very poor audio quality.  Low fidelity, poor bass response, volume unacceptably low, uncomfortable and won’t stay in my ear.  Total junk in my opinion.  Don’t buy.", "I’ve tried many options, including after market foam ear tips, but these buds do not stay in the ear.", "Pretty good waste of money these headphones are. Won't stay in my ear worth a dang. I've tried all the ear bud sizes and I always use medium.  Consistently sliding out, the big is way to big. or if I'm eating they just plop out"], "reference": [20, 15, 10, 5, 3, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [-0.30000001192092896, -0.30000001192092896, -0.20000000298023224, -0.5, -0.09986282727682377, -0.20000000298023224, -0.5, -0.30000001192092896, -0.10000000149011612, -0.10000000149011612, -0.10000000149011612, -0.5, -0.4000000059604645, -0.20000000298023224, -0.30000001192092896, -0.4000000059604645, -0.20000000298023224, -0.10000000149011612, -0.20000000298023224, -0.6000000238418579, -0.4000000059604645, -0.10000000149011612, -0.5, -0.20000000298023224, -0.5, -0.30000001192092896, -0.20000000298023224, -0.10000000149011612, -0.20000000298023224, -0.30000001192092896, -0.4015625058673322, -0.10000000149011612, -0.699999988079071, -0.10000000149011612, -0.5]}