{"reviews": ["I bought these to help filter out noise at the office generally for music listening. I will split the review into three section: Noise Cancelling, Sound Quality, and Other.<br /><br />Noise Cancelling:<br />They will work for some people but not all. At the home office they work great, they filter out the frequency of noise produced by computer fans. However, I don't believe the noise cancelling is all that adaptive, rather it is just filtering a fixed number of frequencies. For example, the higher frequency noise from my air purifier is still noticeable, but dampened. This seems to be the case with all noise. I would expect their algorithm is doing something like filtering out the average frequencies in the average environment so overall you do indeed get a quieter listening experience.  ̶I̶ ̶f̶i̶n̶d̶ ̶t̶h̶e̶ ̶\"̶A̶m̶b̶i̶e̶n̶t̶ ̶A̶w̶a̶r̶e̶\"̶ ̶s̶e̶t̶t̶i̶n̶g̶ ̶t̶o̶ ̶b̶e̶ ̶t̶h̶e̶ ̶q̶u̶i̶e̶t̶e̶s̶t̶.̶  (UPDATE: Meant to say ANC (duh) slightly confusing what mode I was in based off of the quick start manual. Ambient would be if you wanted to hear more than if the ANC was just off.) For the price this is very acceptable. The more adaptable, on the fly noise cancelling algorithms are extremely difficult to implement, and hence you pay a premium for them. Overall, I would compare these to a really good pair of foam tip IEMs in terms of noise cancellation. These will definitely not provide any hearing protection for things like shooting, loud shop work, etc... so keep that in mind and use your head.<br /><br />Sound Quality:<br />These are definitely a \"consumer  grade\" listening experience, which for most people won't be a bad thing. For the price I am indifferent. I would say the bass is higher than normal with more muted/muddy treble. This isn't necessarily a bad thing and I would say most people would find them \"good\".  For what they cost, the sound exactly like what I would expect, better than a 20 dollar pair of headphones and not as good as a $150 dollar pair of IEMs, but your mileage may vary. For comparison with a competitor, I have some Sony wf-c500 wireless earbuds (no ANC) and these sound roughly the same, maybe slightly less clear treble and bass. I would still pick these over the Sony's because these have more features for the price and for other reasons I will list below.<br /><br />Other:<br /><br />Battery -- I think the battery life specs are roughly accurate, I get a full day on them, but haven't really pushed them to the 40 hours though. Battery life seems great, the case seems to get you maybe 2 charges. The case is nothing special, I wish the hinge had more tension in it like the Sony's so it felt more premium, I can kind of wiggle it a little bit but definitely not a deal breaker. I have yet to run them to the point where they alert you if they are low just once or they keep doing it. If they keep doing it I will update and remove a star because I don't quite understand why you would annoy the user with a message consistently for the last X% of battery (original rating is 4 stars).<br /><br />Size and Eartips -- these are rather large, but acceptable given the price and feature set.  They don't fit in the ear as well as the Sony ones do but they don't seem to fall out either. The Sony design fits into the ear better and \"hugs\" it so to speak, they seal better as well. I do really wish these came with a set of foam tips, they would actually compete in a different price bracket for that much, mainly because of the noise reduction. They would also help the fit. The included silicon ear tips are like the cheapest on the market, not as supple as more premium earbuds. There's nothing inherently wrong with them but they may rip after a while. I think if JBL addressed the fit (decrease the depth of the \"body\" in the ear so they seal better since there would be  less weight pulling down on the eartip) and eartips they'd have an extremely solid 50 dollar pair of earbuds.<br /><br />Controls -  ̶U̶n̶l̶e̶s̶s̶ ̶I̶'̶m̶ ̶m̶i̶s̶s̶i̶n̶g̶ ̶i̶t̶,̶ ̶I̶ ̶d̶i̶s̶l̶i̶k̶e̶ ̶t̶h̶e̶ ̶c̶o̶n̶t̶r̶o̶l̶s̶ ̶d̶o̶ ̶n̶o̶t̶ ̶h̶a̶v̶e̶ ̶v̶o̶l̶u̶m̶e̶ ̶a̶d̶j̶u̶s̶t̶m̶e̶n̶t̶,̶ ̶m̶a̶s̶s̶i̶v̶e̶ ̶m̶i̶s̶p̶l̶a̶y̶ ̶f̶r̶o̶m̶ ̶J̶B̶L̶,̶ ̶l̶o̶o̶s̶e̶ ̶a̶ ̶s̶t̶a̶r̶ ̶f̶o̶r̶ ̶t̶h̶i̶s̶.̶ ̶I̶ ̶d̶o̶ ̶n̶o̶t̶ ̶w̶a̶n̶t̶ ̶t̶o̶ ̶h̶a̶v̶e̶ ̶t̶o̶ ̶i̶n̶v̶o̶k̶e̶ ̶a̶n̶ ̶a̶s̶s̶i̶s̶t̶a̶n̶t̶ ̶t̶o̶ ̶r̶a̶i̶s̶e̶ ̶t̶h̶e̶ ̶v̶o̶l̶u̶m̶e̶.̶ ̶T̶h̶e̶ ̶S̶o̶n̶y̶ ̶e̶a̶r̶b̶u̶d̶s̶ ̶d̶o̶ ̶h̶a̶v̶e̶ ̶v̶o̶l̶u̶m̶e̶;̶ ̶h̶o̶w̶e̶v̶e̶r̶,̶ ̶  (UPDATE: Volume controls can be added through the app as a functionality; however, you loose the ability to change noise modes. I'm still rating 4 stars because I want both, would put 4.5 but can't. I don't see why both sides need a long press for google assistant or siri, one of these long presses could change the noise mode.) I would still pick the JBL buds because the volume steps are more gradual. I can get these to a comfortable level where with the Sony ones it always either a little too loud or a little too quiet. Other than volume I love that the controls are capacitive. Sony opted for actual push buttons in theirs which makes them unusable when laying on your side or for example working on your car, as you constantly bumping/pushing the buttons inadvertently in both cases -- so big win for the JBLs.<br /><br />Overall, a quality earbud for the price but improvements could be made, not sure you can find a more feature rich earbud for this price.", "I actually like these headphones. The lost star is for the fact that they do not really sound that great without the jbl headphone app. Once I popped that on even just using the default eqs, 90% of my complaints evaporated.<br /><br />I've seen people compare these to skullcandy, I'll do the same since my last pair were skullcandy anyway.<br />While the skullcandy delivered solid bass it did so while stomping on mids pretty badly. These do not suffer that issue. While it can be said the bass is louder on the skullcandy set. These are offering a much clearer and well rounded bass without utterly destroying the mid range, and though quiet out of the box the installation of the app brings them to the same volume the skullcandy pushed if not a little louder.<br /><br />Fitting them to your ear can also be a bit of trial and error. I'm actually using a different sized cup on each ear to get the best results for myself.<br /><br />Biggest thing is the app though, it really was a night and day difference. The default club eq seems to work for most genre's or you can of course create your own if you want to get picky.<br /><br />Once the fit and app are out of the way, these are not bad at all. I suppose it bears mentioning that the advertised quick charge feature actually appears to work with these. (this is something that on skullcandy's side seemed like a point blank lie)<br /><br />The touch sensor may be a bit on the sensitive side, but that's been true of the last 4 or so of these I've owned.<br /><br />This review may sound a bit critical but I'm legitimately enjoying them, largely wondering why the default profile for them sounds so bad though. The app immediately clears that up fortunately.", "Great but keeps falling out my ear. It comes with 3 different sizes for the silicon pieces that go in your ear so that's great! My ears are really small so I think that plays a big part as to why they keep falling out. I still like them but can only use them when I'm sitting still. Great buy.", "First off get the app, without the app they are mediocre earbuds, with mediocre sound but with the app you can customize these things too your heart content down too what button presses do what on the earphones, noise canceling works great, batterys last at least 6-8 hours depending on volume, when you tune the equalizer they'll bump like some 12 inch subs in your ear, all around great ear buds for price point", "The sound quality was trash. Clean at very low volume but no volume at all! Trash!! They have great conceptual technology however when in your ear in real life they will not stay in, sound good, or properly function. Soooo what are we selling here? I’m not sold. In fact I returned mine and put my 10 year old Bose headphones in my ear that still kick these headphones butt in every measurable way!", "Great Great sound, depth, stereo separation. Somehow these stay in your ear while your blasting out some great  80s 90s alternative.  They go very loud, and the phone app is really awesome with many different equalizers you can set. Probably the Samsung expensive buds are not much better.  Excellent deep bass, great highs.", "My daughter is loving these earbuds. She's 9 years old they fit her ear very well.  The sound quality is great but not the best compared to the more premium earbuds in the market.  The only issue is that they can be laggy at times. They disconnect and won't connect automatically.  You have to go Bluetooth setting to connect again.  Other than that they are great.", "My daughter has a set of JBL's and likes them. I've tried them out and did  too so I ordered these for Christmas. Early self-gifting! Ho ho ho! They're my first pair of ear buds.<br /><br />The Good Stuff - they were easy to set up, I can use them with my phone and flat screen, as well as my laptop. The sound is great and they're fairly easy to pair. Once paired they connect to my iPhone as soon as I take them out of the case so use is easy and relatively trouble free. The case is simple to charge them in and the case is simple to charge up. I've had these for almost 2 weeks, and charged once so far, but they didn't need it, I just did it. There appears to be plenty of juice for how I expect to use them.<br /><br />The Pretty Good Stuff - they're not small but they do fit well in my ear. I might prefer a smaller device in the future but for my first set these are great and I won't change out till and when and if these stop working or I lose them, which I hope isn't any time soon so - they may be it for me, which is fine.<br /><br />The Learning Curve Stuff - the touch sensitive controls are okay for me, but I'm still getting comfortable with what does what when. I can always use my phone to pickup, adjust volume, etc. I'm probably another couple weeks out from being at ease using them. Others may not have any problem.<br /><br />I give them 5 stars because they appear to be exactly what they advertised and do what I wanted them to do. For the price they're a great value, for me.", "These straight up suck. They are great if you can get them to stay in your ear, but here’s the neat part they won’t! They will wiggle free and fall out at the slightest movement no matter what rubber ear piece you put on. Then when you readjust them every 10 seconds they will shut off or pause because you’ve activated the touch control! I guess if you are sitting perfectly still looking straight ahead and not moving they might work for you. If you plan on moving at all get ready for them to fall out randomly then pause whatever you’re listening to as you readjust them over and over and over. I’ve gone back to using my wired headphones at this point because I wanted to wear them in situations that I am moving and doing things. And before you make the assumption that I’m doing extreme sports or something, I am literally wearing these while moving a stick up and down in a fashion similar to a plunger. Which is ironic because they belong in the toilet after falling out for the 20th time in the last hour and a half. Straight trash product for what 99% of people will want to use them for.", "Was skeptical of ear buds, but they do not fall out. The ear oadding comes in 3 different sizes. The size that fis my ear was nice and snug. I was surprised at the quality of the sound. Has significant noise cancellation as well. I have a JBL soundbar/surround sound & the sound is exceptional.  JBL makes very good sound quality items.", "They play long at all a few hours is about it also kinda big in the ear but noise canceling is surprisingly good as well as the microphone", "Doesn’t fit at all. Constantly falling out of my ear. Decent sound but need constant adjustments in the ear in order to get any decent audio. Do not recommend buying these! Stick to any other brand that has decent audio quality and can actually stay in your ear for more than 5 seconds.", "I have the jbl speaker so which is great, so I went with these earbuds. Easy to connect, comfortable, good fit in my ear. The sound very is good quality.", "None of the silicone plugs really fit my ear very well and the design seems a little heavy for good fitment. When I lean forward and down will I'm Workin they get loose or fall out. They are not very loud either. I mostly listen to talk radio and sometimes it's hard to hear everything but I do work in a somewhat noisy environment. If your just working at your desk they would probably be fine.", "Honestly...I've been using old style around the neck BT headphones. But these were a gift, one that I was skeptical about even using much less liking them. Well let me tell you, I LOVE THESE THINGS!! From great music and call quality to ease of use and features - a solid win!! These actually stay IN my ear EASILY and my ear lobes are smaller than average so that's a plus! The only con I can think of may be the noise cancelation could be better possibly? Idk I hardly ever use both at the same time so it's irrelevant for my use. Im extremely pleased!", "Both ear pieces do not fit well, each fall out with out much movement. Sound is great and battery last 8 or so hours but I can’t keep them in my ear😖", "Worth buying!!<br />Sound quality is good and they fit nicely in the ear", "No complaints about the sound quality, however the design causes the buds to easily fall out from your ear. As long as you are wearing indoors, no problem.  If using on the go, be careful!", "When they’re in my ear they sound great! But they are always falling off so I keep having to readjust", "I’ll start by saying these work perfectly fine. They are just well clunky and unimpressive. I have lots of ear buds and keep them all over the house and work. I have everything from $20 ones to $200 AirPods. I’ll start by saying the build quality feels on point for a device in this price range. They don’t feel cheap. They don’t feel like a tank. My biggest grip is their odd shape. They don’t fit in your ear very well. They don’t fit in the case extremely well. They aren’t very loud so don’t get these for a plane. They have almost no base. Operation is clunky.<br /><br />Overall they work it’s just you can find $20 earbuds that fit better in your ear and sound just as good.<br /><br />Edit: had these two months and adjust my rating down to one star. They just cut out randomly while using them. Sound goes away for about 5 seconds and comes back. Not worth $5 let alone $40.", "For the cost, they work well. Noise canceling is not its strong point. Sits in the ear ok. I’ll probably upgrade at some point.", "These headphones eliminates most noise. I am extremely satisfied I drive tractors without cabs and it drowns out in noise cancellation mode just a faint noise but music quality is pristine. I would recommend these they stay in your ear decently if you are going to jog with them they might fall if  not snug in your ear. Also battery life is outstanding.", "The quality is great, sound is good too, but it falls very easily from the ear, and it gets annoying all the time since it will not stick in place, and you just want to stomp it out of frustration. It has a great battery life for what it is worth, WAY easier to use compared to the ones I bought from earfun. You can also program some stuff through an app, I would still recommend these even if it gets frustrating when they keep falling off", "I use these because I like to listen to podcasts at work and also because my phone speakers aren’t the best. I liked them a lot until the right ear blew out on me they arrived in April and it is now June 28th. Sooo yeah that kinda sucks"], "reference": [118, 37, 5, 5, 4, 4, 4, 3, 2, 2, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.10000000149011612, 0.0031250000465661287, 0.13330078323633643, 0.20000000298023224, 0.3953125058906153, 0.10000000149011612, 0.20000000298023224, 0.3062500115483999, 0.10000000149011612, 0.3937500058673322, 0.5, 0.24883403033222518, 0.800000011920929, 0.4000000059604645, 0.5, 0.20000000298023224, 0.699999988079071, 0.20000000298023224, 0.30000001192092896, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.30000001192092896, 0.10000000149011612]}