{"reviews": ["First of all, DOWNLOAD THE APP if your sound isn't to your liking! The app has an adjustable EQ and other important features like noise canceling and ambient sound adjustment. I use the largest ear pieces provided for a secure and tight fit, which enhances bass response. My only complaint is that I wish they were LOUDER! I mean, they're ok, but one more level would be best for me personally bc when I jam my music, I JAM my music!<br />My music preferences are classic rock, new rock, melodic rock, and 80s stuff (both rock and new wave)<br />Overall, they're not \"amazing\", but they're really good. Can't go wrong with a name like JBL<br />(For the reviewers who say they lack bass response, try tighter fitting ear pieces. You MUST have a tight fit to enhance bass!)<br /><br />EDIT: Just discovering these buds DO NOT have a touch volume control which kind of sucks! Volume is ONLY controlled via the device. I wish I had known that. I may return them due to this", "The bass is very low for jbl which is odd. I've had cheap Skullcandy that did more, but after using the app to put the bass EQ on it was a little better, I aslo use \"Poweramp\" as a music player which gives me another EQ that's way better but yeah. The treble and mids are perfect though. Very clear, crisp audio all around. I've honestly gotta say these were worth the 50$ while on sale. I would definitely recommend but again the bass isn't what I was expecting. Out of the box it's almost not even there but I've managed to tweak mine to give me enough. The treb/mid definitely make up for it though. 4 out 5 *", "I like JBL as a brand, and they do get it right most of the time with their products. In terms of earbuds, I have the Tune 115 and these buds have proven to be a solid product. The Tune 115 has survived some series of falls and water submerging without even having an IPX rating. I have seen the 130NC  on sale and had to pull the trigger. IMHO The 130s buds are a great value for sure. Pretty good noise canceling with a solid bass presence. Understandably, they are not as loud and bass saturated as my Sony WF-XB700(which has bigger-sized buds). However, these JBLs have other features such as ambiance mode, good touch controls( and I am someone who prefers button controls), and of course: a decent ANC.  The sound is clear and well-balanced, as expected from JBL. I like the app a lot btw..very easy to control and customize an EQ. The fit is so-so sometimes, but that could be solved with non-JBL ear tips. The supplied ear tips are good, but the size jumps a little between the small and the large tips... This minor issue does not warrant a one-star fewer IMHO-Especially for the sale price. You get SO MUCH more than what you pay for..", "Personally, I haven't used any high end earbuds but these JBL earbuds are great! Especially for the price (I purchased on sale for $50.) The sound quality is good. The app allows you to change from 3 different modes (noise cancelling, ambient aware and talk through.) All of the settings work well in my opinion. You can also change EQ settings and even create your own custom EQ. The battery life is super solid. I'd say I get 3-4 hours on a full charge, and the case provides about 3-4 charges. I'm very impressed with these earbuds and I am happy with my purchase."], "reference": [24, 2, 0, 0], "score": [0.30000001192092896, 0.10000000149011612, 0.800000011920929, 0.10000000149011612]}