{"reviews": ["First of all, DOWNLOAD THE APP if your sound isn't to your liking! The app has an adjustable EQ and other important features like noise canceling and ambient sound adjustment. I use the largest ear pieces provided for a secure and tight fit, which enhances bass response. My only complaint is that I wish they were LOUDER! I mean, they're ok, but one more level would be best for me personally bc when I jam my music, I JAM my music!<br />My music preferences are classic rock, new rock, melodic rock, and 80s stuff (both rock and new wave)<br />Overall, they're not \"amazing\", but they're really good. Can't go wrong with a name like JBL<br />(For the reviewers who say they lack bass response, try tighter fitting ear pieces. You MUST have a tight fit to enhance bass!)<br /><br />EDIT: Just discovering these buds DO NOT have a touch volume control which kind of sucks! Volume is ONLY controlled via the device. I wish I had known that. I may return them due to this", "Very disappointed with this product. There are several things that need to be fixed for this to be a good product, especially at $59+.<br /><br />I bought this to replace my Taotronics sound elite 71. I was seeking for active noise-cancelling feature as I use them for my gym workouts.<br /><br />1. Compared to the Taotronics, with the JBL I had to almost crank all the way up the volume to get the same audio level (I did a side by side comparison). The factory EQ is crap. I had to download JBL's app to set the EQ right. Once you tune the EQ the lows are good.<br /><br />2. Bluetooth: Very sensitive to interference. Even placing my hand behind my head would cause signal dropouts. Not to say the random drops.<br /><br />3. Fit: I don't know if it was my ears' shape or what, but the fit was very uncomfortable. I had a hard time figuring out the right tips size and earbud position to create a good seal. I even switched to the tips I use with my taotronics (which fit fantastic) and I wasn't 100% satisfied. I had to constantly fix the earbuds position, which lead to toggle the ANC on and off feature, or by pausing the music which was very annoying.  And speaking about ANC, it is just useless. I saw no difference between toggling it on and off. In fact, I could hear the noise louder with the ANC on.<br /><br />4. Battery life: probably the only thing that I can't complain about. Although I couldn't complete my test for battery duration (see next point)<br /><br />5. Finally, after 10 days of using these earbuds for 1 hour(ish) each day, the left earbud kind of died. Seems like the lows and miss stopped working. I paired them to my laptop to see if it was some sort of connection issue with my phone, but the problem persisted. Did factory reset and didn't solve the problem. So now I have a $59 completely useless pair of earbuds lying around.<br /><br />Conclusion: If you are looking for ANC earbuds, look somewhere else and don't waste your time and money with these.", "[[VIDEOID:2408657ce3318ed7e7be349742c9ff8]] Pros<br />Nice charging case<br />Noise canceling ok<br />Sound is ok also but could of been better for JBL brand<br /><br />Cons<br />Sounds bad on calls<br />The fit is discomforting<br />Not connecting to the phone during answer a call<br />Not what I expected for the money<br /><br />I will be returning them, they hurt my ears hard to fit my ears, to big of an fit won’t stay securely in my ears.<br /><br />Thanks for reading", "The sound quality is great. Just not a good fit for me. They tent to pop out for no reason. Tried all the bud sizes and couldn’t make them stay put.", "First off sound quality is great and I like the battery life.  Some people say they are to quiet but I think they are great.  Just make sure you don’t have a db limit setup in your phone settings.<br /><br />The fit isn’t great, no matter what earpiece I use I can’t get a good fit.  This is disappointing as the left headphone keeps falling out.<br /><br />And the ANR doesn’t seam to work at all.  I can’t hear any difference between it in or off.  The ambient noise feature and talk through features work just fine.", "Good price if the noise canceling worked.<br /><br />Pros: good sound quality and battery life.<br /><br />Cons: noise canceling is practically useless. Just sounds like a little white noise layered on top of everything else.  Doesn’t actually block any noise - foam safety ear plugs work better than these.  Also the fit is terrible - they fall out of my ears all the time, regardless of what plug set I use.<br /><br />Would not buy these again or recommend to anyone.  Much better earbuds available at a lower price - granted those won’t have NC, but these basically don’t have NC either, so the price point is not justified.", "The main ANC feature didn't work...was just silent. Only the talk-thru and Ambient Aware features worked. I did connect with Harmon customer service and they offered to send a replacement but I really don't care for the fit of these in my ears to go through all that. Will be returning."], "reference": [24, 16, 5, 1, 0, 0, 0], "score": [-0.29531251173466444, -0.20000000298023224, -0.20000000298023224, -0.699999988079071, -0.501562500372529, -0.800000011920929, -0.20000000298023224]}