{"reviews": ["I actually like these headphones. The lost star is for the fact that they do not really sound that great without the jbl headphone app. Once I popped that on even just using the default eqs, 90% of my complaints evaporated.<br /><br />I've seen people compare these to skullcandy, I'll do the same since my last pair were skullcandy anyway.<br />While the skullcandy delivered solid bass it did so while stomping on mids pretty badly. These do not suffer that issue. While it can be said the bass is louder on the skullcandy set. These are offering a much clearer and well rounded bass without utterly destroying the mid range, and though quiet out of the box the installation of the app brings them to the same volume the skullcandy pushed if not a little louder.<br /><br />Fitting them to your ear can also be a bit of trial and error. I'm actually using a different sized cup on each ear to get the best results for myself.<br /><br />Biggest thing is the app though, it really was a night and day difference. The default club eq seems to work for most genre's or you can of course create your own if you want to get picky.<br /><br />Once the fit and app are out of the way, these are not bad at all. I suppose it bears mentioning that the advertised quick charge feature actually appears to work with these. (this is something that on skullcandy's side seemed like a point blank lie)<br /><br />The touch sensor may be a bit on the sensitive side, but that's been true of the last 4 or so of these I've owned.<br /><br />This review may sound a bit critical but I'm legitimately enjoying them, largely wondering why the default profile for them sounds so bad though. The app immediately clears that up fortunately.", "Fantastic sound quality, impressive bass response, and highly usable headphone app make this the best pair of earbuds I’ve purchased and tested so far. I know these are a couple years old now, but the sound is fantastic and $50 price tag makes me not care about having the latest thing. I find the “talk thru” and ambient controls particularly useful. I also like the ability to assign different controls to each earbud thru the app. The shape of the earbuds make the fit feel a little off at first, but I adjusted quickly once I realized they would stay snug in my ears under normal circumstances. I purchased 3 other sets of buds at the same time from other companies in hopes I would find my new favorite pair as I was disappointed with my last purchase. For now, I don’t believe that was a necessary thing to do since these JBLs are pretty darn amazing. But I will more thoroughly test these in different environments to see if I can disappoint myself again.<br />If I do not update this review, this pair remained a stellar deal with amazing performance.", "Sound quality, battery life and gestures to use while wearing are all great-especially for the price.  i also liked that they included 3 different sizes of rubber pieces for great fit and more noise reduction.  Mic great for clear calls!", "Love the way they sound, the bass is very punch and pronounced. The talk through function also works very well. Unfortunately everything else that makes a good pair of earbuds falls short. The earbuds just wont stay in. I get everyone has different sized ear canals but you will see other reviews about them falling out. I have to constantly readjust them. The normal sized silicone cup is too small (wont seal so no bass and bad noise canceling) but the large cup is too big so wont seat in ear correctly. The active noise canceling is very minimal can hardly tell its on, and last the case is not all that great. The lid is very flimsy feels like it could break easy. I would definitely return them if I could, but through out the packaging. Might end up gifting them to someone who can maybe get a more comfortable fit. At the end I cant recommend them.", "I got these for work so I could listen to music and talk to my kids. They are really nice and comfortable. They sound great. I have tiny ears so the different ear pieces helped me get the right fit. And the price was great to.", "I have the jbl speaker so which is great, so I went with these earbuds. Easy to connect, comfortable, good fit in my ear. The sound very is good quality.", "Comfortable fit. Good sounds for the price.", "I like JBL as a brand, and they do get it right most of the time with their products. In terms of earbuds, I have the Tune 115 and these buds have proven to be a solid product. The Tune 115 has survived some series of falls and water submerging without even having an IPX rating. I have seen the 130NC  on sale and had to pull the trigger. IMHO The 130s buds are a great value for sure. Pretty good noise canceling with a solid bass presence. Understandably, they are not as loud and bass saturated as my Sony WF-XB700(which has bigger-sized buds). However, these JBLs have other features such as ambiance mode, good touch controls( and I am someone who prefers button controls), and of course: a decent ANC.  The sound is clear and well-balanced, as expected from JBL. I like the app a lot btw..very easy to control and customize an EQ. The fit is so-so sometimes, but that could be solved with non-JBL ear tips. The supplied ear tips are good, but the size jumps a little between the small and the large tips... This minor issue does not warrant a one-star fewer IMHO-Especially for the sale price. You get SO MUCH more than what you pay for..", "Out of the 6 ear bud brands I have bought, these are by far the best sound quality.  I also really like the fit and compact carrying case, I have recommended them to many people.", "Absolutely love these.  Better sound quality than AirPods and betting fit.  Highly recommend them.", "Let’s start with fit. Maybe it’s my ears but they absolutely refuse to stay on my ears. I’ve tried all three sizes and they are either too big or too small. So just given that they are pretty much useless if you plan on any activity where your head might move.<br /><br />As far as the sound, it’s really not great. Sure there are different settings but overall the quality was far below the AirPods I used to use.<br /><br />Lesson learned, pay the extra for AirPods. These are not worth the price or aggravation."], "reference": [37, 20, 2, 2, 1, 1, 0, 0, 0, 0, 0], "score": [0.20000000298023224, 0.30000001192092896, 0.800000011920929, 0.10000000149011612, 0.20000000298023224, 0.8999999761581421, 0.6000000238418579, 0.10000000149011612, 0.800000011920929, 0.30000001192092896, 0.10000000149011612]}