{"reviews": ["Had these since September. Rarely used them except for some YouTube videos in the background while I clean or when I went fishing. In that short amount of time the right side is almost completely silent, even putting the balance all the way to right and there's barely any sound. Complete garbage. Apparently jbl isn't known for quality any more. Definitely recommend to stay away", "The bass is very low for jbl which is odd. I've had cheap Skullcandy that did more, but after using the app to put the bass EQ on it was a little better, I aslo use \"Poweramp\" as a music player which gives me another EQ that's way better but yeah. The treble and mids are perfect though. Very clear, crisp audio all around. I've honestly gotta say these were worth the 50$ while on sale. I would definitely recommend but again the bass isn't what I was expecting. Out of the box it's almost not even there but I've managed to tweak mine to give me enough. The treb/mid definitely make up for it though. 4 out 5 *", "These are great if youre sitting still, but any movement and they slip out. I bought a pair for me and a pair for my wife. We both have the same problems. And after reading reviews more thoroughly, seems a lot of other do as well. Weve tried all 3 sizes of boots that came with them and nothing works. They will stay in for a few min but after walking around they start to come out, and the fall out every time I bend over. Theres no chance that anyone is going to use these while doing anything active what so ever. They also dont seem to charge in the case every time even though the case has full charge.  Got tired of cheap ear buds that would die after a few months, so I pulled the trigger and spent the money for jbl, and Im going to go back to the cheapies. At least they stayed in my ears.", "With a little EQ work they can sound as good as Sennheiser 2 which cost double the price.  Definitely need to raise the vocals up on EQ.. I raised the vocals about 3 bars and raised the lows and mids about 1 bar... It's hard to tell my Sennheiser 2 and these jbl apart after the EQ settings. They are also very comfortable in my ears. Not sure how long they will last or battery life yet.", "I bought some $15 ear buds that are louder...<br />For being jbl I thought they would be better. But for the price I guess they are okay when I got them for $50"], "reference": [2, 2, 0, 0, 0], "score": ["-0.5", "-0.10000000149011612", "-0.4000000059604645", "-0.20000000298023224", "-0.20000000298023224"]}