{"reviews": ["I have never ever been a perfume fan.  Don't own a bottle but when my sister-in-law came for a visit and had this on I was instantly hooked. This was my very first perfume purchase and I want to find more fragrances like this.  I would love to try more of the Clean line but will find a way to sample the smells first.  Rain doesn't last all day but if I spritz my clothing along with a dab on my wrist it will hold half a day.", "Great product, as expected I received a new bottle of clean perfume. It's the only perfume I can wear because of its mellow scent, it smells so fresh and so clean. It's the first time I've ordered it from Amazon and I'd do it again.", "I love this scent. ..cozy clean smell and you only need a little bit as it is strong and maintains its scent throughout the day if you spray it on your clothes, I would purchase again.<br />Would have given 5stars if it were a bigger bottle for the price ;)", "The size of the bottle is perfect for my purse.  I had already tried the fragrance at a box store but they did not have the 1 oz size.  The fragrance is light and smells just like - rain!", "This is one of my favorite perfumes. The smell is so refreshing and energizing. few sprays are enough and will last the whole day. whenever I am wearing it, I get compliments on how good I smell. It feels as if I just had came out of the shower! I live in the Middle East and this perfume is not available here. I got it the first time from the US a few years ago, and I was extremely happy to find it on Amazon. I ordered half a dozen online because I don't want to run out of it! I have a small roll on bottle that I always keep in my bag. whenever I need to feel energized, I apply some on my wrist and my neck and I feel instantly fresh and invigorated.", "If you like the smell of fresh, clean shower, then just one spray of this will do the trick. You wint notice it after awhile , but people around you will pick up the scent. Strong, so only a light spray is needed. I keep the bottle in my bag for a quick freshener when I'm working hard", "I found this at sephora and immediately love it! I wanted to try a smaller bottle before getting the bigger one and luckily amazon had it….Love it! It's my new favorite perfume bottle!", "This is a nice clean scent that smells very much like a half a dozen scents out there. It lasts about a minute on the person, however. This is a very small bottle, and I feel there are scents out there so similar in scent and quality at a better price. It is definitely not a heavy perfume, and will not be offensive to coworkers or others in small spaces.", "This was my first bottle of this perfume and it won't be my last. It kept it's smell all day long and is light and soft. No headaches from the winneir. I will be ordering it again very soon.", "I love this perfume so much but it's not what it used to be. I received this as a gift (hence, no AVP badge) but it was purchased from Amazon. The last bottle I bought from Birchbox and it seemed to be stronger, although not by much. This stuff doesn't even last a few hours which is almost a crime since it costs nearly as much as most designer fragrances.<br /><br />Everyone else in my family loves the way this smells too - they all say the same thing, it's so light and clean, which is why I like it in the first place. I haven't found anything else that has such an unprocessed smell to it or I'd buy it instead. This just isn't a good enough value anymore, I have to find something else.", "I love this scent. It is perfect very clean and crisp. People constantly ask me what I am wearing. It keeps you smelling like you just jumped out of the shower and threw on your favorite cozy robe that smells of bounce fabric softener. That is the only way I can describe it. It is the perfect mix of Soap and Clean laundry. I love it. It lasts all day and isn't overwhelming. The seller was easy to communicate with and the shipping was fast! I highly recommend this product! I usually purchase this from sephora but I gave it a chance and bought it online. It is NOT an imitation. The scent, bottle and packaging are identical. LOVE LOVE LOVE", "This is my go to scent, however for some reason this bottle I got from this order doesn't smell right or last as long as the one I purchased from CLEAN directly.  This literally evaporated right after putting on.  It perhaps lasts for 45 mins at best...  Now I can't say it's definitively a knockoff maybe it was just a bad batch, or the bottles have been around too long... That's what I get for trying to save a few bucks", "Love this!!!! I smelled this on a lady and asked her what it was. I will be ordering a bigger bottle next time!!!!!", "My daughter loves this perfume so much she asked for it again for a christmas present. I found it on amazon and purchased the 2.14 oz bottle for $72.00.  She uses this sparingly because it is her favorite.  She noticed that is was not as strong as her previous bottle. I purchased this 4 months ago. and it literally has no smell.  She sprayed her neck 4 times and asked me if I could smell it.  I have a nose like a hound and I could barely smell the perfume. I will never order this from Amazon again as I this it is a ripoff and not the real thing!!!  It is perfume not toilette. Angry!!!", "I love the real perfume, but if you are going to buy this go to a reputable store. I usually get mine from Sephora, but my husband bought me a bottle off of Amazon for Valentine's Day, not realizing there was such a thing as perfume knock offs. I didn't know where he bought it from, but I knew as soon as I used it that it was not the genuine product. The scent is similar, but has a sharp undertone, perhaps like it has been cut with alcohol or something, it just isn't right. I had to use way more than I would normally use and then it was gone in a ridiculously short amount of time. The real perfume I can still detect in the evening after wearing it all day long. I love the perfume (the real perfume), but buy elsewhere!!!!!", "Wth....It smelled like watered down alcohol...only a very faint smell of the (real) skin fragrance....was so disappointed!!! My previous bottle was 3 time stronger and last all day. Did they messed up the formula?"], "reference": [7, 3, 2, 2, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.30000001192092896, 0.30000001192092896, 0.5, 0.699999988079071, 0.30000001192092896, 0.20000000298023224, 0.10000000149011612, 0.5, 0.20000000298023224, 0.10000000149011612, 0.10000000149011612, 0.20000000298023224, 0.10000000149011612, 0.05000000074505806, 0.30000001192092896, 0.6000000238418579]}