{"reviews": ["I purchased this from Fragrance.Net and it smells great. It smells like Gain detergent. The scent is pretty strong so be careful not to spray too much. It can be a little overbearing if you get carried away.", "I absolutely love this scent.  Subtle but can be layered to be a stronger scent.  Kinda sexy but not offensive to those that are not really into perfumes.  I find this the hardest scent in this line to find and was very excited to find it available on Amazon for a very very good price.", "I have finally found a scent that is light and fruity, without making me smell like a teenage girl!<br />The only thing is that the scent doesn't really last too long. Perfect for a date night. But if you want an all-day smell, I'd suggest getting the little roll on to put in your bag.", "I am a fan of all the Clean products but this scent has become my new favorite.  It is not heavy or fruity.  It just has a nice &#34;clean&#34; smell.  I find that 2 sprays are enough to last all day without being too strong.", "Such a wonderful and pleasant scent.  My daughter loves this product and always gets compliments.  If you are sensitive to strong perfumes this is and excellent choice.  It is just as the name describes, Clean.", "This is my 8th fragrance from CLEAN and I absolutely love it!  It smells so wonderful, light and pure.  I get a lot of compliments and questions on what scent I am wearing.  Stands true to its maker...smells nice and CLEAN.", "this is nothing but water.  the scent lasts all of 5 seconds.  this is a rip off.", "A bit too strong for me - I'm  a huge fan of the Clean Warm Cotton.  Won't purchase this again, but will finish the bottle.  Smells like a strong Irish Spring soap - which I do like, but it's too much scent for me.", "Great product, as expected I received a new bottle of clean perfume. It's the only perfume I can wear because of its mellow scent, it smells so fresh and so clean. It's the first time I've ordered it from Amazon and I'd do it again.", "I'm not a fan of woody perfumes, but I also love to try new things--even when I think I won't like them.  I'm glad I tried CLEAN White Woods because I really love this fragrance.<br /><br />CLEAN White Woods is a lovely fresh scent that isn't overpowering.  It's only lightly woodsy, which is why I like it so much.<br /><br />White Woods has this fragrance profile:<br />top notes: bergamot, black pepper, and mandarin<br />mid notes: magnolia, calla lily, and vanilla orchid<br />base notes: sandalwood, pralines musks, and amber wood<br /><br />None of these really stand out to me.  They just blend together beautifully.<br /><br />I think this fragrance would work for anyone who enjoys something light with a hint of a walk through the woods.", "I love this scent. ..cozy clean smell and you only need a little bit as it is strong and maintains its scent throughout the day if you spray it on your clothes, I would purchase again.<br />Would have given 5stars if it were a bigger bottle for the price ;)", "My sister loves this and was so happy to get it through Amazon....she was very, very satisfied both with the prices and the scent is just like new......like from the store.", "I got a mini version if this a while ago and I finally got around to purchasing the full version. This is my favorite scent from the Clean line. It smells warm and fresh, like pulling your favorite T-shirt straight from the dryer. I wish everything smelled like this fragrance.", "Yep. You walk around smelling like super fresh laundry (Gain to be exact).  My male coworker smelled so good i inquired and lo and behold its a unisex scent. Go me! Careful folks, don't spray too much!", "I love this scent. It doesn't smell like rain per se, but whatever. It's light, fresh, and a teeny bit musky. After it warms up on my skin, it smells heavenly. Does not give me a headache whatsoever.", "I'm 20 years old and a college student and I just love this scent! I used the whole bottle up in a little under a year. I've gotten so many compliments on how I smell from my peers and my family and older folk too.<br /><br />This is a winner.<br /><br />After I ran out, I thought I'd explore other Clean scents, so I got the &#34;Warm Cotton&#34; Eau De Parfum spray, but was not satisfied, and got no compliments. I miss my &#34;Skin&#34; scent! This is the one, everyone.", "Love this scent. It isn't overpowering but lasts long on the skin. The scent smells crisp and clean.<br />I actually have been stopped by strangers to inquire what I was wearing because I smelled so nice!  You can also layer this with other Clean perfumes. My favorite to mix it with is Air. It brings out a nice floral scent.", "I love this scent. I also love that it last all day. When I think it's faded,people tell me how great I smell.  When I wear this perfume, I receive so many compliments from both men and women. If I had to compare this to something, I would say it smells like Downy fabric softener but better. The cost is not too bad either.", "It's a nice light scent that's not too sweet or flowery. Love the scent it just doesn't last long at all!", "I tried this perfume at a big mall dept store and loved it but didn't love the almost $40 price.  It has such a clean, almost soapy scent that I love.  A great scent to use when you need a change.", "I was a little disappointed because it didn't smell like I thought it would smell; I thought it would smell more like a linen scent; the smell of clothing straight from a dryer, not like a strong bathroom cleaner. In addition to the scent, the fragrance doesn't last long either.  Considering the way it smells, it may be a good thing that the smell doesn't last long but for the price i paid for this fragrance, I expected it to last a lot longer. I definitely won't be purchasing this again. If anyone knows of a fragrance that has a true clean linen scent, please let me know. Thanks!", "Clean clean clean!  Love this scent and so does everyone else who hugs me. I sat in my friends car and she said, \" All of the sudden my car smells so clean!\"  Smile!  -sb", "Smells great, but scent doesn't last throughout the day.  However, of all the different scents that the Clean brand manufactures, this smells the most like a post-shower clean scent.", "Its smells so fresh and light!  I get compliments all the time when I'm wearing it! Great scent!", "Wonderful fresh scent. Light and airy.", "I do like this scent,  but not as much as Laundry scent.  This smells a little bit like deep woods off on me.  Don't get me wrong...it smells clean and fresh, and I do wear it a lot.  I just prefer Laundry.", "Smells just like fabric softener sheets.  It's good and seems to last fairly long (about 3 hours), but I'm not sure it's the scent you really want to be remembered by.", "I love the aroma of this scent and it is so great on linens.  Every time I change my sheets I spray the clean ones with this scent.  It is great.  The price for this size was great.  I have used this product for about 3 years since my sister introduced me to it and love it. The scent is like clean air dried laundry.  It is so clean and fresh smelling.  Just feel good sleeping with the scent or wearing it.  Have received excellent feedback from people when they do smell.", "Divine scent. I am a huge fan. It's light and refreshing, understated, not cloying and heavy. I don't use a lot of scent and am very choosy. This one suits me very well.", "If you are looking for a fresh light clean scent, this is your best choice. I received a sample for sephora. Ive been in love with this parfum ever since. Try it, you'll love it. And please order from Amazon. its cheaper.<br />Thanks", "I have both the warm cotton and the cool cotton. Sometimes I wear them separate or mix them together and I always get compliments. I got my mom hooked on them as well and she prefers the cool cotton since it connects with her 'chemistry' (her words). The warm cotton reminds me of warm fresh linen laundry and cool cotton has a more 'strong' and clean scent.  I got my first samples at Sephora however Amazon was cheaper.", "I love this scent! It smells so fresh and is not overpowering.", "A fresh clean scent!", "smells wonderfully clean, as the name suggests. I bought this originally at Sephora because I was craving a cleaner crisp scent, I fell in love! I wore it throughout the spring/summer, fall/winter I normally like a musk scent but I think this fall/winter I'll try Clean....I've mixed the scent with Cedrat Enivrant which helped sooth my &#34;lemon&#34; crave as well...", "I recently ordered this perfume because I tried it on at Sephora and fell in love! This is a very sexy perfume and it lingers long after you put it on. I received so many compliments from that one sample spritz that I had to buy it. The scent is light, not soapy and not overpoweringly floral. It just smells like a very delicate bouquet that leaves you wanting more.", "This is a nice clean scent that smells very much like a half a dozen scents out there. It lasts about a minute on the person, however. This is a very small bottle, and I feel there are scents out there so similar in scent and quality at a better price. It is definitely not a heavy perfume, and will not be offensive to coworkers or others in small spaces.", "always get compliments, the scent is fresh and airy,my favorite", "My absolute fav scent. It manages to be crisp and yet warm at the same time. My husband loves it. I've completely switched away from Philosphy. I loved them for years but now the cheaper formulations smell cheap. These are the new modern cleans, not the old lady cleans.", "I first smelled and loved this scent on a friend, so asked her what it was. We tend to like the same kinds of fragrances- light, clean and fresh. I bought it that day and have been wearing it ever since.  For those reviewers who want more of a fresh laundry scent, Clean makes lots of other ones and maybe they'd be more to their liking. I've tried others in their line, but this is definitely the best on me. Even when I can no longer smell it on myself, I'm asked what it is and complimented, so I think it's perfect. I'm thrilled to find it on Amazon!", "I've been on the hunt for a new signature scent for some time, and I had always wanted to try this scent since seeing it online a few years ago. I tend to go for clean, slightly sweet scents. I'd say this is about that with some good florals mixed in. However, it has little staying power through the day, and it also seems rather flat. By that I mean, there's little depth to the scent like most good perfumes have. Still, I don't completely regret the purchase. I'll finish the bottle, but the prospect certainly doesn't excite me.", "I love this scent and always get compliments when I wear it.  Very light", "This is great scent. It's fresh, crisp and clean. Honestly , I think it would work for a man or woman. Very little goes a long way so , it's an excellent value. I would consider this a long lasting scent.<br />Rarely I would suggest using a perfume for refreshing a garment but this scent works perfectly for freshening up coats,<br />Overall a perfect casual everyday scent. This is going to be my signature scent.", "Love the Clean Blossom scent. Very subtle Eau de Parfum. It's not overbearing.....love it.", "Beautiful scent!", "I've been wearing this scent for over 2 years and still LOVE IT!!!  I also get so many complements on it.", "Every time I wear scent , I get compliments! I have using perfume for 21/2 Yrs. I love the scent. Light, but distinctive.", "Smells very pleasant! I am a lover of “clean”, “fresh” scented parfums/perfumes & oils. This scent is definitely in that will house and I recommend it for those whom are partial to fresher scents.", "I have looked for a scent that fits me all my life. I thought I would have to settle for baby lotion to smell fresh and then I came across my scent for a lifetime...Clean (Warm Cotton) I love the way this makes me smell. I asked my husband if I smell good and he said, you know you do and you got it just for you...lol I sure did...I feel confident and like a lady when I wear this scent. :)", "love this scent", "I have worn this product for years . I always get compliments when wearing it . Not strong at all . Pleasant scent", "This is my favorite perfume. I'd give it 5 stars on smell alone, but it lacks a little bit of staying power to get the full 5 stars from me. It smells like clean skin you want to nuzzle next to. It has a very intoxicating quality to it. I absolutely adore this scent. I got the roller ball as well for mid-day reapplications.", "Best scent ever. Truly u smell like u just took a shower. It doesnt last very long the scent though. Its quiet concentrated & maximum it will last 4-6 hours.", "I bought CLEAN Warm Cotton here and Sephora. Scents were the same. Love this fresh scent.", "I really enjoy the nice clean fresh scent of this perfume. It is not an overpowering scent so it is great for everyday wear. I will knock a star off because it doesn't have the staying power of some perfumes. Overall a nice product particularly heading in to Spring and Summer when a lighter scent in the heat of the South may be desired.", "This just have that clean pleasant scent that's not overpowering. I've been using this since 2013.", "I love this scent. It is perfect very clean and crisp. People constantly ask me what I am wearing. It keeps you smelling like you just jumped out of the shower and threw on your favorite cozy robe that smells of bounce fabric softener. That is the only way I can describe it. It is the perfect mix of Soap and Clean laundry. I love it. It lasts all day and isn't overwhelming. The seller was easy to communicate with and the shipping was fast! I highly recommend this product! I usually purchase this from sephora but I gave it a chance and bought it online. It is NOT an imitation. The scent, bottle and packaging are identical. LOVE LOVE LOVE", "This perfume is just delightful.  Like clean laundry, warmth, and happiness. There's a bit of a soapy smell that lingers after the top notes (citrusy) have faded.  It's not a strong scent, but it's a comforting one.  Marc Jacobs, Dior, they say, &#34;Look at me!&#34; but Warm Cotton says, &#34;Be with me.&#34;", "When I was a tween I got this roller ball from sears that was called fresh towels. My nerdy love to clean self loves the smell of clean laundry so it was amazing to me.  Then as an adult I found this Warm Cotton. Oh I love it! Smells so good and fresh! Just like clean laundry.  Definitely recommend it! The scent lasts all day for me, it's not overpowering and in the year or so I've been wearing it, it's not caused a migraine", "The scent is awesome", "This scent is VERY strong.  If you like light, subtle fragrances, this may overwhelm you.  I feel as though I bathed in laundry detergent.  I think that I will use the remainder to freshen my sheets and clothing drawers.  Don't get me wrong, it is a fresh, clean scent.  However, if you are sensitive to heavy scents and don't desire people to pick up your scent when you are 20 feet away, try before you buy.", "Favorite scent.", "Fresh, clean scent, staying power all day!.. The best scent to wear if your working in customer service!...", "I should have listened to previous reviewers. I really love this scent, but it does not last more than an hour or two. I have to reapply constantly and went through almost a half bottle in a few weeks. Usually perfume lasts me months, even years. So, as much as I like the smell, I can't give it 5 stars because it fades way too quickly and is not really worth the price for that quality.", "This is my go to scent, however for some reason this bottle I got from this order doesn't smell right or last as long as the one I purchased from CLEAN directly.  This literally evaporated right after putting on.  It perhaps lasts for 45 mins at best...  Now I can't say it's definitively a knockoff maybe it was just a bad batch, or the bottles have been around too long... That's what I get for trying to save a few bucks", "Love thus stuff. Just a nice fresh scent,", "This Eau de Parfum is great.  The scent smells clean and crisp and lasts a long time.  The closest to describe the scent, is it smells like fresh, sliced grapefruit.  I know that doesn't sound great, but it is such a refreshing clean smell that I spray it on my pillow case.  A friend thought the scent was from my hair (shampoo or hairspray) and wondered what I used.", "I thought buying perfume online would be risky because I hadn't tried it. But I'm so glad I purchased this from the description!! I love this scent. I've received numerous compliments since I switched to this perfume. It has a very clean but not too sharp detergent like smell. I wanted something refreshing but earthy with citrus hints and this is perfect.", "I bought this product because I have used it before.  I no longer could find it in any local store so I purchased it on line.  Everyone remarks on how clean and fresh it smells.  And it is not overpowering.  I want my grandchildren to associate their Nana with this fresh scent.  I love it.", "Lovely scent and refreshing.", "Great and fresh scent, I feel like I just got out of the shower, I'm thinking on getting the body lotion too:)", "Love the scent.", "great scent,,", "Love this scent. It's so light and refreshing that it's quickly become a favorite scent. Unfortunately, mine arrived leaky and I needed to replace it, but I don't mind because it's one of my go to scents. I wear it at least 3 times a week!", "Love Love Love ❤️ the scent", "The scent is very strong, so only do one or mayyyybe two sprays. It lasts a long time. I just don't care for the scent extremely well, it's so concentrated it kind of makes me feel sick if I spray more than two sprays. Kinda smells like nail polish remover and grass and dandelions mixed together in my opinion.<br /><br />I prefer the Clean &#34;Skin&#34; scent which I had before this. I have gotten many compliments on the &#34;Skin&#34; scent and no compliments on &#34;Warm Cotton.&#34;<br /><br />I'm a 20 year old college student, to give you a perspective on preferences", "Very clean scent...get lots of compliments", "Great scent; I'll continue to purchase this as it's one of my favorites.", "The perfect scent if you want to smell fresh. Doesn't linger. Wears well", "Oh m gee! This smells so good! It's a very clean scent obviously but it has a sexy undertone. Love it. It lasts a good 6 hours or so.", "I absolutely LOVE this scent. I want to wear it ALL the time. The only flaw is that is wears off VERY QUICKLY. If the scent lasted longer it would have gotten a 5 star.", "My best friend uses this perfume, and I got it as a gift. It Smells amazing, and I don’t get any headaches! A very light scent that isn’t too overpowering.", "Not as nicely scented as the other CLEAN products (warm and cool products) Still an okay scent though.", "Love this scent; and at such an amazing price!", "LOVE!!! Such a clean, fresh scent! I frequently get complemented when I wear this spray. The entire CLEAN line is fantastic but Warm Cotton is one of my favorites.", "Soft scent, fresh, not over bearing", "Love this clean scent!", "Super clean scent.", "It was a bit strong on the first spritz but it kept the fresh clean scent for more than 6 hours. I was worried it might smell too &#34;chemically&#34; or artifical at first. Love it as the day wore on and it kept a lighter fresh scent. Looking to buy more from the Clean range.", "I simply love this scent and can not get enough of it! It's just so fresh and clean. It arrived as promised", "Perfect my favorite scent and at a great price", "I love this fresh scent!", "I have been searching for a light, clean smelling perfume that doesn't have an overpowering scent. Someone at Sephora's recommended a scent from the CLEAN line and recommended SKIN. It smelled good on the sample strip so I purchased it. When I got home I opened the box, removed the perfume and tried a small amount on my wrist. It smelled so bad I couldn't stand it. While I was doing chuores, I keep smelling it. I couldn't take it anymore so I had to wash it off with soap and water. I do not recommend this perfume for people looking for a light, clean smelling perfume. If I were a man, I would NOT like smelling this on a woman. And indeed it is way over priced. I am going to give this perfume to someone who will appreciate it. I know I didn't. I hope this review helps you in your decision on purchasing this item. Thank you!", "Excellent!! Favorite scent", "I love this scent. Only last about 10-15mins.", "I loved it when I bought it e years agi, and I still love it! Definitely fresh and cleansing scent:)", "It's scent is wonderful just as it is, and blends well with your natural smell as well. It's never overpowering, and last all day, so no need to reapply. Love it!!", "Love this scent!  Been using it for awhile.  It's like you stepped out of shower!  Not offensive to anyone!", "I love this scent!!!!", "I love this scent! I am constantly being complimented on how wonderful and light this scent is.  In the mornings people say my area smells like \"fresh\" clean air.  They love the scent and I ask if it's too much since we're all different and find certain smells offensive or too much.  But everyone loves it and is always complimenting on it. My family and co-workers say the scent is like fresh clean air/laundry hung out to dry/clean linens/towels.  If you like soft light clean smelling clothes you'll love this scent.  Doesn't last though.", "Ever since I have discovered this scent at Sephora it has been a staple!!! If you love fresh and clean this is the PERFECT scent for you! I ALWAYS get complimented when I wear this perfume. I’m happy I found it here on amazon since Sephora discontinues carrying this line.", "Love the scent.  Always get compliments", "stayed on all day very fresh scent", "Love the scent. I smell like clean laundry all day not scented perfumes that have gone stale. Fresh and clean.", "Really awesome scent. Very clean.", "The scent seems wonderful, but I cannot say how it is on me because my product was shattered in the oversized box it was shipped in (the box smells great).", "It is a light scent, crisp and not to overbearing. I find myself wanting to reapply once during the day. It just seems like it doesn't stick with you for the whole day."], "reference": [13, 9, 9, 5, 4, 3, 3, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.20000000298023224, 0.5333333263794581, 0.2500000074505806, 0.699999988079071, 0.800000011920929, 0.4000000059604645, 0.20000000298023224, 0.10000000149011612, 0.8999999761581421, 0.800000011920929, 0.5999999940395355, 0.699999988079071, 0.6000000238418579, 0.6000000238418579, 0.8999999761581421, 0.699999988079071, 0.75, 0.8999999761581421, 0.699999988079071, 0.8499999940395355, 0.10000000149011612, 0.800000011920929, 0.2500000037252903, 0.8999999761581421, 0.8999999761581421, 0.30000001192092896, 0.20000000298023224, 0.6749999895691872, 0.30000001192092896, 0.5, 0.699999988079071, 0.8999999761581421, 0.800000011920929, 0.30000001192092896, 0.30000001192092896, 0.5, 0.8999999761581421, 0.800000011920929, 0.30000001192092896, 0.20000000298023224, 0.8999999761581421, 0.5333333313465118, 0.8999999761581421, 0.8999999761581421, 0.6000000238418579, 0.699999988079071, 0.699999988079071, 0.4000000059604645, 0.8999999761581421, 0.6000000238418579, 0.8999999761581421, 0.44999998807907104, 0.8999999761581421, 0.6333333353201548, 0.6000000238418579, 0.4999999888241291, 0.4000000059604645, 0.699999988079071, 0.8999999761581421, 0.3666666696468989, 0.800000011920929, 0.6500000059604645, 0.4000000059604645, 0.20000000298023224, 0.800000011920929, 0.23333332935969034, 0.8999999761581421, 0.4000000059604645, 0.8999999761581421, 0.4000000059604645, 0.8999999761581421, 0.8999999761581421, 0.7999999821186066, 0.30000001192092896, 0.07499999739229679, 0.800000011920929, 0.800000011920929, 0.699999988079071, 0.5, 0.44999998807907104, 0.699999988079071, 0.5, 0.8999999761581421, 0.8999999761581421, 0.6000000238418579, 0.8999999761581421, 0.800000011920929, 0.6000000238418579, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.30000001192092896, 0.800000011920929, 0.8999999761581421, 0.8999999761581421, 0.699999988079071, 0.8999999761581421, 0.8999999761581421, 0.5600000053644181, 0.550000011920929, 0.8999999761581421, 0.800000011920929, 0.8999999761581421, 0.8999999761581421, 0.10000000149011612, 0.6000000238418579]}