{"reviews": ["You'd think I'd learn by now not to try a new perfume/cologne without actually SMELLING it first (and end up throwing away my money), but I've done it again.  This fragrance has a sharp chemical odor, and according to my husband, it also smells cheap.  Maybe this bottle is from a bad batch - maybe it's not even authentic.  Whatever the case, no more relying on customer reviews and ordering new fragrances online.", "A bit too strong for me - I'm  a huge fan of the Clean Warm Cotton.  Won't purchase this again, but will finish the bottle.  Smells like a strong Irish Spring soap - which I do like, but it's too much scent for me.", "I got a tester of this and loved it. When I bought a whole bottle it smelled like really strong body soap. The scent lingers all day and it is not a nice smell. I would NOT recommend this scent and I would say it is NOT even close to the tester smell. YUCK!", "I've been on the hunt for a new signature scent for some time, and I had always wanted to try this scent since seeing it online a few years ago. I tend to go for clean, slightly sweet scents. I'd say this is about that with some good florals mixed in. However, it has little staying power through the day, and it also seems rather flat. By that I mean, there's little depth to the scent like most good perfumes have. Still, I don't completely regret the purchase. I'll finish the bottle, but the prospect certainly doesn't excite me.", "I should have listened to previous reviewers. I really love this scent, but it does not last more than an hour or two. I have to reapply constantly and went through almost a half bottle in a few weeks. Usually perfume lasts me months, even years. So, as much as I like the smell, I can't give it 5 stars because it fades way too quickly and is not really worth the price for that quality.", "Great smell. Price too high for such a small bottle."], "reference": [3, 3, 1, 0, 0, 0], "score": [-0.30000001192092896, -0.4000000059604645, -0.10000000149011612, -0.4000000059604645, -0.30000001192092896, -0.30000001192092896]}