{"reviews": ["This is my first review,<br />I purchased CLEAN Original Eau de Parfum spray, 1FL.oz, and I have to say while it does have a pleasant aroma of flowers and a clean fresh smell....I think that the flowery smell was just a little too strong for my liking. It definitely overpowered the clean,powdery,linen  smell I was looking for.<br />I have the CLEAN cotton Parfum spray which I am constantly getting compliments on and I was hoping this scent was similar to the cotton scent, but to no avail it was not.<br /><br />Now, because this is not a returnable product and It is just sitting on the counter without use.. Amazon was wonderful enough to refund my account for this purchase.<br />Just a little hint, before you buy a certain perfume, it does help to try it out in a store first, so you do not spend money on something that ends up being overpowering. Everyone smells different with the skin oils and what smells nice on 1 person may not smell the same on you.<br />Lesson Learned...", "I am a fan of all the Clean products but this scent has become my new favorite.  It is not heavy or fruity.  It just has a nice &#34;clean&#34; smell.  I find that 2 sprays are enough to last all day without being too strong.", "This Product has a amazing smell. Really fresh and clean. Ive had a lot of compliments from it.... It smells fresh like clean cotton laundry.", "I love the smell I could just roll in it. It's good for the price but of course it's not the original. It smells slightly off from the original but it's close enough! It lasts about two hours on hair and a day and a half on clothes. I bet it's even better on skin if your right out of the shower. All in all, it's pretty decent !", "I love this scent. ..cozy clean smell and you only need a little bit as it is strong and maintains its scent throughout the day if you spray it on your clothes, I would purchase again.<br />Would have given 5stars if it were a bigger bottle for the price ;)", "I just don't go a day without using the Warm Cotton.  It wraps you in a clean, light fragrance that makes you feel like you just got out of the shower all day.  So many people will comment on the lovely smell.  I sure hope Dlish keeps this fragrance around.", "This is one of my favorite perfumes. The smell is so refreshing and energizing. few sprays are enough and will last the whole day. whenever I am wearing it, I get compliments on how good I smell. It feels as if I just had came out of the shower! I live in the Middle East and this perfume is not available here. I got it the first time from the US a few years ago, and I was extremely happy to find it on Amazon. I ordered half a dozen online because I don't want to run out of it! I have a small roll on bottle that I always keep in my bag. whenever I need to feel energized, I apply some on my wrist and my neck and I feel instantly fresh and invigorated.", "If you like the smell of fresh, clean shower, then just one spray of this will do the trick. You wint notice it after awhile , but people around you will pick up the scent. Strong, so only a light spray is needed. I keep the bottle in my bag for a quick freshener when I'm working hard", "I was a little disappointed because it didn't smell like I thought it would smell; I thought it would smell more like a linen scent; the smell of clothing straight from a dryer, not like a strong bathroom cleaner. In addition to the scent, the fragrance doesn't last long either.  Considering the way it smells, it may be a good thing that the smell doesn't last long but for the price i paid for this fragrance, I expected it to last a lot longer. I definitely won't be purchasing this again. If anyone knows of a fragrance that has a true clean linen scent, please let me know. Thanks!", "I think just about everyone loves the smell of warm towels that just came out of the dryer--- this is exactly that... It is my favorite--- I wish it would last a bit longer during the day but it has decent lasting power.  This is my absolute favorite... yes it is kind of funny to want to smell like towels that came out of the dryer but hey, it works for me :)<br /><br />The retail price is a bit steep that is the only complaint!", "I really like this smell , not to strong.", "I like the clean smell, not strong", "This is a very strong citrus, almost pinesol like smell. While it makes you smell fresh, it's very very strong. I am sensitive to strong smells and this really bothered my nose. I had to return for a more subtle scent. But if you are not sensitive, this really makes you smell like you are wearing fresh clean laundry.", "CLEAN Warm Cotton smells like freshly laundered towels.  Yes, that's right, freshly laundered towels.<br /><br />I have a few requirements in a perfume.  It can't enter a room before me or stay behind when I leave, and it has to have a pleasant scent.<br /><br />CLEAN Warm Cotton is a light fragrance that sticks close to me, so it wins on that count.  It also does smell nice.  I love the smell of a clean towel coming out of the dryer as much as the next crazy person who enjoys smelling their laundry.<br /><br />But I'm not sure that I want to walk around smelling like laundry.  It's a nice fragrance.  But personally I'd rather smell like a spring garden than fresh laundry.", "This was my first bottle of this perfume and it won't be my last. It kept it's smell all day long and is light and soft. No headaches from the winneir. I will be ordering it again very soon.", "I love the smell of clean clothes. And this is the stuff is the TICKET!", "The smell is refreshing and lovely, but for the price, it doesn't last long on the skin. I had to re-apply it halfway through my day.", "Love the smell. The scent wears off in 2 hours", "Love The smell of freshness", "I like the smell of this perfume it reminds me of fresh laundry. Not to heavy or overpowering.", "The smell is light and stays with you all day", "When I was a tween I got this roller ball from sears that was called fresh towels. My nerdy love to clean self loves the smell of clean laundry so it was amazing to me.  Then as an adult I found this Warm Cotton. Oh I love it! Smells so good and fresh! Just like clean laundry.  Definitely recommend it! The scent lasts all day for me, it's not overpowering and in the year or so I've been wearing it, it's not caused a migraine", "This Eau de Parfum is great.  The scent smells clean and crisp and lasts a long time.  The closest to describe the scent, is it smells like fresh, sliced grapefruit.  I know that doesn't sound great, but it is such a refreshing clean smell that I spray it on my pillow case.  A friend thought the scent was from my hair (shampoo or hairspray) and wondered what I used.", "I thought buying perfume online would be risky because I hadn't tried it. But I'm so glad I purchased this from the description!! I love this scent. I've received numerous compliments since I switched to this perfume. It has a very clean but not too sharp detergent like smell. I wanted something refreshing but earthy with citrus hints and this is perfect.", "Love this parfum. Nice clean smell", "It is a clean smell but very strong, spray just a little bit.", "Great smell. Price too high for such a small bottle.", "Love this smell. Not my favorite in the clean collection, but then again I feel like nothing can be better than warm cotton.  Still get so many compliments on this.", "Just as you would think, it smells clean and refreshing.  Great product, and I haven't changed perfumes in years!  Love this smell!", "This is a lot like the original (clean soapy smell) except with a warm fresh from the dryer twist! More fabric softener smell than a soap smell! Love it!", "Love the smell", "light fragrance that doesn't smell flowery or fruity. It reminds me of the clean smell of then it rains in the woods.", "This is a wonderful light clean smell. Great for summer. I like that it's not a strong perfume smell.", "My husband is VERY picky about perfume. He has a nose like a blood hound and I'm trying to find a perfume that doesn't  arrive in a room before I do. I'm older and I hate when older women smell like they've taken a bath in whatever perfume they have on. This perfume is VERY subtle, in fact so much so that my husband asked me what perfume I had on. I told him it was Warm Cotton by Clean and told him I had been wearing it for about a week but he never said anything about it and I thought he didn't like it. He told me that he really liked it, that he only got a whiff of the smell every once in a while and that it smelled so clean, and I knew this was my new perfume.", "Its just a clean smell", "lovely clean smell, I have been using this perfume for a long time and have not tired of it yet", "This is what the wife wanted so this is what I bought smells like fresh clean laundry. It has it's own unique smell that isn't overpowering.", "Love the smell.", "My daughter loves this perfume so much she asked for it again for a christmas present. I found it on amazon and purchased the 2.14 oz bottle for $72.00.  She uses this sparingly because it is her favorite.  She noticed that is was not as strong as her previous bottle. I purchased this 4 months ago. and it literally has no smell.  She sprayed her neck 4 times and asked me if I could smell it.  I have a nose like a hound and I could barely smell the perfume. I will never order this from Amazon again as I this it is a ripoff and not the real thing!!!  It is perfume not toilette. Angry!!!", "My favorite linen smell. Very strong so you shouldn’t need more than 1 or 2 sprays. Lasts for several hours. I’m pregnant and obsessed with the smell of clean linen and I wear this daily. Also get compliments on how good I smell.", "Smells sooo clean and fresh but it is very very short lived. I had a compliment on how amazing it smells from someone who said perfumes usually give her a headache but this one was refreshing. It reminds me of a toned down cool water not nearly as perfumey but has the same fresh smell.", "Love the smell but it doesn't last long. The fragrance is almost unnoticeable. I have gotten lots of complements while wearing it. It is definitely one of my favorite fragrances.", "This is the cleanest laundry smell ever, my family loves it and my friends always say I smell clean. Not bad but you can get tired of it but great smell. I really like it.", "My husband and I love this product. No matter where I go everyone loves this smell. I have not heard one bad remark about it. This is now my signature scent.", "I love the clean smell. I get a lot of compliments on this perfume. I don't normally wear perfume because I haven't exactly found a fragrance that I love but this is great.", "This is the yummiest a clean smell can get in my opinion. Call me crazy but it's the perfect &#34;day 3 hair&#34; perfume in my opinion.. Long haired ladies I know you know that feeling, dry shampoo or not, your hair looks good but you need an extra boost to feel super fresh?<br />No?!<br />Yeah nevermind.. me neither I just like the smell.", "It's scent is wonderful just as it is, and blends well with your natural smell as well. It's never overpowering, and last all day, so no need to reapply. Love it!!", "I like t amazing clean smell", "This smells very much like Tide Clean Breeze with a hint of Surf powder crystals (when Surf smelled a bit fruitier than it does now). There are definite citrus notes - the first spray actually is similar to Lemon Pledge (a chemical lemon smell), but fortunately that note dissipates very quickly. It basically makes you smell like you dumped too much detergent in the washer and then skipped the rinse cycle. To me, it is less like the mellow,clean smell of clothes out of the dryer and more like the pungent, direct smell of pure liquid detergent right out of the cap. Like other Clean fragrances, it is not an offensive smell, but it is perhaps a bit too much like straight detergent. Wish it had more complexity. I do give the fragrance high marks for lasting power - I smelled like I bathed (but didn't rinse) in Tide Clean Breeze all day long.", "Very pleasant smell and last all day", "This is my favorite perfume. I'd give it 5 stars on smell alone, but it lacks a little bit of staying power to get the full 5 stars from me. It smells like clean skin you want to nuzzle next to. It has a very intoxicating quality to it. I absolutely adore this scent. I got the roller ball as well for mid-day reapplications.", "I love this perfume so much but it's not what it used to be. I received this as a gift (hence, no AVP badge) but it was purchased from Amazon. The last bottle I bought from Birchbox and it seemed to be stronger, although not by much. This stuff doesn't even last a few hours which is almost a crime since it costs nearly as much as most designer fragrances.<br /><br />Everyone else in my family loves the way this smells too - they all say the same thing, it's so light and clean, which is why I like it in the first place. I haven't found anything else that has such an unprocessed smell to it or I'd buy it instead. This just isn't a good enough value anymore, I have to find something else."], "reference": [5, 5, 3, 3, 2, 2, 2, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.4000000059604645, 0.5, 0.800000011920929, 0.800000011920929, 0.5, 0.5, 0.8999999761581421, 0.5, 0.10000000149011612, 0.5, 0.699999988079071, 0.5, 0.4000000059604645, 0.6000000238418579, 0.5, 0.8999999761581421, 0.4000000059604645, 0.8999999761581421, 0.800000011920929, 0.699999988079071, 0.6000000238418579, 0.800000011920929, 0.4000000059604645, 0.699999988079071, 0.699999988079071, 0.5, 0.800000011920929, 0.8999999761581421, 0.8999999761581421, 0.699999988079071, 0.8999999761581421, 0.10000000149011612, 0.800000011920929, 0.20000000298023224, 0.6000000238418579, 0.8999999761581421, 0.6000000238418579, 0.8999999761581421, 0.10000000149011612, 0.4000000059604645, 0.4000000059604645, 0.6000000238418579, 0.30000001192092896, 0.699999988079071, 0.8999999761581421, 0.3499999940395355, 0.699999988079071, 0.699999988079071, 0.033333333830038704, 0.6000000238418579, -0.10000000149011612, -0.10000000149011612]}