{"reviews": ["The name &#34;Warm Cotton&#34; sounded a bit bland but I was very pleased with the refreshing fragrance of this perfume that lasts for many hours. Initially when sprayed it seems strong, resembling clean laundry, freshly washed linens or towels but the main impression which remains is citrus with an underlying musk and hints of floral, honeysuckle and jasmine comes to mind. As with most perfumes, the ingredients in the product will blend with your personal skin oils  so it may be a bit different on different skin types. I thoroughly enjoy this perfume and appreciate the refreshing, clean and just showered feeling associated with this fragrance. Erika Borsos [pepper flower]", "Yep. You walk around smelling like super fresh laundry (Gain to be exact).  My male coworker smelled so good i inquired and lo and behold its a unisex scent. Go me! Careful folks, don't spray too much!", "This perfume smells like fresh, warm laundry - literally the name of it could not be more accurate.  It's a bit strong so you only need a tiny spritz.  My guy likes it on me too.  It makes me think of sunny, sleepy mornings cuddling in bed.  I had originally gotten a sample in my Birchbox and loved it so much I had to have it.", "I love the aroma of this scent and it is so great on linens.  Every time I change my sheets I spray the clean ones with this scent.  It is great.  The price for this size was great.  I have used this product for about 3 years since my sister introduced me to it and love it. The scent is like clean air dried laundry.  It is so clean and fresh smelling.  Just feel good sleeping with the scent or wearing it.  Have received excellent feedback from people when they do smell.", "This is a very strong citrus, almost pinesol like smell. While it makes you smell fresh, it's very very strong. I am sensitive to strong smells and this really bothered my nose. I had to return for a more subtle scent. But if you are not sensitive, this really makes you smell like you are wearing fresh clean laundry.", "CLEAN Warm Cotton smells like freshly laundered towels.  Yes, that's right, freshly laundered towels.<br /><br />I have a few requirements in a perfume.  It can't enter a room before me or stay behind when I leave, and it has to have a pleasant scent.<br /><br />CLEAN Warm Cotton is a light fragrance that sticks close to me, so it wins on that count.  It also does smell nice.  I love the smell of a clean towel coming out of the dryer as much as the next crazy person who enjoys smelling their laundry.<br /><br />But I'm not sure that I want to walk around smelling like laundry.  It's a nice fragrance.  But personally I'd rather smell like a spring garden than fresh laundry.", "Smells just like fresh laundry!", "I like the smell of this perfume it reminds me of fresh laundry. Not to heavy or overpowering.", "I love this scent. It is perfect very clean and crisp. People constantly ask me what I am wearing. It keeps you smelling like you just jumped out of the shower and threw on your favorite cozy robe that smells of bounce fabric softener. That is the only way I can describe it. It is the perfect mix of Soap and Clean laundry. I love it. It lasts all day and isn't overwhelming. The seller was easy to communicate with and the shipping was fast! I highly recommend this product! I usually purchase this from sephora but I gave it a chance and bought it online. It is NOT an imitation. The scent, bottle and packaging are identical. LOVE LOVE LOVE", "This perfume is just delightful.  Like clean laundry, warmth, and happiness. There's a bit of a soapy smell that lingers after the top notes (citrusy) have faded.  It's not a strong scent, but it's a comforting one.  Marc Jacobs, Dior, they say, &#34;Look at me!&#34; but Warm Cotton says, &#34;Be with me.&#34;", "When I was a tween I got this roller ball from sears that was called fresh towels. My nerdy love to clean self loves the smell of clean laundry so it was amazing to me.  Then as an adult I found this Warm Cotton. Oh I love it! Smells so good and fresh! Just like clean laundry.  Definitely recommend it! The scent lasts all day for me, it's not overpowering and in the year or so I've been wearing it, it's not caused a migraine", "If you like to smell like laundry and soap (I do) this is it. Many perfumes trigger my allergies, this never does. Kinda price-y but worth it to me... although I guess spraying Febreeze on my neck would also work. Ha.", "Smells like clean laundry.", "Love this perfume but I also love the way laundry smells.  Clean, just like the name, I have to admit, I wear this to the gym.  Not only am I never the stinky person no one wants to stand next to but frankly I smell great but not perfumy.", "I love this.  I get comments daily how I smell like fresh laundry!", "This is what the wife wanted so this is what I bought smells like fresh clean laundry. It has it's own unique smell that isn't overpowering.", "It's not very strong for very long and it really does smell deliciously clean. Plus it cracks me up to smell like laundry, what can I say.", "Smells like clean laundry! Great summer scent", "I love this scent! I am constantly being complimented on how wonderful and light this scent is.  In the mornings people say my area smells like \"fresh\" clean air.  They love the scent and I ask if it's too much since we're all different and find certain smells offensive or too much.  But everyone loves it and is always complimenting on it. My family and co-workers say the scent is like fresh clean air/laundry hung out to dry/clean linens/towels.  If you like soft light clean smelling clothes you'll love this scent.  Doesn't last though.", "Love the scent. I smell like clean laundry all day not scented perfumes that have gone stale. Fresh and clean.", "this is my absolute favorite perfume - my clothes smell like they just stepped out of a dryer after laundry"], "reference": [2, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.30000001192092896, 0.4000000059604645, 0.6000000238418579, 0.5, 0.4000000059604645, 0.20000000298023224, 0.699999988079071, 0.699999988079071, 0.8999999761581421, 0.8999999761581421, 0.6000000238418579, 0.10000000149011612, 0.4000000059604645, 0.5, 0.6000000238418579, 0.30000001192092896, 0.10000000149011612, 0.4000000059604645, 0.5, 0.4000000059604645, 0.5]}