{"reviews": ["This is my favorite scent which is precisely why I'm so upset with this purchase! I've used this perfume many times in the past but purchased it from Sephora. I decided to buy it on Amazon this time for the sake of convenience and regret it. This item seems watered-down or some sort of knock off because the scent does not last the way it should and has in the past. I'm very disappointed that I trusted purchasing a fragrance online. I would not recommend this item to anyone!", "This is my first review,<br />I purchased CLEAN Original Eau de Parfum spray, 1FL.oz, and I have to say while it does have a pleasant aroma of flowers and a clean fresh smell....I think that the flowery smell was just a little too strong for my liking. It definitely overpowered the clean,powdery,linen  smell I was looking for.<br />I have the CLEAN cotton Parfum spray which I am constantly getting compliments on and I was hoping this scent was similar to the cotton scent, but to no avail it was not.<br /><br />Now, because this is not a returnable product and It is just sitting on the counter without use.. Amazon was wonderful enough to refund my account for this purchase.<br />Just a little hint, before you buy a certain perfume, it does help to try it out in a store first, so you do not spend money on something that ends up being overpowering. Everyone smells different with the skin oils and what smells nice on 1 person may not smell the same on you.<br />Lesson Learned...", "Birthday gift for my wife (she mentioned she loved it but when someone else wore it but didn't know who made it). I love when my wife wears this! Not all floral. I can't handle that over powering floral scent of some of her other perfumes. Personal preference though.", "This is not the Rain scent I was expecting but my fault. I should have looked a little closer at this when ordering.  Hate the scent. I could have saved my money and just went out and rolled on the lawn.  I guess I'll try to give it away if I can but I have my doubts.", "Is this a knock off?  I can’t even smell a scent, and it’s supposed to be perfume.  Not happy.  Can’t ship back because no longer have packaging.  Plus deceiving picture/title which says 2.14 oz when it’s really only 1 oz.!", "wasn;t the scent I thought it was,  I thought it was just &#34;fresh&#34; not shower fresh, but it is ok", "I really do not like this...its smells like an old lady. Nothing like what it stated...more like moth balls...I am very disappointed and wish I would have chose a different scent.", "I got a tester of this and loved it. When I bought a whole bottle it smelled like really strong body soap. The scent lingers all day and it is not a nice smell. I would NOT recommend this scent and I would say it is NOT even close to the tester smell. YUCK!", "I bought this perfume from Clean in Shower Fresh scent along w/the scent AIR. Both scents are definitely not the same scent that I purchased in the past from other stores. Shower fresh scent is not good at all. I don’t knw if the company changed the scent or why they smell different & unappealing, but the Shower Fresh & Air scents smell awful. Wasted money on them because I will not wear them. So disappointed.", "This definitely is not the actual scent.", "I bought this product because of the Clean scent it's supposed to be, instead is very strong and heavy, wearing this will give me a headache.", "I love the real perfume, but if you are going to buy this go to a reputable store. I usually get mine from Sephora, but my husband bought me a bottle off of Amazon for Valentine's Day, not realizing there was such a thing as perfume knock offs. I didn't know where he bought it from, but I knew as soon as I used it that it was not the genuine product. The scent is similar, but has a sharp undertone, perhaps like it has been cut with alcohol or something, it just isn't right. I had to use way more than I would normally use and then it was gone in a ridiculously short amount of time. The real perfume I can still detect in the evening after wearing it all day long. I love the perfume (the real perfume), but buy elsewhere!!!!!"], "reference": [17, 5, 4, 2, 1, 1, 1, 1, 0, 0, 0, 0], "score": [-0.10000000149011612, -0.10000000149011612, -0.10000000149011612, -0.44999999552965164, -0.10000000149011612, -0.10000000149011612, -0.4000000059604645, -0.7000000178813934, -0.24000000059604645, -0.20000000298023224, -0.30000001192092896, -0.30000001192092896]}