{"reviews": ["I love this perfume, and someone else must have to because she swiped the one I had, I was thrilled to find it at Amazon!  I will continue to purchase it from Amazon in the future!", "I have come to grow and love the fragrance line from CLEAN...they don't disappoint.  The Skin fragrance is phenominal.  It will be my 5th purchase from the CLEAN line. It's light and natural.  It doesn't feel heavy or overpowering and you can wear it for any occasion.  My description of how it smells would be this:  You know when you try perfume on at the store, you usually put a spray on your wrist...later that day when the perfume has had time to mix with your own natural body scent, that is what this smells like coming out of the bottle.  Like a nice perfume mixed with the heat of your skin.  It really is quite lovely and has a nice linger to it that people will ask you what perfume you have on.  I highly recommend this if you want something that isn't overpowering.", "This is my first review,<br />I purchased CLEAN Original Eau de Parfum spray, 1FL.oz, and I have to say while it does have a pleasant aroma of flowers and a clean fresh smell....I think that the flowery smell was just a little too strong for my liking. It definitely overpowered the clean,powdery,linen  smell I was looking for.<br />I have the CLEAN cotton Parfum spray which I am constantly getting compliments on and I was hoping this scent was similar to the cotton scent, but to no avail it was not.<br /><br />Now, because this is not a returnable product and It is just sitting on the counter without use.. Amazon was wonderful enough to refund my account for this purchase.<br />Just a little hint, before you buy a certain perfume, it does help to try it out in a store first, so you do not spend money on something that ends up being overpowering. Everyone smells different with the skin oils and what smells nice on 1 person may not smell the same on you.<br />Lesson Learned...", "I could have bought a nicer branded perfume for the amount i spent on this one.  I felt the other review were misleading .", "This crisp, subtle scent is my absolute favorite perfume! It does not overwhelm the senses, and is both noticeable and feminine without being cloying or musky. It is not particularly strong, and thus the scent will not trail after you, but if someone is less than a foot away from you they will be able to smell and appreciate it.", "Great product, as expected I received a new bottle of clean perfume. It's the only perfume I can wear because of its mellow scent, it smells so fresh and so clean. It's the first time I've ordered it from Amazon and I'd do it again.", "Aroma such as if I just wear a fresh-washed clothes, smell of fabric softener.  I love fresh scents and when I read the reviews about this perfume I was thinking that this is what I need. My expectations were not fulfilled. In any case, I smell the freshness) anyway it was good experience. If you love l'eaupar Kenzo, D&G light blue, éclat, this one will be not so fresh, Warm cotton is really warmer and more sweet. And this one is not long-lasting..", "get compliments on this perfume.  Smells clean.  Only had one person say it smells like a dryer sheet, but I like it.", "The name &#34;Warm Cotton&#34; sounded a bit bland but I was very pleased with the refreshing fragrance of this perfume that lasts for many hours. Initially when sprayed it seems strong, resembling clean laundry, freshly washed linens or towels but the main impression which remains is citrus with an underlying musk and hints of floral, honeysuckle and jasmine comes to mind. As with most perfumes, the ingredients in the product will blend with your personal skin oils  so it may be a bit different on different skin types. I thoroughly enjoy this perfume and appreciate the refreshing, clean and just showered feeling associated with this fragrance. Erika Borsos [pepper flower]", "I love this scent. I also love that it last all day. When I think it's faded,people tell me how great I smell.  When I wear this perfume, I receive so many compliments from both men and women. If I had to compare this to something, I would say it smells like Downy fabric softener but better. The cost is not too bad either.", "This perfume is my favorite scent of all time! I am very sensitive to smells and most perfume on the market is too potent and gives me a headache but this is so light and refreshing. I get so many compliments and have been using this perfume for years. I'm so happy that it is available on Amazon since Sephora no longer sells this in stores it can be hard to find. The perfume smells like dryer sheets and gives you a clean fresh feeling. I would highly recommend it.", "Absolute favorite fragrance yet. I’m a perfume junkie and there’s just something about Clean warm cotton that makes me want more. It’s a sweet, cotton/fresh laundry scent that lingers for awhile, and makes you smell like you just jumped out of the shower. It’s comforting and I receive a lot of compliments anytime I wear it. My head and nose are becoming more sensitive to perfume in general, but this one isn’t cloying or headache inducing. I’ve heard others say it smells way too much like dryer sheets, heavy soap, or fabric softener, but I just don’t get that from warm cotton. It has an element of sweetness that I can’t put my finger on, maybe it’s the orange flower. Love it. Wish it was sold in a 3.4 oz bottle too!", "I love the way this perfume smells, every time I walk into a room someone always asks what fragrance I am wearing. This is my new favorite!!! would definitely order from amazon again and again. thank you  Amazon for your great product selection and prices.", "Everyone's body chemistry is different; on me this perfume smells like concentrated Fabreze and fabric softener. Not for me, thanks.", "This perfume is very strong, so spray lightly and step into it.<br />It absolutely smells like traditional shampoo, clean, and fresh out of the shower.", "This perfume is not overpowering but makes you smell clean all day long. I get so many compliments when I wear it. I have used it for 2 years and never get sick of wearing it.", "This perfume smells like fresh, warm laundry - literally the name of it could not be more accurate.  It's a bit strong so you only need a tiny spritz.  My guy likes it on me too.  It makes me think of sunny, sleepy mornings cuddling in bed.  I had originally gotten a sample in my Birchbox and loved it so much I had to have it.", "best smelling perfume ever!", "This perfume smells so fresh and clean. I receive compliments whenever I wear it.", "I have this perfume. I wore it one day and my friend fell in love with it. So I ordered it for her and she loves it also. I only wish I could have gotten her the larger bottle. It really smells like beautiful detergent.", "Irresistably &#34;clean&#34;, fresh aroma, perfect perfume for summer!", "This perfume is very clean and not overpowering at all, yet people will know you have it on. It isn't a perfume that someone standing next to you is going to think, &#34;Did she take a bath in that perfume?&#34; It's very light, something someone will notice every once in a while and will come up to you and say, &#34;What's the name of that perfume you have on, I really like it.&#34; Even my husband (who doesn't like perfume at all) LOVES this perfume.", "I recently ordered this perfume because I tried it on at Sephora and fell in love! This is a very sexy perfume and it lingers long after you put it on. I received so many compliments from that one sample spritz that I had to buy it. The scent is light, not soapy and not overpoweringly floral. It just smells like a very delicate bouquet that leaves you wanting more.", "I enjoy a number of the Clean scents, but not so much this one.  This perfume smells mostly like flowers and musk.  I'm not sure which flowers, it's hard to tell.  Both the florals and the musk are definitely noticeable.  It didn't smell much like clean skin to me.  The Clean perfumes aren't supposed to smell like traditional perfume, they're supposed to just smell good.  I felt like this one fell short of that.  It smells like perfume.  That's not in and of itself a bad thing (I mean, I LOVE perfume), but this is not a perfume I would select. I'm not a big fan of obvious musks, and this one has a pretty obvious musk note to it.", "I bought this perfume from Clean in Shower Fresh scent along w/the scent AIR. Both scents are definitely not the same scent that I purchased in the past from other stores. Shower fresh scent is not good at all. I don’t knw if the company changed the scent or why they smell different & unappealing, but the Shower Fresh & Air scents smell awful. Wasted money on them because I will not wear them. So disappointed.", "This is a nice clean scent that smells very much like a half a dozen scents out there. It lasts about a minute on the person, however. This is a very small bottle, and I feel there are scents out there so similar in scent and quality at a better price. It is definitely not a heavy perfume, and will not be offensive to coworkers or others in small spaces.", "CLEAN Warm Cotton smells like freshly laundered towels.  Yes, that's right, freshly laundered towels.<br /><br />I have a few requirements in a perfume.  It can't enter a room before me or stay behind when I leave, and it has to have a pleasant scent.<br /><br />CLEAN Warm Cotton is a light fragrance that sticks close to me, so it wins on that count.  It also does smell nice.  I love the smell of a clean towel coming out of the dryer as much as the next crazy person who enjoys smelling their laundry.<br /><br />But I'm not sure that I want to walk around smelling like laundry.  It's a nice fragrance.  But personally I'd rather smell like a spring garden than fresh laundry.", "This is great scent. It's fresh, crisp and clean. Honestly , I think it would work for a man or woman. Very little goes a long way so , it's an excellent value. I would consider this a long lasting scent.<br />Rarely I would suggest using a perfume for refreshing a garment but this scent works perfectly for freshening up coats,<br />Overall a perfect casual everyday scent. This is going to be my signature scent.", "I love this perfume. It smells like clothes fresh from the dryer! Fresh and clean and pretty too.", "This is my favorite perfume. I'd give it 5 stars on smell alone, but it lacks a little bit of staying power to get the full 5 stars from me. It smells like clean skin you want to nuzzle next to. It has a very intoxicating quality to it. I absolutely adore this scent. I got the roller ball as well for mid-day reapplications.", "This was my first bottle of this perfume and it won't be my last. It kept it's smell all day long and is light and soft. No headaches from the winneir. I will be ordering it again very soon.", "I love this perfume so much but it's not what it used to be. I received this as a gift (hence, no AVP badge) but it was purchased from Amazon. The last bottle I bought from Birchbox and it seemed to be stronger, although not by much. This stuff doesn't even last a few hours which is almost a crime since it costs nearly as much as most designer fragrances.<br /><br />Everyone else in my family loves the way this smells too - they all say the same thing, it's so light and clean, which is why I like it in the first place. I haven't found anything else that has such an unprocessed smell to it or I'd buy it instead. This just isn't a good enough value anymore, I have to find something else.", "I love this perfume. It smells great", "i just can't stop ordering this perfume it just makes you smell clean ... i luv it", "I like the smell of this perfume it reminds me of fresh laundry. Not to heavy or overpowering.", "I really enjoy the nice clean fresh scent of this perfume. It is not an overpowering scent so it is great for everyday wear. I will knock a star off because it doesn't have the staying power of some perfumes. Overall a nice product particularly heading in to Spring and Summer when a lighter scent in the heat of the South may be desired.", "I am very happy with this perfume.  It's a light and clean fragrance. I would definitely by this product again.", "Best perfume", "This perfume is just delightful.  Like clean laundry, warmth, and happiness. There's a bit of a soapy smell that lingers after the top notes (citrusy) have faded.  It's not a strong scent, but it's a comforting one.  Marc Jacobs, Dior, they say, &#34;Look at me!&#34; but Warm Cotton says, &#34;Be with me.&#34;", "I should have listened to previous reviewers. I really love this scent, but it does not last more than an hour or two. I have to reapply constantly and went through almost a half bottle in a few weeks. Usually perfume lasts me months, even years. So, as much as I like the smell, I can't give it 5 stars because it fades way too quickly and is not really worth the price for that quality.", "You know, anything that comes from CLEAN is good, including this perfume, which is on my top tem list, great!", "It’s perfume...", "IT. SMELLS. LIKE. SOAP. So, I’m gonna use it to freshen up my clothes if they’ve been worn but aren’t dirty. Idk who would wear this as perfume bc I’d be like, go outside and air out! Ugh!", "I thought buying perfume online would be risky because I hadn't tried it. But I'm so glad I purchased this from the description!! I love this scent. I've received numerous compliments since I switched to this perfume. It has a very clean but not too sharp detergent like smell. I wanted something refreshing but earthy with citrus hints and this is perfect.", "Love, love, love this perfume. Smells so clean. This is my favorite out of all of their line. Get tons of compliments.", "Only perfume I use.", "Smells so fresh! Smells just like fresh linen. This is my second purchase. It's the only perfume I use. I highly recommend it.", "Love this perfume but I also love the way laundry smells.  Clean, just like the name, I have to admit, I wear this to the gym.  Not only am I never the stinky person no one wants to stand next to but frankly I smell great but not perfumy.", "Love love love this perfume! It smells so fresh and clean!", "I absolutely love this - I have been look for a new perfume and got this as a sample and feel in love - this is my new go to perfume", "My wife got an sample of this perfume in a sample box and loved it.  She came on here to order, because it was cheaper!  It smells nice!", "I love this perfume...I smell like I just rolled out of a basket of freshly washed clothes...OMG. ..this is the best scent...will def buy again", "I am so surprised !  I use many top brand name fragrances and smell great all the time.<br />Recently received a rollerball sample of CLEAN Rain.  ( Not from Amazon )<br />I had not heard of this brand.  It didn't sound very enticing by the name so it sat on my dresser for a while.  One day I applied some to the back of my neck.  My goodness What a reaction !  My boyfriend,  who rarely comments on my perfume ,  was so complimentary. Needless to say,  we stayed home that afternoon postponing those errands we had intended to run.<br />I'm so glad to find I can purchase this remarkable fragrance from Amazon.  The largest size of the spray is a really good deal.<br />Thanks Amazon.", "My all time favorite perfume! Doesn't even bother my asthma. I get tons of compliments on how I smell & feel, as the brand name implies, CLEAN,  even at the end of the day. They have other great scents as well.", "My best friend uses this perfume, and I got it as a gift. It Smells amazing, and I don’t get any headaches! A very light scent that isn’t too overpowering.", "This is the cleanest and most freshest perfume on the market. I get the most compliments when I wear it. The only thing is, it doesn't last very long. But, if you use the shower gel, and the lotion, then the perfume will last a bit longer. Just carry it with you to freshen up throughout the day. Lastly, you can over spray it and won't ever be too strong.", "lovely clean smell, I have been using this perfume for a long time and have not tired of it yet", "I was very disappointed by the fragrance. It's not horrible but really don't care for it and it can't be returned. I won't buy perfume from Amazon again unless it's one I've used before.", "My daughter loves this perfume so much she asked for it again for a christmas present. I found it on amazon and purchased the 2.14 oz bottle for $72.00.  She uses this sparingly because it is her favorite.  She noticed that is was not as strong as her previous bottle. I purchased this 4 months ago. and it literally has no smell.  She sprayed her neck 4 times and asked me if I could smell it.  I have a nose like a hound and I could barely smell the perfume. I will never order this from Amazon again as I this it is a ripoff and not the real thing!!!  It is perfume not toilette. Angry!!!", "I received before time<br />Love the scent and it is a very soft day time perfume. Very well sealed. Packing was good as well.", "Love it ! ! This was my first perfume, and just finished it couple weeks ago. Just as its name &#34; rain &#34;, it is really fresh and light. It is not lasting very long ( about a day so ). It smells like &#34; grass after the rain mixed with cucumber and avocado&#34;. Good for spring and summer.", "I love the real perfume, but if you are going to buy this go to a reputable store. I usually get mine from Sephora, but my husband bought me a bottle off of Amazon for Valentine's Day, not realizing there was such a thing as perfume knock offs. I didn't know where he bought it from, but I knew as soon as I used it that it was not the genuine product. The scent is similar, but has a sharp undertone, perhaps like it has been cut with alcohol or something, it just isn't right. I had to use way more than I would normally use and then it was gone in a ridiculously short amount of time. The real perfume I can still detect in the evening after wearing it all day long. I love the perfume (the real perfume), but buy elsewhere!!!!!", "I love this perfume and i've been using it for 4 years now, i can never live without it", "You cannot go wrong with this perfume!!! This is my signature scent. Guys, if you are looking for a perfume for your significant other that will not over-power the entire room, this is it. I get compliments from everyone! Best decision I've ever made.", "I love the clean smell. I get a lot of compliments on this perfume. I don't normally wear perfume because I haven't exactly found a fragrance that I love but this is great.", "This is the yummiest a clean smell can get in my opinion. Call me crazy but it's the perfect &#34;day 3 hair&#34; perfume in my opinion.. Long haired ladies I know you know that feeling, dry shampoo or not, your hair looks good but you need an extra boost to feel super fresh?<br />No?!<br />Yeah nevermind.. me neither I just like the smell.", "I am very picky with perfume, but this smells so fresh and clean, exactly what I like...and the price is much lower than most perfumes", "Ever since I have discovered this scent at Sephora it has been a staple!!! If you love fresh and clean this is the PERFECT scent for you! I ALWAYS get complimented when I wear this perfume. I’m happy I found it here on amazon since Sephora discontinues carrying this line.", "this is my absolute favorite perfume - my clothes smell like they just stepped out of a dryer after laundry", "My husband is VERY picky about perfume. He has a nose like a blood hound and I'm trying to find a perfume that doesn't  arrive in a room before I do. I'm older and I hate when older women smell like they've taken a bath in whatever perfume they have on. This perfume is VERY subtle, in fact so much so that my husband asked me what perfume I had on. I told him it was Warm Cotton by Clean and told him I had been wearing it for about a week but he never said anything about it and I thought he didn't like it. He told me that he really liked it, that he only got a whiff of the smell every once in a while and that it smelled so clean, and I knew this was my new perfume."], "reference": [9, 7, 5, 4, 3, 3, 3, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.6000000238418579, 0.30000001192092896, 0.30000001192092896, 0.6000000238418579, 0.6000000238418579, 0.550000011920929, 0.6000000238418579, 0.699999988079071, 0.7999999821186066, 0.5, 0.6500000059604645, 0.30000001192092896, 0.699999988079071, 0.10000000149011612, 0.699999988079071, 0.6000000238418579, 0.699999988079071, 0.8999999761581421, 0.8999999761581421, 0.10000000149011612, 0.6000000238418579, 0.2833333412806193, 0.5, 0.1333333378036817, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.5, 0.8999999761581421, 0.800000011920929, 0.4000000059604645, 0.20000000298023224, 0.8999999761581421, 0.699999988079071, 0.699999988079071, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.10000000149011612, 0.6000000238418579, 0.10000000149011612, 0.20000000298023224, 0.10000000521540642, 0.8999999761581421, 0.20000000298023224, 0.4000000059604645, 0.699999988079071, 0.800000011920929, 0.800000011920929, 0.4000000059604645, 0.699999988079071, 0.6000000238418579, 0.8999999761581421, 0.30000001192092896, 0.4000000059604645, 0.8999999761581421, 0.10000000149011612, 0.3499999940395355, 0.699999988079071, 0.10000000149011612, 0.5499999970197678, 0.8999999761581421, 0.44999998807907104, 0.550000011920929, 0.30000001192092896, 0.800000011920929, 0.5, 0.5, -0.020000000298023225]}