{"reviews": ["You'd think I'd learn by now not to try a new perfume/cologne without actually SMELLING it first (and end up throwing away my money), but I've done it again.  This fragrance has a sharp chemical odor, and according to my husband, it also smells cheap.  Maybe this bottle is from a bad batch - maybe it's not even authentic.  Whatever the case, no more relying on customer reviews and ordering new fragrances online.", "This is one of my favorite perfumes. The smell is so refreshing and energizing. few sprays are enough and will last the whole day. whenever I am wearing it, I get compliments on how good I smell. It feels as if I just had came out of the shower! I live in the Middle East and this perfume is not available here. I got it the first time from the US a few years ago, and I was extremely happy to find it on Amazon. I ordered half a dozen online because I don't want to run out of it! I have a small roll on bottle that I always keep in my bag. whenever I need to feel energized, I apply some on my wrist and my neck and I feel instantly fresh and invigorated.", "I tried this perfume at a big mall dept store and loved it but didn't love the almost $40 price.  It has such a clean, almost soapy scent that I love.  A great scent to use when you need a change.", "This perfume did NOT smell like fresh clean laundry - smelled like bug spray!", "Is this a knock off?  I can’t even smell a scent, and it’s supposed to be perfume.  Not happy.  Can’t ship back because no longer have packaging.  Plus deceiving picture/title which says 2.14 oz when it’s really only 1 oz.!", "I mean, I *get* it: Warm Cotton. I sampled it in a store and thought, \"Oh my goodness, this smells amazing. So...familiar.\" Well, of course it does! Save yourself the money and just use fabric softener in your laundry! Smells just like fabric softener so why bother spending $xx on perfume? Just spend the five bucks on Downy or Febreze.<br /><br />Bottom line: not worth it.", "I have been searching for a light, clean smelling perfume that doesn't have an overpowering scent. Someone at Sephora's recommended a scent from the CLEAN line and recommended SKIN. It smelled good on the sample strip so I purchased it. When I got home I opened the box, removed the perfume and tried a small amount on my wrist. It smelled so bad I couldn't stand it. While I was doing chuores, I keep smelling it. I couldn't take it anymore so I had to wash it off with soap and water. I do not recommend this perfume for people looking for a light, clean smelling perfume. If I were a man, I would NOT like smelling this on a woman. And indeed it is way over priced. I am going to give this perfume to someone who will appreciate it. I know I didn't. I hope this review helps you in your decision on purchasing this item. Thank you!", "this perfume is not the same one I bought a while ago.  the smell looks like bathroom disinfectant 🤬 I'm just F * angry, and the worst of it is that I can't return"], "reference": [3, 2, 1, 1, 1, 1, 0, 0], "score": [-0.20000000298023224, -0.10000000149011612, -0.4000000059604645, -0.5, -0.10000000149011612, -0.10000000149011612, -0.07999999970197677, -0.20000000298023224]}