{"reviews": ["Literally smells like toilet cleaner *gags* After reading the majority of positive reviews, I'm starting to question whether or not these people live in outhouses, a barn or maybe just a giant pile of burning garbage?!<br /><br />Let's put it this way: If you don't like the smell of bathroom cleaners, then this is not the fragrance for you! If you do, then I highly recommend hitting up the cleaning product aisle at your local Walmart because Lysol and Febreze are cheaper... and actually smell a hell of a lot better then this crap!😷 Ew.", "I've bought this parfum due to the great reviews but was a little bit disappointed coz it smells exactly as the soup cleaning Tide-which i don't really like- if you admire the smell of Tide this is the perfect parfum for you.", "Don't like the smell at all and apparently cannot return it😡", "I got a tester of this and loved it. When I bought a whole bottle it smelled like really strong body soap. The scent lingers all day and it is not a nice smell. I would NOT recommend this scent and I would say it is NOT even close to the tester smell. YUCK!", "This is my favorite perfume. I'd give it 5 stars on smell alone, but it lacks a little bit of staying power to get the full 5 stars from me. It smells like clean skin you want to nuzzle next to. It has a very intoxicating quality to it. I absolutely adore this scent. I got the roller ball as well for mid-day reapplications.", "I love this perfume so much but it's not what it used to be. I received this as a gift (hence, no AVP badge) but it was purchased from Amazon. The last bottle I bought from Birchbox and it seemed to be stronger, although not by much. This stuff doesn't even last a few hours which is almost a crime since it costs nearly as much as most designer fragrances.<br /><br />Everyone else in my family loves the way this smells too - they all say the same thing, it's so light and clean, which is why I like it in the first place. I haven't found anything else that has such an unprocessed smell to it or I'd buy it instead. This just isn't a good enough value anymore, I have to find something else.", "I should have listened to previous reviewers. I really love this scent, but it does not last more than an hour or two. I have to reapply constantly and went through almost a half bottle in a few weeks. Usually perfume lasts me months, even years. So, as much as I like the smell, I can't give it 5 stars because it fades way too quickly and is not really worth the price for that quality.", "The smell is not what I expected", "Too lemony. Awful underlying smell. Doesn't smell like soap.", "Finally recived. Original and same smell ❤️But very slow service", "this perfume is not the same one I bought a while ago.  the smell looks like bathroom disinfectant 🤬 I'm just F * angry, and the worst of it is that I can't return", "Wth....It smelled like watered down alcohol...only a very faint smell of the (real) skin fragrance....was so disappointed!!! My previous bottle was 3 time stronger and last all day. Did they messed up the formula?"], "reference": [3, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0], "score": [-0.4000000059604645, -0.20000000298023224, -0.8999999761581421, -0.6000000238418579, -0.10000000149011612, -0.10000000149011612, -0.699999988079071, -0.6000000238418579, -0.30000001192092896, -0.10000000149011612, -0.699999988079071, -0.5]}