{"reviews": ["I bought these for my husband to listen to the TV at night in bed. Thus, I do not have to hear the TV.  First the pros, they seem well made, I like the case, they charge fast, they connect quickly via Bluetooth to the TV, the sound comes through loud and clear, the battery lasts all night.  Now for the cons, the different ear pieces don’t seem to be shaped for a good fit in the ear —- they are more round and need to be narrower, (my husband uses the smallest size and his ears are normal size for a man, the next size up was too big), the volume control is either loud or mute—doesn’t seem to adjust easily and the direction on how to do the volume adjustment are not very clear or do not seem to work very well. I want to adjust the volume on the ear piece and not have to down load an app to do it. Overall, for the price, I did expect more but my husband does like them.  I bought a cheap pair of another JBL model for myself and I actually like mine better. But, I only listen to ebooks and movies on an iPad with mine.", "I use these to drown out my old lady snoring.  I use one at a time, and it’s lasting over 8 hours.  I Donny have to get up a change it out.  The only thing I wish I knew prior to purchase, was the noise canceling only works when you have both ear buds in.  Not that big of a deal.  Noise canceling works fine when using both.  I was going to buy the beats ear buds, but these were half price.  I’m sure the beats have better sound.  Very happy with the purchase", "Too Quiet?? iPhone users you MUST adjust (or turn off) the “Headphone Safety” feature in iOS Settings. By default it will throttle all headphones to be very quiet. It’s not the fault of these headphones!<br /><br />Having gone through several pairs of no name head phones.. it makes sense to just buy a known name brand sometimes.<br /><br />These really sound great. Very clean deep satisfying bass but not overpowering. Excellent highs and overall a very bright and rich experience. I can hear extra elements of the music that I didn’t hear with cheaper headphones.<br /><br />The ANC is good (not perfect) but definitely fills a need. If you’re a person that plans to use them for ANC alone (no music play) these are NOT for you. They just help isolate the extra noise when you’re listening to music or movies or podcast.<br /><br />Make sure to download the app and setup a custom EQ etc etc. That’s a big part of what makes these headphones great.<br /><br />Are they the best I’ve ever heard? Or are they as good as my $400 Bose headphones? Absolutely not. But they’re comfortable and compact and don’t break the bank.<br /><br />JBL has always been great quality at an affordable price. Reliable and dependable.<br /><br />Thanks JBL!", "Got these for 50% off on Amazon. They sound good for the price. One big drawback is the instructions leave a lot out. I had to rely on YouTube for details on operations instructions. Once I finally figured out how to operate them, it was pretty easy. The battery last a fair amount before it needed to be recharged. Recharging is easy, just drop into the case for however long you want, the longer in the case the bigger the charge, I usually leave them in overnight to fully recharge them. Once the case needs to be recharged, I just plug in the us c cable, you’ll see the number of lights go from 3 to 1. You will see the battery level for the earbuds on your device next to the headphone icon. I like them because they’re comfortable in bed.", "I am not an Acoustics Engineer but these ear buds sound great!<br />My 2/3-year-old earbuds died, I use them regularly and researched various brands, types, and quality levels. I settled on these because Amazon listed them as a “Limited Deal” at half their regular price, at $50 they are a real bargain!<br />This model has active noise reduction, true stereo sound reproduction, and a comfortable, secure fit.<br />I set them up and paired them with my iPhone 13 Pro Max 3 minutes after I opened the package and began listening. I downloaded the app and was able to customize the sound to my personal tastes, another feature that is appreciated and doesn't come with other brands in the same or similar price range.<br />I highly recommend this product!", "Great quality for the price of $49.99. I may be confused on noise cancelling with air buds vs over the head noise canceling. It doesn’t block out noise unless you’re listing to music. I got them for music so it works fine for me.", "My daughter has a set of JBL's and likes them. I've tried them out and did  too so I ordered these for Christmas. Early self-gifting! Ho ho ho! They're my first pair of ear buds.<br /><br />The Good Stuff - they were easy to set up, I can use them with my phone and flat screen, as well as my laptop. The sound is great and they're fairly easy to pair. Once paired they connect to my iPhone as soon as I take them out of the case so use is easy and relatively trouble free. The case is simple to charge them in and the case is simple to charge up. I've had these for almost 2 weeks, and charged once so far, but they didn't need it, I just did it. There appears to be plenty of juice for how I expect to use them.<br /><br />The Pretty Good Stuff - they're not small but they do fit well in my ear. I might prefer a smaller device in the future but for my first set these are great and I won't change out till and when and if these stop working or I lose them, which I hope isn't any time soon so - they may be it for me, which is fine.<br /><br />The Learning Curve Stuff - the touch sensitive controls are okay for me, but I'm still getting comfortable with what does what when. I can always use my phone to pickup, adjust volume, etc. I'm probably another couple weeks out from being at ease using them. Others may not have any problem.<br /><br />I give them 5 stars because they appear to be exactly what they advertised and do what I wanted them to do. For the price they're a great value, for me.", "I was very pleased with these earbuds at first, great sound, and excellent noise canceling for the price.  Flash forward to 3 months later the sound quality in the right ear stopped working.  I have tried to clean, tried to reset everything but still have the same thing happen.  The weird thing is that at first, it starts ok then progresses back to quiet.  In the end, I should have gone with something more pricey that may have better quality.  I may try one more thing if it works I will remove the review, until then consider this my full review.<br />*Update*<br />Was able to bring it back by soaking the tip of the earbud (without the cover) in alcohol for about 20 min, blowing into it directly after,  and letting it dry fully.  Don't dip the whole thing though. after 24 hours of letting it sit it was perfectly fine.", "Sound quality, battery life and gestures to use while wearing are all great-especially for the price.  i also liked that they included 3 different sizes of rubber pieces for great fit and more noise reduction.  Mic great for clear calls!", "Not as good for noise cancelling over say, Bose but work fairly well. I use them in the tractor and I like it quiet and able to hear my tunes clear, these are louder than my Bose but for the price, make a good second set when the battery dies on the other set. (I am usually out for 8-12 hours, so they both usually die around 6-8 hours)", "I got these for work so I could listen to music and talk to my kids. They are really nice and comfortable. They sound great. I have tiny ears so the different ear pieces helped me get the right fit. And the price was great to.", "Bought these to listen to music and calls. The bass response is impressive as is the sound quality. The battery life is great as well. Hard to beat at the price. Call quality is excellent as well and clear on both ends. I like the pass through feature that allows me to attenuate the music to a lower level and hear all ambient sounds.", "Only a week (6hrs) of use but I thought I would provide a report. Plenty of battery left; sound is excellent; price is right; Bluetooth sync worked well.", "The good sound of jbl I used to know and the noise canceling works well too.  Really good price. Comfortable to wear.  very satisfied.  Much more satisfying than the very expensive and breakable Bose.  what more do i want?", "Great product great price great quality", "Comfortable fit. Good sounds for the price.", "I finally found wireless with good quality and affordable price.  I’ve wanted some for a while, but pricing for other brands was scary, especially for something that I could lose.  I’m happy I purchased.", "I purchased my JBLTUNE130 earbuds on Black Friday for half the price and for the price they are not bad at all. Instead of the buttons, they are touch sensitive and may be annoying if you use your earbuds to sleep, constantly wear hoods, or workout with these and sweat a lot. From reading other reviews, there are only three different sizes for your ears and it is hit or miss if they will fit yours because of so many unique ear shapes. If you travel in loud areas, the sound is not too loud to overcome musicians on the streets or the hustle and bustle of catching the train everyday but want the balance of quality and price, these are it.", "Bought these because of the reviews on their sound and the 10 continuous hours of playtime with 2 hour charge time. They perform as advertised! I used them on an 8 hour flight with no problem. Very good sound quality. Good noise cancellation. Can’t beat them at this price.", "Great product but it’s what I would expect from JBL. The bass is really good. My kids have apple airpod pro-the newest ones and they do NOT sound as good as these. Apple does an incredible job marketing their products because they certainly are not superior-especially in the earbud department. Do yourself a favor and buy these. Excellent sound quality for an incredible price! It’s JBL-they know how to build speakers!", "With a little EQ work they can sound as good as Sennheiser 2 which cost double the price.  Definitely need to raise the vocals up on EQ.. I raised the vocals about 3 bars and raised the lows and mids about 1 bar... It's hard to tell my Sennheiser 2 and these jbl apart after the EQ settings. They are also very comfortable in my ears. Not sure how long they will last or battery life yet.", "I like the JBL product.  had already picked a pair up for me from a store and found that these little buds are better than some of the more expensive ones.  picked up another pair for my wife and she got jealous that I didn't need my headphones anymore.  good product for the price.  good bass and works great with your iPhone for phone calls, music and movies on a flight.", "Got it at half price. Amazing sound for the price. Bass is there no question and for earbuds there is really really good seperation of sound. Its not easy to find in this price range. Get it NOW.", "If you consider the price, the product is of quite good quality. Noise cancelling is not that good but sounds are good", "Great product for the price", "The sound quality is amazing. Noise cancelation could be just a little better. They are very comfortable in the ears, have had no issues with them falling out. Overall very good headphones for the price!", "I bought 3 of these. The sound is AMAZING! In my opinion they’re better then apple AirPods. If I had the money I’d purchase a bigger Bluetooth one for my home. The bass is great, it’s easy to answer calls with them. They’re compact and fit comfortably in my ears and typically I can’t stand earbuds. I love these. I got myself these and both my boys. My kids are in their teens and they LOVED them as well. The price was great!", "more tha i bargained for  ,price was great.  best ones i have owned yet.", "Could be a little louder. The sound quality is unbeatable and off sets my gripe about the volume. Arrived fast. Great price and quality! Love these JBL's!", "I left my previous pair of JBL Bluetooth headphones in a hotel while out of town so decided to give these a try because they were a great price. They were deliver to the wrong house in my subdivision and my neighbor acted like he didn’t have them 🙄. Amazon replaced them of course so was delighted to receive them. Let’s ve everything but I can’t wear them because they fall out my ears just walking around normally. Definitely can’t wear to the gym or doing anything active. I should have returned but think I missed my window of opportunity. I do not recommend.", "I have been a long time JBL customer. I find their products decently priced, easy to use, and sound quality is usually good. These earbuds are very comfy and light. I can wear them for hours with zero pain. With that said, they don’t feel secure right away. Took some getting used to. The default sound is alright but these link to the JBL app and you can alter the eq to your liking which I love. For the price and performance I definitely recommend. Especially if you wear earbuds for long periods of time. I will say the noise cancel feature isn't great. If you are buying specifically for that feature, I’d skip these.", "Good price if the noise canceling worked.<br /><br />Pros: good sound quality and battery life.<br /><br />Cons: noise canceling is practically useless. Just sounds like a little white noise layered on top of everything else.  Doesn’t actually block any noise - foam safety ear plugs work better than these.  Also the fit is terrible - they fall out of my ears all the time, regardless of what plug set I use.<br /><br />Would not buy these again or recommend to anyone.  Much better earbuds available at a lower price - granted those won’t have NC, but these basically don’t have NC either, so the price point is not justified.", "Nice a high quality sound for their price. Not the best Noise cancelling system", "Great sound and excellent price!", "Best Bluetooth device i've ever experienced for the price, but the bad thing its too easy to loose.", "The audio quality is very good especially for the price. They are also durable and have great battery life. However it has happened to me multiple times where the earbud will get stuck in your ear. It is not a well-designed product.", "This product is worth it's price💯 great price", "The buds are fit for purpose for the price they are sold at. But do not expect them to hold in ear as much as you think. They usually keep falling off very often."], "reference": [44, 13, 7, 7, 4, 4, 3, 2, 2, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.30000001192092896, 0.10000000149011612, 0.800000011920929, 0.4000000059604645, 0.45000001788139343, 0.6000000238418579, 0.6000000238418579, 0.800000011920929, 0.8999999761581421, 0.20000000298023224, 0.800000011920929, 0.699999988079071, 0.800000011920929, 0.8999999761581421, 0.800000011920929, 0.6000000238418579, 0.800000011920929, 0.500000019868215, 0.6000000238418579, 0.8999999761581421, 0.4000000059604645, 0.699999988079071, 0.30000001192092896, 0.4000000059604645, 0.6000000238418579, 0.800000011920929, 0.8999999761581421, 0.800000011920929, 0.8999999761581421, 0.6000000238418579, 0.800000011920929, 0.5, 0.699999988079071, 0.8999999761581421, 0.30000001192092896, 0.800000011920929, 0.800000011920929, 0.20000000298023224]}