{"reviews": ["I bought these to help filter out noise at the office generally for music listening. I will split the review into three section: Noise Cancelling, Sound Quality, and Other.<br /><br />Noise Cancelling:<br />They will work for some people but not all. At the home office they work great, they filter out the frequency of noise produced by computer fans. However, I don't believe the noise cancelling is all that adaptive, rather it is just filtering a fixed number of frequencies. For example, the higher frequency noise from my air purifier is still noticeable, but dampened. This seems to be the case with all noise. I would expect their algorithm is doing something like filtering out the average frequencies in the average environment so overall you do indeed get a quieter listening experience.  ̶I̶ ̶f̶i̶n̶d̶ ̶t̶h̶e̶ ̶\"̶A̶m̶b̶i̶e̶n̶t̶ ̶A̶w̶a̶r̶e̶\"̶ ̶s̶e̶t̶t̶i̶n̶g̶ ̶t̶o̶ ̶b̶e̶ ̶t̶h̶e̶ ̶q̶u̶i̶e̶t̶e̶s̶t̶.̶  (UPDATE: Meant to say ANC (duh) slightly confusing what mode I was in based off of the quick start manual. Ambient would be if you wanted to hear more than if the ANC was just off.) For the price this is very acceptable. The more adaptable, on the fly noise cancelling algorithms are extremely difficult to implement, and hence you pay a premium for them. Overall, I would compare these to a really good pair of foam tip IEMs in terms of noise cancellation. These will definitely not provide any hearing protection for things like shooting, loud shop work, etc... so keep that in mind and use your head.<br /><br />Sound Quality:<br />These are definitely a \"consumer  grade\" listening experience, which for most people won't be a bad thing. For the price I am indifferent. I would say the bass is higher than normal with more muted/muddy treble. This isn't necessarily a bad thing and I would say most people would find them \"good\".  For what they cost, the sound exactly like what I would expect, better than a 20 dollar pair of headphones and not as good as a $150 dollar pair of IEMs, but your mileage may vary. For comparison with a competitor, I have some Sony wf-c500 wireless earbuds (no ANC) and these sound roughly the same, maybe slightly less clear treble and bass. I would still pick these over the Sony's because these have more features for the price and for other reasons I will list below.<br /><br />Other:<br /><br />Battery -- I think the battery life specs are roughly accurate, I get a full day on them, but haven't really pushed them to the 40 hours though. Battery life seems great, the case seems to get you maybe 2 charges. The case is nothing special, I wish the hinge had more tension in it like the Sony's so it felt more premium, I can kind of wiggle it a little bit but definitely not a deal breaker. I have yet to run them to the point where they alert you if they are low just once or they keep doing it. If they keep doing it I will update and remove a star because I don't quite understand why you would annoy the user with a message consistently for the last X% of battery (original rating is 4 stars).<br /><br />Size and Eartips -- these are rather large, but acceptable given the price and feature set.  They don't fit in the ear as well as the Sony ones do but they don't seem to fall out either. The Sony design fits into the ear better and \"hugs\" it so to speak, they seal better as well. I do really wish these came with a set of foam tips, they would actually compete in a different price bracket for that much, mainly because of the noise reduction. They would also help the fit. The included silicon ear tips are like the cheapest on the market, not as supple as more premium earbuds. There's nothing inherently wrong with them but they may rip after a while. I think if JBL addressed the fit (decrease the depth of the \"body\" in the ear so they seal better since there would be  less weight pulling down on the eartip) and eartips they'd have an extremely solid 50 dollar pair of earbuds.<br /><br />Controls -  ̶U̶n̶l̶e̶s̶s̶ ̶I̶'̶m̶ ̶m̶i̶s̶s̶i̶n̶g̶ ̶i̶t̶,̶ ̶I̶ ̶d̶i̶s̶l̶i̶k̶e̶ ̶t̶h̶e̶ ̶c̶o̶n̶t̶r̶o̶l̶s̶ ̶d̶o̶ ̶n̶o̶t̶ ̶h̶a̶v̶e̶ ̶v̶o̶l̶u̶m̶e̶ ̶a̶d̶j̶u̶s̶t̶m̶e̶n̶t̶,̶ ̶m̶a̶s̶s̶i̶v̶e̶ ̶m̶i̶s̶p̶l̶a̶y̶ ̶f̶r̶o̶m̶ ̶J̶B̶L̶,̶ ̶l̶o̶o̶s̶e̶ ̶a̶ ̶s̶t̶a̶r̶ ̶f̶o̶r̶ ̶t̶h̶i̶s̶.̶ ̶I̶ ̶d̶o̶ ̶n̶o̶t̶ ̶w̶a̶n̶t̶ ̶t̶o̶ ̶h̶a̶v̶e̶ ̶t̶o̶ ̶i̶n̶v̶o̶k̶e̶ ̶a̶n̶ ̶a̶s̶s̶i̶s̶t̶a̶n̶t̶ ̶t̶o̶ ̶r̶a̶i̶s̶e̶ ̶t̶h̶e̶ ̶v̶o̶l̶u̶m̶e̶.̶ ̶T̶h̶e̶ ̶S̶o̶n̶y̶ ̶e̶a̶r̶b̶u̶d̶s̶ ̶d̶o̶ ̶h̶a̶v̶e̶ ̶v̶o̶l̶u̶m̶e̶;̶ ̶h̶o̶w̶e̶v̶e̶r̶,̶ ̶  (UPDATE: Volume controls can be added through the app as a functionality; however, you loose the ability to change noise modes. I'm still rating 4 stars because I want both, would put 4.5 but can't. I don't see why both sides need a long press for google assistant or siri, one of these long presses could change the noise mode.) I would still pick the JBL buds because the volume steps are more gradual. I can get these to a comfortable level where with the Sony ones it always either a little too loud or a little too quiet. Other than volume I love that the controls are capacitive. Sony opted for actual push buttons in theirs which makes them unusable when laying on your side or for example working on your car, as you constantly bumping/pushing the buttons inadvertently in both cases -- so big win for the JBLs.<br /><br />Overall, a quality earbud for the price but improvements could be made, not sure you can find a more feature rich earbud for this price.", "I rarely leave bad reviews but I had to say something because of the overall deception of higher price, higher quality.  The noise cancelation works, but only to a certain degree but the most disappointment comes from the terrible sound quality.  I've had better quality from $30 ear buds.  And second, these buds don't set comfortably within the ear.  No matter what size rubber grommet fitting I chase from [and even switching ears] they never seemed to stay in.  And a close runner up...was the wind noise..  if you are you using this to bike, run, exercise,  or even work outside,  consider these useless .", "Will be returning. Overall sound quality is average for the price point. Not bad but not exceptional either. The mid tones are good but the bass is just slightly lacking compared to competitors. The problems I have are two:<br />Volume: There is a distinct lack of volume control on the devices. I can cycle through audio modes and mute using the bud controls but when changing between media and a phone call I have to pull out my phone to adjust the volume. When talking to someone on the phone who is speaking in a normal voice any background noise on my end like road noise in the car drowns out the person. My experience is that even with the volume all the way up on my phone these buds will only reach about 70% volume from Walmart's budget brand competition.<br />They fall out of my head while sitting still...<br />I dont have unusually large ear holes and most brand's medium pads fit snug. While the JBL medium pads appear to be the same size or larger than competitors they dont feel snug. I tried switching to the large pads which do snug up but dont feel entirely secure and do shift around requiring adjustment. If I shake my head once or twice like people do in the Raycon commercials these things go flying which means that expecting them to stay put while doing any kind of physical activity or is laughable. One fell out while I was walking to the kitchen for a snack. Just sitting on my couch or at my desk and not adjusting them every few minutes each has fallen out more than once.<br />All in all they are OK buds. I think they are slightly below average at the $50 price point I bought them at and are below average at the normal price of $100. The audio quality is ok but not above average. The first time I wore them they hurt my ears where the plastic meets the skin after about a half hour. The lack of volume controls and the need to keep adjusting them or else they fall out completely means I wont be keeping them.", "This is probably not the worst but very close comparison to just crap headphone. I was excited to get these until I went to set them up, don’t get me wrong easy to set up that wasn’t the problem. I went to go listen to music I had it as loud as they can go and they just not as loud as I was expecting. They don’t always stay connected sometimes they just disconnect themselves even when your in the middle of a very important phone call. They don’t really work on the JBL app like they say they do. I’m not sure if I just got a bad set or not but I bought 2 one for me and one for my wife’s, I tried hers out and it was just as bad so I guess it’s just crap for the price. And whatever you do don’t drop the case they fall right out of the case and good luck finding them because again they don’t really work with the app.", "This product wasn't as good as the description. Design is ugly. Sound and noise cancelation poor quality. The price is too high. Return service worst experience. I do not recommend this product.", "I bought these based on price and reviews, but they would not stay on my ears. Tested them at home before going out into the world with them, but they would only stay in my ears for a few minutes sitting in front of the laptop. God forbid I chewed on food, and it was seconds before they fell out. Maybe my ears are weird. I have a different set from a different brand on the way that have ear hooks.", "They fit so poorly that I literally can’t chew food during lunch break without them falling out repeatedly. That’s how loose they are. I followed the diagram for inserting and have tried each sozed ear piece. I’ve resorted to turning them complete upside down and shoving them in that way.<br /><br />If I had paid full price and not $50 on sale, I would have returned them already<br /><br />Other than that, I’m a fan but them falling out so easily is a major negative.", "Let’s start with fit. Maybe it’s my ears but they absolutely refuse to stay on my ears. I’ve tried all three sizes and they are either too big or too small. So just given that they are pretty much useless if you plan on any activity where your head might move.<br /><br />As far as the sound, it’s really not great. Sure there are different settings but overall the quality was far below the AirPods I used to use.<br /><br />Lesson learned, pay the extra for AirPods. These are not worth the price or aggravation.", "I don't like it fell of and the sound it's not worth for the price"], "reference": [118, 5, 2, 1, 0, 0, 0, 0, 0], "score": [-0.05000000074505806, -0.20000000298023224, -0.10000000149011612, -0.30000001192092896, -0.6000000238418579, -0.10000000149011612, -0.30000001192092896, -0.20000000298023224, -0.6000000238418579]}