{"reviews": ["I'm half Persian and have a love for tahdig! I've never made persian rice or tahdig before, so I bought this rice cooker and on my first try it came out PERFECT! There is no need to soak the rice overnight with this cooker. I rinsed 3 cups of rice (using the measuring cup provided) until the water was clear and mixed the drained rice with 6 tbsp of canola oil. Next I put the rice in the pan and added 3 1/2 cups of water and a little salt. I wrapped the lid in a tea towel, plugged the cooker in and turned it to 50 minutes and it came out great!!", "When the rice is boiling the froth overflows. The lid must be put on half way open. After the water evaporates, it should be closed all the way for the rice to simmer right.", "Product works great if you are making Persian rice with tahdig for 2-4 people. As other reviewers have stated, after looking at rice/water amounts throw out the instructions. They are written as if someone speaking only farsi told someone only speaking chinese at the Chinese manufacturer how to write them but they need to be in English. Read them for entertainment, not information. Once you get the oil/butter and salt amount to your taste and you play with time, the rice is perfect. First time out, using the cup they provide, used 4 cups rice, not quite 5 cups water, 2 tbsp. butter, and just ground a couple times with salt, guessed at 1 hr 20 min. Rice was perfect but tahdig was starting to burn in a couple places on top. Will add lots more butter, double the salt, and reduce time to 1 hr next time. Good luck!", "I love this rice cooker. My family is Persian and cooks a lot of rice, and this rice cooker is super easy to use. I just clean the rice, add butter and salt, then set the timer and it is perfectly done in 1 hour. The only down side is that it likes to splash water out the top hole during part of the process so I have to put down a towel or else it gets everywhere.<br /><br />However, I have used this rice cooker for years (granted I have to replace it every so often, probably once a year because the tadig starts turning out weird). It is super easy to use and an easy clean up.", "I love this but the amount of rice/water in the cookbook is off. I had water oozing out of the pot. However, I took some out and let it continue. The final product was perfect (though adding a bit more saffron is something I will do next time). Soooooo, happy with this purchase!", "I've had the 10 cup capacity for almost 6 months. It was purchased to replace a 5 cup Pars which I used for several years without issue. This one does not work very well. After turning the sole knob to 60 minutes nothing much happens. The light goes on and you can hear a slight noise from the heating element but after 30 minutes the water is still not boiling and the side of the pot is barely warm. I'm not sure how long it would take to produce tahdig, it's never gotten even close for me. Extremely disappointing!", "I bought this product less than a year ago, and now its not even warming the water let alone making the rice.  IT should have lasted a lot more than barely a year.  How can I get a replacement for this product?"], "reference": [52, 4, 3, 1, 0, 0, 0], "score": [-0.02500000037252903, -0.10000000149011612, -0.10000000149011612, -0.20000000298023224, -0.07500000111758709, -0.20000000298023224, -0.6000000238418579]}