{"reviews": ["Thank you Amazon community -the reviews were very helpful in selecting his rice cooker. The negative reviews and people who mentioned the cons were also considered in the making the purchase. OUt of the box, I washed all components, including the base with a washcloth. I am not a fan of that \"from the factory\" smell.<br /><br />Within 20 min I was cooking. The faceplate is extremely simple and user friendly. Instead of making rice, I cooked barley. The ratio was 1 c barley to 1-1/2 c chicken broth with a bouquet garni. I am looking forward to having a grain ready for dinner every night when  get home. I will cook farro, quinoa, black rice, basmati, etc.. Damn great buy!<br /><br />Watch the videos is you want to learn the basics. [...]", "I've had this rice cooker for a few months now and I'm generally happy with it.<br /><br />Things I like:<br />- It looks very nice, matching with my stainless steel appliances<br />- The unit feels very sturdy and made with quality material<br />- The bowl is easy to clean<br />- The rice it makes tastes very good.  Everything is cooked evenly.<br /><br />But there are a few things that are annoying with it:<br />- It takes about 45 minutes to make white rice and 2 hours to make brown rice.  This is a lot longer than my previous Panasonic rice cooker.<br />- When pressing the top button to open the rice cooker, the lid only comes up halfway and then I have to open it up manually<br />- The little lid inside of the lid needs to be washed every use or it gets this funk on it.", "I always had problems with this producing a decent bowl of rice.  It is supposed to be one of the best.  To be honest, I recommend getting the cheaper kind with one button.  I ended up throwing this one out and getting the cheaper one and it works perfect.", "Zojirushi makes great and durable product. I have had it for 7 years, still running strong and only need to replace the inner pot recently due to some scratches, other than that everything still works great. It was an expensive rice cooker but worth every penny I spent. Only thing I don't like is the timer, you can set timer to cook for mixed rice."], "reference": [3, 1, 0, 0], "score": [-0.10000000149011612, -0.23950617622446133, -0.10000000149011612, -0.5]}