{"reviews": ["Wow!  This thing is great!  I have struggled making Persian rice on the stovetop.  No more!  This cooker makes it so easy!  It makes perfect tadig.  Here is how I do it, and it works for just about any amount of rice.  I have not tried any less than 3 cups (included Persian rice cups, not standard measuring cup), but this recipe works for 3+ cups:<br />Wash the rice - get it good and clean.  I wash about 5 times, right in the cooking pan.<br />Cover rice with water - add water until the rice is covered by about 3/8 - 1/2 of an inch of water<br />Add salt.  I add about a tablespoon per 3 cups.<br />Add oil.  I never measure but add a healthy splash of oil, probably a quarter cup (standard measuring cup) per 3 cups rice.<br />Stir and set to 1 hour on timer.<br />While cooking, I crush some saffron and grind with salt to a powder, and dissolve in about 1/4 cup boiling water.  Let sit.<br />About 10 minutes before the timer is done, I add a half stick of butter (1/8 pound) cut into about 8 pieces onto the top of the cooked rice, and pour the saffron water over the rice.<br />Let it finish cooking the remaining 10 minutes.<br />Perfect Persian rice!", "The main thing people seem to note about these cookers is a lack of instructions, so I want to address that for any skeptics.  There is a booklet that tells you the water-to-rice proportions, but it doesn't say how long to cook it.  Don't let that deter you;  a quick google search turns up a multitude of sets of instructions, and they all pretty much say the same thing:  cook for an hour and a half.  Some say clean and soak the rice, some don't, some are very detailed, some aren't.  It's all a matter of personal preference.  I just used this cooker for the first time tonight with no special prep-work, just tossing the rice, water, and oil in, setting the timer, and coming back in 90 minutes, and the results were AMAZING!  It is so easy, and if I can do it, I'm confident anyone can.<br /><br />Now as for the quality of the construction:  this cooker is beautiful!  It has all-metal construction, feels very sturdy, and cleans up so easily.  The pot comes right out and I had it cleaned in 2 minutes.  Only complaint (and you will see this everywhere this machine is talked about) is that the timer maxes out at 1 hour.  But it's really no trouble to just set it twice.  For all the labor saved in using this over the traditional way of making tahdig, resetting the timer shouldn't even show up on your radar.", "Success on first try! the whole thing came out beautifully. I am sure I can adjust the water to rice ratio a bit but it was easy to use and for an average cook, I produced a great meal out of it.", "Tahdig is one of mankind's greatest achievements that is astoundingly difficult to make properly. My husband is Persian and can make some semblance of tahdig about 50% of the time he tries.<br /><br />After 15 years of marriage, he finally tells me that there is such a thing as a Persian rice cooker. We've owned a few different high-end rice cookers over the years, none of which ever produced tahdig. This model is very basic feature-wise, but it does the trick.<br /><br />The instructions are a little hard to follow in parts- they didn't do a great job translating them but they aren't terrible. The suggested measurements for water, salt and oil are pretty much spot on but you will want to try different oils (ghee, grapeseed, etc) to see which one produces your desired result. You kind of have to guess at the timer settings, but with some trial and error, you too can enjoy tahdig whenever you need it.", "I just received the ten cup rice maker and made my first batch of tagdig last night. I followed the directions others have posted (don't bother with the directions or the plastic cup included with the cooker), and it was perfect.<br /><br />For two cups (US measures) of dry basmati rice, I used 3-½ cups water along with two tablespoon of oil and a teaspoon of salt. I rinsed the rice very well (no need to soak the rice) and added everything to the cooker, smoothing out the rice so the top was even. No need to put a towel under the lid. I set the timer to 60 minutes.<br /><br />After the timer went off, I added a bit of ground saffron mixed with a tablespoon of hot water and 2 tablespoons of melted butter - sprinkled over the top. I cooked it another 15 minutes and inverted it on to a plate. It had a beautiful golden crispy shell and the rice was light and fluffy.<br /><br />Next time, I'll add the butter and saffron at the beginning with the water, which will help disperse the yellow saffron color throughout the rice, rather than leaving streaks when it's added later.<br /><br />I'd also like to try making tachin with chicken and some vegetables, but not sure about the timing. I'll obviously precook the chicken, but since it cooks for an hour I don't want the chicken to overcook. Not sure when to add the yogurt either. Any advice?", "We got the 10 cup rice cooker and I've always made tahdig the old fashioned way, but this does make a good quick version. At first I wasn't getting a good result and then I talked to a friend who has one and she helped with the proportions and it started working.<br /><br />First of all...you must get very good Persian approved basmati rice. This is critical. I made some with a lesser rice and I got mush.<br /><br />This is what you do...<br /><br />Soak the good rice for at least 30 min and up to as long as you want.<br />Rinse it until water runs clear.<br />In the bottom of the cooker put a oil (or for even better flavor oil and ghee mixed together...you may need to turn on the cooker to melt the ghee if you do this). I put enough in so that the whole bottom is covered (sides and center).<br />Add the drained rice into the cooker.<br />Add the same amount of water as rice adding one additional cup (for 3 cups rice, add 4 cups water).<br />Add a decent amount of salt to the water.<br />Cook for about an hour and a half (you will need to add extra time on the cooker).<br />When rice is done, fluff and add some saffron tea (a bit of saffron added to hot water to release flavor/color).<br /><br />It's delicious!", "This rice cooker is fantastic.  After years of hit-or-miss success with persian rice - and getting the crust right  - this cooker did it the first try!  It is so easy to use...rinse the rice, boil the water, add the rice, salt and oil in the proportions recommended in the book and turn the dial to 60.  After it expired, I put it on another 5-8 minutes and the crust was perfect.  My family was thrilled.  Ignore the instructions in the book other than the proportions of rice to water and oil.  The rest of the instructions make no sense.  Quick easy clean up as well.  So much easier than cooking on the stove.", "Everything to love about this rice maker. Wash your rice; add water, salt and oil; turn it on and in less than an hour a perfect pot of rice with the best crisp all around.", "I love this rice cooker. My family is Persian and cooks a lot of rice, and this rice cooker is super easy to use. I just clean the rice, add butter and salt, then set the timer and it is perfectly done in 1 hour. The only down side is that it likes to splash water out the top hole during part of the process so I have to put down a towel or else it gets everywhere.<br /><br />However, I have used this rice cooker for years (granted I have to replace it every so often, probably once a year because the tadig starts turning out weird). It is super easy to use and an easy clean up.", "works beautifully, TADEGH ready, if you use 2 cups of rice add 2 and a quarter water. wash the rice fist wait for the water to boil add rice oil and salt, then get ready to feast.", "It’s strange that there are so many bad reviews for this product. I have been trying to make Persian rice on the stovetop and failing miserably, and I’ve also tried an instant pot tahdig recipe that also failed to create any kind of crispy layer. My prior attempts at making tahdig deserve bad reviews. But this product? It’s awesome! This was the easiest thing I’ve tried and it came out perfectly. Yes, the instructions are a joke, but products made in other countries often have absurd wording. If you can find it and buy it online, can‘t you also search recipes and tips online? I found so many, mostly recommending an almost 1:1 ratio of rice to water, with just a little more water. I used 2 cups rice, 2 and 1/4 cups water, 50ml oil and a pinch of saffron. I used exactly half of how much oil is on the chart in the instruction booklet, as recommended in many reviews. I think the salt quantity in the chart is spot on. Next time I’ll use ghee, or maybe experiment with some chopped dried apricot or nuts or something fun.<br />One complaint that I read from many reviewers was that the included measuring cup isn’t a “true” cup. It’s not, a standard US cup is 240 ml, the Persian cup supplied here is 180 ml. Think of it more as a SERVING SIZE. So 4 cups of rice measured with that 180 ml cup serves 4 (very hungry) people. Buy the “cup size” for the number of people you’ll be serving, the four cup size is PLENTY big for a family of four. I’d hate to see us actually eat four whole US cups of rice as just part of a regular meal!", "I love the tah-dig. It takes a few tries to get the water/setting ratio proper but works conveniently once you have it."], "reference": [112, 27, 8, 6, 4, 4, 4, 1, 1, 0, 0, 0], "score": [0.08888889021343654, 0.4000000059604645, 0.6000000238418579, 0.10000000149011612, 0.14444444990820357, 0.09375000139698386, 1.862645149230957e-09, 0.800000011920929, -0.20000000298023224, 0.30000001192092896, 0.11111111276679568, 0.10000000149011612]}