{"reviews": ["It works good but really product is weak specially nonstick stuffs they used in pot! it is to thin and after use it for two time there are many scratch in it that completely has no nonstick anymore", "For all the people bashing the grammar and spelling, this was obviously not designed or made in America.  Being that it is a Persian rice cooker (which I love) I’m sure the instructions where “translated” from Farsi to English.  Or from Farsi to Chinese to English since it was made in China. Who knows?  How many times have you gotten some instructions that were translated from Chinese and not understandable.  So give them a break or just read these reviews for instructions.  I went to a middle eastern market and got the royal brand basmati rice in the big sack.  I use 2/3 canola oil and 1/3 butter for the “salad” oil.  It comes out great. Trying to make the potato tadig now. We’ll see how that comes out.  I am half persian myself and have always had a hard time trying to cook basmati rice before this in a pot.  I know there are people who say that that is easy to do, but I think it is too much work and it never comes out right for me at least.  This is easy and it comes out great!  1 hour or if you add 15 min  1 hr 15 min is not that long compared to the traditional way of boiling first and then baking.  I am making my second bowl now so I cannot speak to the durability but so far so good.", "This rice cooker has not been redesigned for over 40 years... I'd recommend \"Yum Asia Sakura Rice Cooker with Ceramic Bowl and Advanced Fuzzy Logic (8 Cup, 1.5 Litre) 6 Rice Cook Functions, 6 Multicook Functions, Motouch LED Display, 120V Power\" instead. It has many other functionalities like slow cook, sitkcy rice, soup, etc. It also makes great tadig!<br /><br />I bought this from a local Persian store but it's the same product and this review applies to all of them.<br /><br />This rice cooker should not have ever been made or sold and I'll explain why:<br /><br />Someone at Pars decided to expand the line without having to do a little R&D. They probably hired a Persian guy and a Polish dude, had them cut the top of a 10 cup rice cooker, shrunk the inner pot, made it thinner and called it a day without calibrating the burner.<br /><br />The burner was never designed for smaller than a 10 cup rice cooker and it runs at the same temperature and intervals. An smaller, thinner inner pot cannot dissipate and distribute the heat as fast as it should and for that reason it burns the rice every time. If you can smell the Teflon melting, that's too hot. It's dangerous to operate and dangerous to eat out of. Most of you who posted the pictures of your tadig, they are burned... if you see a black ring in the middle of brown, that's burned tadig.<br /><br />Do not buy smaller than 10 cup Pars rice cooker until this is fixed. A 10 cup is not much bigger but still cooks one or two cups better than the smaller capacity rice cooker Pars makes.", "Poor standard quality in Teflon coating of the pot<br />Manufacturer has Cheapened quality of Teflon coating over the years<br />Scratches  easily despite the use of provided spoon<br />The company has lowered its standards and increased prices it is such a shame to see this over the years .", "I love Parskhazar rice cooker. I ordered 4 cup rice cooker the first time when my order arrived I opened it and noticed that the handle is broken so I request the replacement. The replacement came today and I noticed the pot is rusty as if it stayed in the rain or something! I am honestly tired of keep sending this back and still receiving something damaged each time specially at the days of corona virus that you put yourself in risk by ordering stuff! But I am going to return this one too! No more rice cooker for me!", "I just received this product and the first thing I noticed is that the lid does not fit the nonstick pot well. It is as if either the lid or the pot is not a perfect circle, as a result the lid does not sit tightly on the pot and pivots on an axis. Maybe I just got a defective unit???  At any rate, I gave it a try and the rice it made was amazing with perfect delicious Tahdig. Couldn't be any better!!!  (hence, the 4 star)..... So despite its defective lid, it seem to perform really well. But I hate to settle for a defective product. So I decided to return it for a replacement. I will get a new unit and will update this review later.<br /><br />Update 11/06/2015: I got the replacement (Thank you Amazon, such a smooth and great customer service). The replacement is perfect. I changed the rating to 5 stars. This is one good Persian rice cooker that makes perfect quality Tahdig. Just what I was looking for. I highly recommend it.", "- Pricey : 2 or 3 times the price of a rice cooker at costco<br />- It does not turn off. It keeps running even when the timer is at 0<br />- Inner pot has low quality and get scratched even when you use a wooden spoon", "I've had the 10 cup capacity for almost 6 months. It was purchased to replace a 5 cup Pars which I used for several years without issue. This one does not work very well. After turning the sole knob to 60 minutes nothing much happens. The light goes on and you can hear a slight noise from the heating element but after 30 minutes the water is still not boiling and the side of the pot is barely warm. I'm not sure how long it would take to produce tahdig, it's never gotten even close for me. Extremely disappointing!", "The inner pot was dented so the lid did not sit properly on the pot. Waiting to receive another one & return this one! So disappointed!", "Unfortunately you really can’t find any other Persian rice cooker in the US. The non-stick pot has no great quality. It’s just fine", "Lid that came with the rice cooker didn't fit the pot. Had to return.", "We bought this around 6 months ago and yesterday we felt a burning smell and it turned out a piece melted as you can see in the picture. So the pot doesn’t come out any more and it’s useless now. The quality doesn’t worth the price at all!!"], "reference": [18, 7, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0], "score": [-0.20000000298023224, -0.10000000149011612, -0.2500000037252903, -0.5, -0.4000000059604645, -0.45000000298023224, -0.5, -0.20000000298023224, -0.4750000014901161, -0.6000000238418579, -0.30000001192092896, -0.20000000298023224]}