{"reviews": ["I purchased this product last weekend and it arrived yesterday. Shipping time was great. That said, when I pulled the unit from the box and set it on the counter top I realized that it was wobbling. The legs are not all the same height. That didn't bode well for Zojirushi's quality control.<br /><br />I set about preparing a pot of brown rice. Following the directions very closely my rice took nearly two hours to cook. Two hours! Considering that you can cook a pot of brown rice in a pressure cooker in under 15', and maybe 45' in a cheap rice cooker or stove-top pot, the two hour time-frame is mystifying.<br /><br />But to really top it off, the rice had the consistency of pudding; very soggy and mushy. Clearly it had been overcooked. Not to be outdone I tried white rice too, but with the same results. After cooking the first pot of \"rice\", the underside of the lid behind the top plate had already become discolored. The LED display isn't even back-lit!<br /><br />As I like to read the reviews before making a purchase like this, I saw many people giving this product five stars and think we must be talking about two different things. Mine is a Zojirushi NS-TGC10, made in China with a cheesy non-stick aluminum (not even hard anodized) cooking pot and raw aluminum top plate. The only stainless steel on it is the wrap-around sides and front.<br /><br />$144.00 (shipped) is allot of clams for something of such poor quality. Mine will be returned. Funny thing is, my little $20. cheapo rice cooker lasted for years and cooked a perfect pot of rice every time. Go figure.", "My old cooker had the steam vent in the lid right near the finger grip for opening the lid; it spit, dribbled and leaked cooking water, overcooked and browned the bottom of the rice even when immediately turning the power off, and simply couldn't manage to cook brown rice or pilaf completely. The Zojirushi is a dream!! No more burnt fingers, no mess on my countertop, the rice is done to perfection AND I've finally discovered the fantastic taste of properly cooked brown rice!! I bought this cooker because I trust the Zojirushi name. I've been using one of their bread makers for 17 years and I believe this Rice Cooker will provide the same long and durable service. As well, it looks nice, and the retractable cord and fold-down carry handle are nice touches.", "I've had this rice cooker for a few months now and I'm generally happy with it.<br /><br />Things I like:<br />- It looks very nice, matching with my stainless steel appliances<br />- The unit feels very sturdy and made with quality material<br />- The bowl is easy to clean<br />- The rice it makes tastes very good.  Everything is cooked evenly.<br /><br />But there are a few things that are annoying with it:<br />- It takes about 45 minutes to make white rice and 2 hours to make brown rice.  This is a lot longer than my previous Panasonic rice cooker.<br />- When pressing the top button to open the rice cooker, the lid only comes up halfway and then I have to open it up manually<br />- The little lid inside of the lid needs to be washed every use or it gets this funk on it.", "I have owned this item for almost 4 months.  Prior to the purchase of this item, I had 3-cup sylvania rice cooker. I hated the product because the water always overflows when it's about to finish cooking, and getting rid of the rice at the bottom of the lid after use was a pain. I felt like I was wasting rice.<br />So, I decided to buy something better.<br />Like the most reviewed customer said, I was debating between the 3-cup rice cooker.  I live alone and thought this product would be too big for me.<br />But having used this rice cooker for 4 months, it hasn't caused any problem for me.  I usually cook 3-zojirushi cup rice, and I put the leftover into freezer. Although I love the taste of it when it's freshly cooked, microwaved rice is still good.<br />I have only tried cooking white rice and mixed rice. Would like to try the baking feature soon.<br /><br />Pros:<br />- Timer (can be timed to be cooked for next morning, after work, etc.)<br />- Easy to wash (the inner lid is VERY easy to clean. Does not stick at the bottom)<br />- Bumpy spatula (rice does not stick.)<br />- Warming (regular & extended warm - keeps the rice warm and fresh)<br /><br />Cons:<br />- The inner lid moves around when getting the rice out<br />- Takes little long to cook (Regular-40min, Quick-25min) although I don't mind it because I usually use timer for next day or for later use<br />- If rice is in warming mode for too long, it gets hard at the bottom.<br /><br />If you are considering to buy a nicer rice cooker, but not so much into buying IH (induction heating) rice cooker, this one is the way to go. You won't regret it."], "reference": [5, 2, 1, 0], "score": [-0.20000000298023224, -0.40625000558793545, -0.1481481503557276, -0.26250001043081284]}