{"reviews": ["I just received this product and the first thing I noticed is that the lid does not fit the nonstick pot well. It is as if either the lid or the pot is not a perfect circle, as a result the lid does not sit tightly on the pot and pivots on an axis. Maybe I just got a defective unit???  At any rate, I gave it a try and the rice it made was amazing with perfect delicious Tahdig. Couldn't be any better!!!  (hence, the 4 star)..... So despite its defective lid, it seem to perform really well. But I hate to settle for a defective product. So I decided to return it for a replacement. I will get a new unit and will update this review later.<br /><br />Update 11/06/2015: I got the replacement (Thank you Amazon, such a smooth and great customer service). The replacement is perfect. I changed the rating to 5 stars. This is one good Persian rice cooker that makes perfect quality Tahdig. Just what I was looking for. I highly recommend it.", "It came with a stainless steel looking lid instead of glass that they have in the picture. The stainless steel color of the rice cooker is different than the lid. They don't even match!! Little black metal particles fall from the lid on top of your rice, its dangerous to use, don't buy it!", "You get Crispy rice at the bottom alright,  but at what cost...... the electric pot suppose to boil the water+oil+salt first, then you add the rice and only then the timer should start countdown, but that is not what happened. The timer start fro: beginning and continue until th3 end. also when the rice is in there and it reach boil point, the whole mix boils over and out of the lid.... at the end of it all the rice “cake” sticks to the pan unless you saturates the dish with so much oil.... when I use their measurement the rice came out mooshy, which by the way their one cup of rice is really 3/4 of a cup or 2/3 of a cup. After the first few failures I changed amounts to see if that will do any good, but it came oily and burned or dry to the crisp... instructions are totally off! I did get kind of a nice rice cake at one time, but again the rice on top was too soft and the bottom was too oily... I am still looking for the one who will be more accurate... also, there is no way to alternate recipes like having potatoes at the bottom etc. hopefully someone will come with something better... sooner then later....", "The inner pot was dented so the lid did not sit properly on the pot. Waiting to receive another one & return this one! So disappointed!", "I needed a rice cooker and I love this brand . However, the lid was bent and let the steam out from all the sides. I had to return it.", "Disappointed the lid was damaged and I didn’t have the time to return it"], "reference": [1, 1, 0, 0, 0, 0], "score": [-0.12222221824857922, -0.22500000894069672, -0.10000000149011612, -0.5, -0.4000000059604645, -0.6000000238418579]}