{"reviews": ["This product is exceptional and I can't say that enough. This cooker is incredibly easy to use and I love that the website offers recipe ideas. Sometimes you'll see a product that has a few pictures or descriptions on what it can be used for, but Kitalma follows through by making sure you truly know what uses you can get out of it. The color is stunning and a great addition to the kitchen. In this day and age, many of us are very busy and it is so nice to be able to have something created for us to make our daily tasks either a little bit easier or a little bit quicker without sacrificing quality. I highly recommend this product and will be recommending to everyone I know. -Paul DiGiovanni", "This product is ok for one person to use, but not for a family. I was disappointed that it started to  melt in the microwave after two uses, and I found red plastic stuck to my bacon.<br />The quality and crispiness of the bacon was great, and very tasty until part of the product melted.", "This is a surprisingly well made product and really easy to use. I made the meatloaf recipe that comes with the product and it came out really evenly cooked, tasty, and my kids said it was the best I have cooked.<br />This device has so many options, I’m sure it will get used often I our house.<br />It also cleaned up much easier than the metal pans we used to use.", "Looks like a good product but unsure on how to use", "I really wanted to purchase this product. It looks amazing but I noticed several reviews mentioned no instructions. Before purchasing I went on the Kitalma website and downloaded their cookbook. It shows you how to cook some specific recipes but no general instructions like how to cook rice, how much water and rice, how long to cook. The product info just says make sure it's done. No instructions on how to cook popcorn, just that you can, What kind of popcorn, oil or no, how long to cook it. You can bake brownies, and cook bacon. How? Very disappointed. I removed it from my cart and ordered a microwave rice cooker that doesn't claim to do as many things but gives you instructions for the things it does do.", "I love the product.", "I liked the quality of the product. All the different parts fit in neatly for storage. The care instructions and some recipe ideas are on the initial package wrap. Don't throw that away.<br />Remember knowing how to cook in the microwave and the product are two different things. I would not blame product if I cook something and it does not come out right.", "I have been looking for a universal cooking container for the microwave and this works great. It is easy to use with all the interchangeable trays, etc. I was able to download the recipes that can be use for this product on the website", "We liked this product it and it was easy to use"], "reference": [16, 9, 7, 6, 6, 5, 5, 2, 0], "score": [0.7666666615340444, 0.12500000186264515, 0.699999988079071, 0.20000000298023224, 0.30000001192092896, 0.8999999761581421, -0.12222222487131755, 0.10000000149011612, 0.8999999761581421]}