{"reviews": ["I've had this rice cooker for almost a year and it has been the best kitchen-tool investment I've ever made. I use the rice cooker almost every day for a wide variety of grains.  I'm now contemplating getting the 3-cup model in addition because the rice cooker is so versatile and essential to our daily meals that there are times I could employ two of them.<br />I've been delighted to find that I can make no-hassle (and fantastic) polenta, any kind of hot breakfast cereal (ready to eat when I get up), excellent rice (which my kids love because \"its just like the Chinese restaurant rice\"), and perfect grains every time - quinoa, spelt, barley.  The only thing I haven't tried yet is amaranth.<br />I wasn's sure I'd use the timer function, but it has become essential, especially as I pre-soak and ferment all my grains now (a la Nourishing Traditions.)  The porridge setting, too, has made busy mornings that much easier.  It takes a little experimentation to find the right proportions of water-to-grain for porridges (I recommend getting [[ASIN:1558322035 The Ultimate Rice Cooker Cookbook : 250 No-Fail Recipes for Pilafs, Risottos, Polenta, Chilis, Soups, Porridges, Puddings and More, from Start to Finish in Your Rice Cooker]] for a handy reference guide for all grain/water ratios) but too little water is easily remedied by opening the lid when the timer goes off, stirring to mix water that hasn't been fully incorporated, and adding water to the desired consistency.  The porridge will stay on \"Keep Warm\" until you're ready for breakfast.  I make oats, steel cut oats, cream of wheat, cream of brown rice, and others using the porrodge setting.<br />Other reviewers have mentioned that having the wipe the inside lid after every use is a pain, but I've found it takes just a moment.  Unlike other rice cookers I've had, there is almost never an explosive mess of cooked-on grain schmutz on the lid, so cleaining is fast and easy.  The no-stick pot is great, too.<br />If you are cooking for 4 or more regularly, I recommend the 5 1/2 cup size; you'll have leftovers, but not too much.  Porridge for one (which is what I use it for) comes out just fine, despite the small amount of grains in the pot (hence, the need to stir after cooking.)  If you are cooking for 1 or 2, then the 3 cup size should be adequate", "This is my second Zojirushi rice cooker as I had to buy another one for the US. The other one has a european adapter.<br /><br />I highly recommend it. It is so easy to clean and it makes perfect rice. I never had a rice cooker before but I bought this one after looking up reviews of this brand.<br /><br />I make rice 2 to 3 times a week so this little machine really is worth the while. This one I thought had an incredible price by the way!<br />It doesn't take much space and -OH!, it has a retractable power cord which is just great! I am just very enthusiastic when it comes to kitchen appliances that work for me!<br /><br />Tips for best rice:<br />- white thai or similar rice: stir when finished and then close the lid and leave for 5 more minutes. It will be on the keep warm feature.<br />- sushi rice: Leave for 10 minutes and then stir and use.<br />- any rice: always use the right amount of water. This can be slightly different depending on the type of water so pay attention to that.<br /><br />Cooking time: for white rice it takes about 30 minutes which I thought was very fast. In the european cooker I have, which is the same model, it takes about 40 minutes, even a little more in the beginning (have no idea why).<br /><br />Enjoy!", "Love this rice cooker!  Makes perfect rice!  I have yet to use the quick function, so I'm not sure how good the rice will turn out with that.  But, on the regular white rice setting, it cooks for approx. 40 minutes and comes out perfect each time.  It plays a little song when cooking starts, and a different song when cooking stops.  I also really like that the inner lid is detachable and can be washed after each use - as anyone who cooks rice knows...things can get caked on there.", "I use this rice cooker at least once a day, sometimes twice.  I use it to make steel-cut oatmeal for breakfast, and also cook rice or another grain for dinner.  I love the timer function - it's very accurate, the food comes out consistently good, and it's very easy and quick to set.  I work full-time and have a little one, so I need the food to be done and ready-to-serve as soon as I get up in the morning, and as soon as we come in in the evening, and it is.  AND rice is still warm and tastey for my husband when he gets in later.  I've tried a lot of different things in it, different varieties of white and brown rice, risotto, polenta, couscous and everything has come out perfectly.  I haven't tried the cake function - I'm not a cake person apart from cupcakes.<br /><br />Clean up is incredibly easy.  Even with super-sticky polenta a quick soak of the inner bowl, and a quick clean of the outer lid and the inner lid is all that is needed.<br /><br />I bought the Ultimate Rice Cooker Cookbook by Beth Hensberger at the same time, and I have to say the combination of the two is great.  I've been able to really get the most out of the rice cooker, which should really be called grain cooker, because it is so versatile.<br /><br />It seems well-built, but I can't comment since I've only had it for a month.", "I have owned this item for almost 4 months.  Prior to the purchase of this item, I had 3-cup sylvania rice cooker. I hated the product because the water always overflows when it's about to finish cooking, and getting rid of the rice at the bottom of the lid after use was a pain. I felt like I was wasting rice.<br />So, I decided to buy something better.<br />Like the most reviewed customer said, I was debating between the 3-cup rice cooker.  I live alone and thought this product would be too big for me.<br />But having used this rice cooker for 4 months, it hasn't caused any problem for me.  I usually cook 3-zojirushi cup rice, and I put the leftover into freezer. Although I love the taste of it when it's freshly cooked, microwaved rice is still good.<br />I have only tried cooking white rice and mixed rice. Would like to try the baking feature soon.<br /><br />Pros:<br />- Timer (can be timed to be cooked for next morning, after work, etc.)<br />- Easy to wash (the inner lid is VERY easy to clean. Does not stick at the bottom)<br />- Bumpy spatula (rice does not stick.)<br />- Warming (regular & extended warm - keeps the rice warm and fresh)<br /><br />Cons:<br />- The inner lid moves around when getting the rice out<br />- Takes little long to cook (Regular-40min, Quick-25min) although I don't mind it because I usually use timer for next day or for later use<br />- If rice is in warming mode for too long, it gets hard at the bottom.<br /><br />If you are considering to buy a nicer rice cooker, but not so much into buying IH (induction heating) rice cooker, this one is the way to go. You won't regret it."], "reference": [13, 3, 2, 1, 0], "score": [0.012500000186264515, 0.5, 0.800000011920929, 0.19375000288709998, -0.26250001043081284]}