{"reviews": ["I'm half Persian and have a love for tahdig! I've never made persian rice or tahdig before, so I bought this rice cooker and on my first try it came out PERFECT! There is no need to soak the rice overnight with this cooker. I rinsed 3 cups of rice (using the measuring cup provided) until the water was clear and mixed the drained rice with 6 tbsp of canola oil. Next I put the rice in the pan and added 3 1/2 cups of water and a little salt. I wrapped the lid in a tea towel, plugged the cooker in and turned it to 50 minutes and it came out great!!", "I love this pot.  You cant mess it up!  I have tried all the settings and i have adjusted the oil and salt to play around with it.  The only thing I have not changed was the recommended ratio of water to rice.  I did have trouble understanding the directions and went online to read more.  SO really all you have to do is turn the dial clockwise to turn it on,  let the water, oil, and salt come to a boil.  Stir in the rice, then turn the knob again clockwise  to the time you want it to cook.  Steam will escape from around the lid but DON&#34;T PANIC-  it doesn't matter!  The further you turn it the darker the crispy part on the bottom gets.  EASY.  If you want to add other things, like dill and lima beans or sour cherries,  just add them when you stir in the rice.  My favorite is setting is the one that says 50 minutes.", "The instructions are nonsense. i went online and found recommended instructions from others. Also tried different settings myself. It produces nice rice and tahdig. Not as good as made the old fashioned way in a pot with a towel wrapped around the lid, but it's a great way to make quick full proof Persian rice with tahdig, especially for inexperienced rice cookers. Highly recommend it.", "I just received the ten cup rice maker and made my first batch of tagdig last night. I followed the directions others have posted (don't bother with the directions or the plastic cup included with the cooker), and it was perfect.<br /><br />For two cups (US measures) of dry basmati rice, I used 3-½ cups water along with two tablespoon of oil and a teaspoon of salt. I rinsed the rice very well (no need to soak the rice) and added everything to the cooker, smoothing out the rice so the top was even. No need to put a towel under the lid. I set the timer to 60 minutes.<br /><br />After the timer went off, I added a bit of ground saffron mixed with a tablespoon of hot water and 2 tablespoons of melted butter - sprinkled over the top. I cooked it another 15 minutes and inverted it on to a plate. It had a beautiful golden crispy shell and the rice was light and fluffy.<br /><br />Next time, I'll add the butter and saffron at the beginning with the water, which will help disperse the yellow saffron color throughout the rice, rather than leaving streaks when it's added later.<br /><br />I'd also like to try making tachin with chicken and some vegetables, but not sure about the timing. I'll obviously precook the chicken, but since it cooks for an hour I don't want the chicken to overcook. Not sure when to add the yogurt either. Any advice?", "The lid is very cheap made. I washed it once before use and it rusted.", "Great rice cooker but easily scratchable, do not use metal utensils in it. If you put too much water it can spill while cooking ,lid is not very tight. It does make the bottom crispy so I'm happy with that part."], "reference": [52, 9, 5, 4, 0, 0], "score": [0.20000000298023224, 0.10000000149011612, 0.4000000059604645, 0.10000000149011612, 0.5, 0.10000000149011612]}