{"reviews": ["Wow!  This thing is great!  I have struggled making Persian rice on the stovetop.  No more!  This cooker makes it so easy!  It makes perfect tadig.  Here is how I do it, and it works for just about any amount of rice.  I have not tried any less than 3 cups (included Persian rice cups, not standard measuring cup), but this recipe works for 3+ cups:<br />Wash the rice - get it good and clean.  I wash about 5 times, right in the cooking pan.<br />Cover rice with water - add water until the rice is covered by about 3/8 - 1/2 of an inch of water<br />Add salt.  I add about a tablespoon per 3 cups.<br />Add oil.  I never measure but add a healthy splash of oil, probably a quarter cup (standard measuring cup) per 3 cups rice.<br />Stir and set to 1 hour on timer.<br />While cooking, I crush some saffron and grind with salt to a powder, and dissolve in about 1/4 cup boiling water.  Let sit.<br />About 10 minutes before the timer is done, I add a half stick of butter (1/8 pound) cut into about 8 pieces onto the top of the cooked rice, and pour the saffron water over the rice.<br />Let it finish cooking the remaining 10 minutes.<br />Perfect Persian rice!", "I'm half Persian and have a love for tahdig! I've never made persian rice or tahdig before, so I bought this rice cooker and on my first try it came out PERFECT! There is no need to soak the rice overnight with this cooker. I rinsed 3 cups of rice (using the measuring cup provided) until the water was clear and mixed the drained rice with 6 tbsp of canola oil. Next I put the rice in the pan and added 3 1/2 cups of water and a little salt. I wrapped the lid in a tea towel, plugged the cooker in and turned it to 50 minutes and it came out great!!", "Throw the directions out because they don't make any sense.  Very poorly translated instruction manual, but using it is self-explanatory enough that you don't need the manual anyway.<br /><br />If you want to make rice for yourself or for a couple more people, it's the perfect size.  If you want to make more than enough for four people or if you eat a lot of rice, I suggest getting a larger sized cooker.<br /><br />It's very easy; you just add your water, salt, and oil, let that combination boil, then add your rice.  Stir it, cover it, and walk away from it for an hour or so.  Makes great Persian-style rice and is very easy to clean.<br /><br />Don't buy this if you're looking for a normal, multipurpose rice cooker/steamer/slow cooker because this unit will cook the bottom of the pot to a crisp - I bought it specifically for that purpose, to make a crispy crust on the rice called tahdig.  Because of how the heat is distributed, it would be hard to avoid burning the bottom of the pot if you wanted to use it for things like soup or stew.  It should only be used for rice.", "The main thing people seem to note about these cookers is a lack of instructions, so I want to address that for any skeptics.  There is a booklet that tells you the water-to-rice proportions, but it doesn't say how long to cook it.  Don't let that deter you;  a quick google search turns up a multitude of sets of instructions, and they all pretty much say the same thing:  cook for an hour and a half.  Some say clean and soak the rice, some don't, some are very detailed, some aren't.  It's all a matter of personal preference.  I just used this cooker for the first time tonight with no special prep-work, just tossing the rice, water, and oil in, setting the timer, and coming back in 90 minutes, and the results were AMAZING!  It is so easy, and if I can do it, I'm confident anyone can.<br /><br />Now as for the quality of the construction:  this cooker is beautiful!  It has all-metal construction, feels very sturdy, and cleans up so easily.  The pot comes right out and I had it cleaned in 2 minutes.  Only complaint (and you will see this everywhere this machine is talked about) is that the timer maxes out at 1 hour.  But it's really no trouble to just set it twice.  For all the labor saved in using this over the traditional way of making tahdig, resetting the timer shouldn't even show up on your radar.", "An excellent rice cooker for making the famous Iranian Tehdegh rice. It is very easy and straightforward to make.  The instructions are confusing. Suggest you follow the rice and water proportion and use your judgement for oil and salt. You can vary the cooking time depending on how much crunchy you like the Tehdegh (bottom crust). You will need to cook at least for an hour, the maximum timer limit.  I have experimented with 1.5 and 1.25 hours so far. Both turned out pretty good. Next I am going to try it for 1 hour cooking time.  By the way, for cooking time greater than 1 hour just turn the timer dial by the extra time anytime during the cooking cycle.  Finally, I have cooked just 2 cups in this cooker and it came out just fine ( the instructions says a minimum of 3 cups).", "I made Persian rice for the first time using the Pars 10 cup rice cooker and it came out perfect. I used the recipe for 2 cups of rice offered by another reviewer on Amazon and followed the instructions that came with the cooker--bring water, salt, oil (and butter) to a boil in the cooker and then add the washed rice.<br /><br />I set the dial on 60 and put the lid on and when the water came to a boil I added the washed basmati rice to the pot, leveled it, and covered it with the lid wrapped in a tea towel as I'd seen a friend do when making rice on the stove top. When the dial reached the 10 mark I turned it back to 25 to add in more cooking time as was suggested in the reviewer's recipe. I think the extra time was needed because the recipe had more water to rice than most I've seen (2 cups dry rice, 3 and a half cups of water).<br /><br />When the time was up I pulled out the inner pot and turned it upside down onto a plate and--presto!--delicious rice with beautiful tadig. The rice came out of the pot cleanly in one piece leaving nothing behind. It could not have been any easier to clean the pot. I wiped it out with a soapy sponge, rinsed, and was done.", "I didn't think I needed to add yet another rice cooker to my kitchen. Then an interesting article about Persian Tahdig in the L.A. Times Food Section peaked my interest.<br /><br />The article mentioned use of the Pars Rice Cooker as an alternate way to make the recipe. (I should add that I already have both big and small Zojirushi neuro fuzzy rice cookers, plus a microwave-style rice cooker. In a pinch I can make rice the old-fashion way-- Asian and Persian style--using a covered saucepan.)<br /><br />The idea of an 'automatic' tahdig cooker was something I just HAD to try. I learned to make tahdig from Cooks Illustrated, tips from Persian friends, and now from the L.A. Times Food Section.  The Pars website was out of stock.  I lucked out when I was able to buy a 3 cup cooker on Amazon at a great Warehouse price to try it out.<br /><br />Caveat: Looking at the instructions, it was obvious upfront that it would be necessary to make tahdig several times (3 tries in my case) before finally achieving a golden crusty delicious result.<br /><br /> I used its standard rice measurer, the SAME measuring size that comes with Asian rice cookers (1 raw rice cooker cup expands to 1 regular cup of cooked rice).  I also used the rice, oil, and salt measurements for the 1 cup preparation since at first I was just testing the quality of the tahdig surface.  The measurements for oil are in metric (mm) measurements, but fortunately its rice cup included mm measurements.<br /><br />Skip the instructions that come with the rice cooker, which includes perplexing instructions for first adjusting the dial clockwise, looking for a yellow light to then turn the dial counterclockwise while cooking. (I took off 1 star from the Product Review ONLY for this issue regarding the instructions. It takes a few tries to get it right. Do NOT give up after only 1 or 2 tries!)<br /><br />Instead, adjust the dial ONE time, clockwise to the color desired to the shade shown on the dial. (Ex: the black section WILL produce black-scorched rice), so I dialed up to the most yellow color section of the dial--with pleasing golden cooked results.<br /><br /> I NEVER saw the light change from red to yellow, then realized it wasn't necessary to look for a color change of the light. Simply look for the light to turnoff, which signals that the rice is done.  To prevent soggy-ness, remove the rice pot once done. Otherwise, the rice will continue to steam, ruining the crispiness of the golden crust.<br /><br />Later I tried making the 2 cup size--which made the tahdig plus a portion of regular rice.  The tahdig had same desired results.  The regular rice section was acceptable.  I would NOT advise trying the 3 cup method. The 3 cup method didn’t allow for enough expansion of the 'upper' rice to keep the grains fluffy and separate.<br /><br />Still, if you’re more interested in the tahdig, then all you need to use is the 1 cup method.<br /><br />(In later use, if I did make 2 cups of rice, then after separating the regular rice from the tahdig rice,  I transferred the remaining regular cooked  rice into my smaller-size Asian rice cooker—using the quick-cooking rice selection to reheat and add fluffiness to the cooked rice that was in the upper section of the tahdig.  Hey...I have a thing for Asian rice, and I have the Asian rice cookers, so that works well for me if I need to reheat the regular rice.)<br /><br />Whether to add rice up front - or - wait to add rice once it comes to a rolling boil: The instructions indicate to add the rice once the water comes to a boil.  If I'm standing by the cooker doing other things, I'll add the rice once it's boiling.  However, if multi-tasking away from the kitchen, then I’ll add the rice upfront so I don’t forget it.  I did not find any discernable difference between the two methods.<br /><br />I'm glad I got it. So glad,  that I bought another to send to my tahdig-loving sister!  She hasn’t received it yet, but I’m confident she will enjoy using it and presenting nice and easy tahdigs for her future parties.", "Works great. Exterior has a sleek stainless steel finish. The timer is really efficient, b/c it lets me turn the knob to a certain amount of time, and let the rice cook on it's own. The interior, is a separate non-stick pot, where the rice is cooked in. When you are done making your rice, you can remove that pot, wash it and put it back.<br /><br />I've worked with a few rice cookers before, and this one makes the best \"tahdig\", I've seen. Really like the quality and look of this rice cooker.<br /><br />I purchased this rice cooker for my new apartment away from my family. It comes with an instruction manual, which was really helpful for me.", "Pros:<br />Good Capacity<br />Decent Cooking Dial<br />Almost perfect rice! (There are those who can make the perfect rice manually but this cooker comes relatively close to it)<br /><br />Cons:<br />Only a 60 minute dial<br /><br />Recommendation for Use:<br />If you like a more crispy bottom, do either of these two things: after the dial turns for 10 to 15 minutes, return it back to 60 for another 10 to 15 minutes of cooking time OR after the dial turns to Warm status turn it to Cook status for 10 to 15 minutes.<br />Of course, I would recommend experimenting with the time to find the &#34;perfect&#34; cooked rice as it means to you.  (Also, of course, pay attention to all the directions of the manufacturer.)<br /><br />Bon Appetit!", "I love this pot.  You cant mess it up!  I have tried all the settings and i have adjusted the oil and salt to play around with it.  The only thing I have not changed was the recommended ratio of water to rice.  I did have trouble understanding the directions and went online to read more.  SO really all you have to do is turn the dial clockwise to turn it on,  let the water, oil, and salt come to a boil.  Stir in the rice, then turn the knob again clockwise  to the time you want it to cook.  Steam will escape from around the lid but DON&#34;T PANIC-  it doesn't matter!  The further you turn it the darker the crispy part on the bottom gets.  EASY.  If you want to add other things, like dill and lima beans or sour cherries,  just add them when you stir in the rice.  My favorite is setting is the one that says 50 minutes.", "The Pars Automatic Cooker is a must-have for crust rice. Unlike Chinese or Japanese cookers, it is capable of also cooking Iranian and Afghani rice. It is user-friendly, comes with a timer and does not stick making it extremely easy to wash. The measuring lines and user manual are very helpful and makes rice cooking an art of perfection.", "Makes crispy rice, Persians favorite (Tahdig)", "what a way to make delicious rice. the rice comes out perfect every time. bring the water to boil add the rice cook for 15minutes unplug the cooker take the rice out and mix the chicken, fried potatoes, fried eggplant, anything else you like. Return the rice to the pot and plug the cooker.", "Very happy  with my new rice cooker. The instructions that come with it are a little sketchy but through trial & error I think I've got it.<br />2 T olive oil ~32 oz chicken broth ~ turn your timer to 60 minutes.  When that boils add 3 cups (measuring cup included w/ cooker) of rinsed & drained basmati rice & wait for the timer to go off & enjoy perfect rice. Love it !", "I bought this rice cooker 1 year ago, and have been using it every day. After one year, its performance has not changed at all.<br />I cannot help mentioning that the quality of produced TAHDIG (crispy layer of the rice which exclusively belongs to Persian-style rice cooking) is still excellent.<br />I do recommend this rice cooker to all who like to cook rice with Persian style and particularly to TAHDIG-lovers!", "It works great!  I get lovely Persian rice and if I put it on for an additional 10 minutes after it's done, I get perfect Tadig.  I just really wish I bought the SMALLER one.  This is huge.  You need to make at minimum 5 cups of rice at a time.  That's a lot for just a family of 3 lol!", "This rice cooker is great. This one was my second one. I was looking for rice cooker that make crunchy rice at the bottom and this does exactly that.", "Persians and Armenians will understand this: BAH BAH! Makes great Persian rice and rice cakes, just the way it is supposed to, with Tadeeg and all. Couldn't be happier!", "It makes the &#34;tahdig&#34; perfectly! Have been using it couple of times a week since I got it. Works well every time.  I bought the one that says &#34;10-cup&#34;. BE AWARE: it doesn't mean you can cook 10 cups of raw rice in it. You can cook about 4-5 of the measuring cups that comes with the product. It makes enough rice to feed 4-5 people, not much more.", "The instructions are nonsense. i went online and found recommended instructions from others. Also tried different settings myself. It produces nice rice and tahdig. Not as good as made the old fashioned way in a pot with a towel wrapped around the lid, but it's a great way to make quick full proof Persian rice with tahdig, especially for inexperienced rice cookers. Highly recommend it.", "I love my rice cooker.  I am using it all the time.  I have and will recommend it to my friends and family.  I actually bought another one today for my friend.  the only little thing is that I need to remember to turn it off all the way when the rice is done cooking.<br /><br />Regards,<br /><br />Vaji G.", "I bought a 10 cup Pars Persian Rice Cooker after checking and comparing it with other similar rice cooker.  I have cooked with it several times and it makes excellent persian rice with very nice tahdig.  The only trick for making a good rice is to follow the measuring guidelines provided in the box.  After getting my rice cooker I had to contact the customer service by email and they responded to me very quickly and to my satisfaction.  I would recommend this to anyone who wants to enjoy a nice tahdig.", "Outstanding! Made perfect rice with wonderful tahdig. I've made Persian rice since the '70s and never satisfied with crunch in the oven or on the stove, this works exactly as you would want. I read many of the comments and all were helpful, some suggested trial and error, but I had guests for dinner, so I used 5 of the &#34;cups&#34; per the one provided( I bought the 7 cup),  washed the rice throughly, soaked it one hour then added the chopped dried apricots and chopped dried sour cherries, 2 tsp salt. Into the pot I put 1/2C ghee, and the suggested amount of water. Turned the dial to 60 minutes and waited until it just came to a boil, added all the rice and fruit, used a coffee mug to compress the rice, turned the dial back to 60, the keep warm 45 minutes. Came out of the pot perfectly, no sticking at all, and perfect dark gold crunchy tahdig. I'm thrilled with this no hassle and dependable cooker for Persian rice. Also happy that it cooked the jeweled rice so that now I know I can't any version I like. The 5 &#34;cups&#34; made plenty for a party of 6 big eaters, so I see no problem with the cup measure that is included with the cooker-a lot of people complained, but, I don't get why, just add one extra of their cups and you'll be fine.<br />BTW- I saw a lot of folks wanting to know about brown Basmati rice, so here's a tip: Wash the brown rice well and soak in plenty of water over night, drain and continue as for white rice, the timing will work for the soaked brown rice with the same timing as white rice, this goes for brown Jasmine rice too, I have no idea if it would work for regular brown rice, never tried it, rarely use it.", "Ok, so you want a Persian Rice Cooker. I am half Persian, been making and eating basmati long grain rice and making Tahdig for over 40 years...so my last Persian Rice Cooker was Imperial. I gave it to my daughter after 4 years of perfection. So after searching: I purchased this PARS 10 cup. I read all the reviews, both negative and positive. I purchased one with damaged packaging to save money. It came without instructions!!! You don't need it. Follow my directions, start enjoying Tahdig after about 1 1/2 hour: thick and crispy!! Let’s go! Take the cup they provide: For every cup of rice, add one cup of water..using their cup NOT yours!! It is not a full cup but about 160ml. I recommend you use at least 2 cups, so you will have some rice after the Tahdig is made. One cup is plenty of rice for one person. So serving 4; use 4 cups unless you like left over. After you to get past 5 cups of rice, you may want to add just a 1/2 cup more water, or check during the process, about 30 minutes and if the top rice is not quite cooked completely, you can add another small amount of water. In the beginning, add a small amount of vegetable oil and water and swirl it around to coat the pot. Add rice, water, a pinch of salt and even a small 1/8 teaspoon of vinegar. Set to max setting, about an hour. I did 6 cups on my first try with this new cooker, used 6 and 1/2 cups of water and I even presoaked the rice in water for an hour prior too cooking. I set to max setting and added another 30 minutes before we were ready to eat. My results pic is posted here. You do not want the cooker to turn off  before you take rice out, or your Tahdig will be soft and mushy. To keep it crispy, Take out immediately after it turns off or before it turns off!! CRITICAL. Two cups of rice may only take one hour to make good tahdig, you need to practice with different volumes and get it the way you like it. Take it out like you would a Bundt Cake and it is not right you can easily put it back in and cook longer to get the Tahdig right. You can even eat the rice after 30 min and leave the bottom part still cooking and eat the Tahdig at the end of your meal. PARS has really done all the work for you. Forget the confusing directions, follow this for perfect Tahdig each time. I am available for questions.", "If you want to make authentic Persian rice (and you should) this works perfectly.  My guests were suitably impressed with the golden crust on my fluffy rice.  Look for the recipe that calls for dried barberries and use your imagination from there.", "I just received the ten cup rice maker and made my first batch of tagdig last night. I followed the directions others have posted (don't bother with the directions or the plastic cup included with the cooker), and it was perfect.<br /><br />For two cups (US measures) of dry basmati rice, I used 3-½ cups water along with two tablespoon of oil and a teaspoon of salt. I rinsed the rice very well (no need to soak the rice) and added everything to the cooker, smoothing out the rice so the top was even. No need to put a towel under the lid. I set the timer to 60 minutes.<br /><br />After the timer went off, I added a bit of ground saffron mixed with a tablespoon of hot water and 2 tablespoons of melted butter - sprinkled over the top. I cooked it another 15 minutes and inverted it on to a plate. It had a beautiful golden crispy shell and the rice was light and fluffy.<br /><br />Next time, I'll add the butter and saffron at the beginning with the water, which will help disperse the yellow saffron color throughout the rice, rather than leaving streaks when it's added later.<br /><br />I'd also like to try making tachin with chicken and some vegetables, but not sure about the timing. I'll obviously precook the chicken, but since it cooks for an hour I don't want the chicken to overcook. Not sure when to add the yogurt either. Any advice?", "Great rice cooker. Love the crispy rice that it produces. I have placed an order for 4-Cup version first but it was too small and can only cook 3-Cup of Royal Basmati rice perfectly and 3.5 Cup to max out. I did return the 4-Cup one and ordered a 7-Cup version.", "We got the 10 cup rice cooker and I've always made tahdig the old fashioned way, but this does make a good quick version. At first I wasn't getting a good result and then I talked to a friend who has one and she helped with the proportions and it started working.<br /><br />First of all...you must get very good Persian approved basmati rice. This is critical. I made some with a lesser rice and I got mush.<br /><br />This is what you do...<br /><br />Soak the good rice for at least 30 min and up to as long as you want.<br />Rinse it until water runs clear.<br />In the bottom of the cooker put a oil (or for even better flavor oil and ghee mixed together...you may need to turn on the cooker to melt the ghee if you do this). I put enough in so that the whole bottom is covered (sides and center).<br />Add the drained rice into the cooker.<br />Add the same amount of water as rice adding one additional cup (for 3 cups rice, add 4 cups water).<br />Add a decent amount of salt to the water.<br />Cook for about an hour and a half (you will need to add extra time on the cooker).<br />When rice is done, fluff and add some saffron tea (a bit of saffron added to hot water to release flavor/color).<br /><br />It's delicious!", "I bought this rice cooker as a gift for my half Iranian boyfriend who struggles to make Persian rice despite the tips his parents have passed on. First try - we made 2 cups of rice, with about 60ml of oil and the tah dig was amazing! As was the actual rice itself, perfectly cooked. We just put all the ingredients in, set the timer for 1 hour and forgot about it, didn’t check on it once. This product is such a game changer and we’re super excited about it.<br />It took me a long time to decide which size to get - and i ended up going for 5 which is a great size for a couple or a small family. 2 cups was enough for 3 people, I think.", "This rice cooker is fantastic.  After years of hit-or-miss success with persian rice - and getting the crust right  - this cooker did it the first try!  It is so easy to use...rinse the rice, boil the water, add the rice, salt and oil in the proportions recommended in the book and turn the dial to 60.  After it expired, I put it on another 5-8 minutes and the crust was perfect.  My family was thrilled.  Ignore the instructions in the book other than the proportions of rice to water and oil.  The rest of the instructions make no sense.  Quick easy clean up as well.  So much easier than cooking on the stove.", "Product works great if you are making Persian rice with tahdig for 2-4 people. As other reviewers have stated, after looking at rice/water amounts throw out the instructions. They are written as if someone speaking only farsi told someone only speaking chinese at the Chinese manufacturer how to write them but they need to be in English. Read them for entertainment, not information. Once you get the oil/butter and salt amount to your taste and you play with time, the rice is perfect. First time out, using the cup they provide, used 4 cups rice, not quite 5 cups water, 2 tbsp. butter, and just ground a couple times with salt, guessed at 1 hr 20 min. Rice was perfect but tahdig was starting to burn in a couple places on top. Will add lots more butter, double the salt, and reduce time to 1 hr next time. Good luck!", "This is a new model of an old & well-tried technology.  It still works beautifully & reliably.  The bottom crust (called the tahdig in Persian) is still crunchy & not too hard.  The rice itself is well cooked.  Highly recommended for rice lovers anywhere in the world, especially the orientals who are so used to wasting money & time on steamed rice & the like.", "This is an excellent product with focus on quality and build material.<br />For many who are unaware, this is not your typical rice cooker. If you are thinking about your average rice cooker then don't bother with this brand. This rice cooker is specifically made for making Persian rice. Yes you heard me right. The type of rice and the method of cooking with a Persian rice cooker is slightly different. Feel free to search online by what I mean.<br />As for the capacity, I found this size to be excellent for single person or couples at most. As a college student, this is by far an excellent investment. Just place the rice, add the oil and salt and turn it on.<br />I strongly recommend this rice cooker.", "It makes taachin! Makes great rice and tahdig but takes some experimenting to get the perfect recipe. 4 cups is good for 2-3 cups of rice. If you need a larger amount go 1 size higher. Nonstick ban is surprisingly well made and tahig pops right out when you flip it over.<br /><br />I have heard some people use a towel or cloth mamani style to make it even better. Thats not in the manual though", "- It cooks up to 3 cups<br />- Makes nice &#34;tahdig&#34; Iranian style<br />- Should be careful with setting the timer, otherwise it can burn the rice.", "I love it!  It is really easy to use, and the rice comes out perfectly:  soft inside with crunchy crust.", "Thrilled to finally make perfect Tahdig after years of trying. Please know the timer is pretty fast and does not match minutes but the tahdig color scale on the dial that you turn the pot on with is perfect for tone of tahdig doneness! Perfect thanks PAR! Also I got a 10 cup and would not recommend smaller! I make 2 American size cups of boiled rice piled in the PAR for tahdig and it is perfect!", "I've never been smitten with kitchen gadgets (or rice!), but was persuaded to buy this by a family member. It's changed my world!<br />Rice is now this delicious crispy treat that everyone loves, and the cooker makes it perfectly and beautifully each time.<br />It's easy (usage, cleaning, storage), lightweight, and I like its low-tech nature--no digital pad with a zillion options.  Highly recommend.", "I have cooked with rice-cooker 3 times so far since I got it a couple of weeks ago.  And so far, so good.<br /><br />So far I have made only &#34;chelo&#34; (plain rice).  Once I used potato for &#34;tahdig&#34; and it, too, turned out pretty nice.  For crispy potato (&#34;tahdig&#34;) you need to monitor the cooking and as soon as the water subsides, carefully empty the semi-cooked rice in a large bowl, add a little oil or butter to the pot, set the sliced potatoes, and empty the rice back from the bowl into the cooker and let it continue cooking.", "I've had this rice cooker for over 4 years and love it. The internal cooking pot, has a teflon/non-stick lining, is easy to remove and clean. The rice cooker has an automatic timer that allows you to go about your business, forgetting about the rice, as it cooks itself. You just set the timer, and when it is done, it has a \"warming\" function, where it doesn't turn off, but keeps the rice warm.<br /><br />It's perfect for making Persian rice and tahdig (crispy rice crust). One of my favorite rice cookers for persian rice. Most of my family members and friends use the same one and love it!<br /><br />You gotta try it!", "Great for cooking Persian style rice. The size is good for cooking Persian rice for one or two people.", "I have tried three of these and they all burn the rice if set to more than 30 minutes (no tahdig). I have had older models which made perfect rice and tahdig when set to 60 minutes and left plugged in for even longer.  The older units have a spring loaded button that lifts the pot a fraction of an inch at the appropriate time  but that seems to have been eliminated in the newer generation which may be the culprit.", "It is not as big as I had feared.  It is a standard rice cooker for those that wish for a pilaf non-sticky rice such as with Basmati rice.  The crispy (tadig) came out as expected.  The only thing to remember which is different to my old rice cooker is that the timer ends up at keep warm (instead of going off completely).  I ended up heating the air for a few hours after I had taken the cooked rice out and it came to cleaning when I discovered it was still hot.  This is not a big deal and a matter of getting used to it.", "Best crispy rice ever!!!", "If you like crispy rice, I mean, if you really like crispy rice and want to get a nice consistent result, this product is IT!!", "This rice cooker works great. It is perfect for tadig. I think it works better for most rice dishes, unless you are going to make a specifically Asian dish like sushi or stir fry (which would require frying in a wok after steaming). The rice that this makes is looser, more oily, and seasoned than typical rice from a regular rice cooker like a Tiger or Zojirushi rice cooker. You can make 1 to 4 cups of rice with the 4 cup model (I have the 4 cup model). I have read reviews that say you cannot make as many cups as advertised, but, at least with the 4 cup model, that is not the case. I can easily make 1 to 4 cups of rice with this cooker. It works as advertised and I would recommend it to anyone who enjoys eating rice. It is easy to use and the price is inexpensive compared to most other quality rice cookers. One piece of advice, if you would like to cook only 1 cup or rice I would recommend the 3 or 4 cup rice cooker. If you purchase a model that cooks 5 or more cups the instructions will note that the minimum amount that you can cook at one time is 2 cups. I frequently cook 1 cup of rice for myself so that 4 cup was the model I chose. I do not like to cook a lot of rice and store it, but prefer to cook rice freshly for each dinner.", "WOW!  Best rice cooker for Tadik!!!!  Makes amazing rice and can't rave enough about how great the tadik is!!", "I don't know what kind of magic is involved, but this rice cooker somehow makes a perfect pot of rice with a perfect layer of tadik. One of my smarter purchases!", "Love this brand, i will definitely get biger size too.<br />Perfect crispy rice!", "I love my new rice maker, it makes the best tatig. The trick to make a perfect rice is to put the water in and let it come to a boil before adding the rice to it. Make sure turn the timer back to 60 minutes. It’s a great product and great price. It gets 5 stars from me.", "I actually bought this small rice cooker even though I have the larger one, but this one was so small and cute that's why I bought it (and the price was very low).  It shocked me because it makes enough rice for me and hubby and have leftovers. This brand rice cooker has dials which was what attracted me in the first place as opposed to most rice cooker having one switch.  It does an amazing job of cooking rice and the timer which gives me control, is amazing.  Highly recommended. :):)", "Everything to love about this rice maker. Wash your rice; add water, salt and oil; turn it on and in less than an hour a perfect pot of rice with the best crisp all around.", "Great for making rice with the crust at the bottom and just the right size for one or two people.  I bought one for each of my grandchildren.", "It made good tadig with a little zafaron. Persian rice with golmet sabzi... it is paradise on earth. lol..... I do recommend this rice cooker.", "It cooks rice perfectly, and creates wonderful rice crispy!", "Makes perfect Persian rice. My only comments: Do not need as much oil as it says to use.  And the instruction booklet is terrible!!!!", "I am very satisfied with this purchase.  It makes great Persian style rice, the grains of rice are separate after cooking and not sticky.  There is a nice golden crust on the bottom and the non stick coating of the pot allows you to easily invert the rice onto a platter for a nice presentation.  I bought the 8 cup size and the instructions say that the minimum recommended amount of rice to cook is 4 cups.  (The rice cooker comes with a plastic measuring &#34;cup&#34; that is equal to 3/4 cup U.S. measuring cup.)  The water, salt and vegetable oil are brought to a boil in the rice cooker and then the rice is added and cooked for about 50 minutes.  As with any rice cooker, the steam when cooking is hot so caution must be used when removing the lid.", "Finally got my Pars Rice-Cooker in the mail. Looks easy to use. I bought the 3-Cup version. Looks small. But I will give it a try before ordering a 5-cup model. Made my first batch of crunchy Persian-style rice. Easy-Peasy-Japanesey.", "Does a good job of making Persian style crusty rice, pretty easy. The directions that come with the unit are virtually worthless, clearly a very bad translation from Farsi and so you are pretty much guessing at how to use it. But, you experiment and figure it out.", "I just received this product and the first thing I noticed is that the lid does not fit the nonstick pot well. It is as if either the lid or the pot is not a perfect circle, as a result the lid does not sit tightly on the pot and pivots on an axis. Maybe I just got a defective unit???  At any rate, I gave it a try and the rice it made was amazing with perfect delicious Tahdig. Couldn't be any better!!!  (hence, the 4 star)..... So despite its defective lid, it seem to perform really well. But I hate to settle for a defective product. So I decided to return it for a replacement. I will get a new unit and will update this review later.<br /><br />Update 11/06/2015: I got the replacement (Thank you Amazon, such a smooth and great customer service). The replacement is perfect. I changed the rating to 5 stars. This is one good Persian rice cooker that makes perfect quality Tahdig. Just what I was looking for. I highly recommend it.", "I’ve never had rice like this and now I am addicted.", "You'll never go back to plain rice again.  This is easy and so tasty.  I used to have a Persian Rice Cooker by Imperial, but it was inconsistent in the crispiness of the Tadiq that it made.  The PARS rice cooker is consistent and delivers a great, thick crust on the rice.  The rice does not stick to the inside, so it is very easy to wash.  The timer works perfectly and I have not had any issues with it at all.  Be prepared to make the most delicious rice of your life with this rice cooker.  And also be prepared to have your friends start requesting it as soon as they taste it.<br /><br />Rice is no longer a side for me, but sometimes a center part of the meal.  I've made it with curry to pour over it and the crunchiness of the Tadig really adds to the dish.  It adds texture, flavor, and makes the dish feel more substantial.", "This is a 6 cup cooker, NOT 7. And the model number is DRC230, NOT DRC240 like in the picture. VERY deceptive listing. Otherwise,this rice cooker is awesome. Perfect rice every time. I just cant make as much as I was hoping to. Too much trouble to return it.", "The product indicates it is a rice cooker with 7 cups capacity. When you read it you think it is 7 cups of Rice. No it is not. The Capacity is 6 Cups of rice with 7 Cups of water. I guess my Iranian friends are getting smart in getting around the edges in advertising. The product is very good and it does what it is supposed to (cook rice with a good \"Tah Dig\" = Crusted Rice at the bottom of it). SO if you need more capacity than 6 cups, this is not for you, select the next model but deduct 1 cup from what it says it does.", "I don't know how I survived before without this wonderful appliance! We eat Persian rice all the time now and it comes out perfect each and every time effortlessly!", "The best and the easiest way to make persian rice with tadic..  I was given as a gift  one 6-7 cup along with the finest Indian Authentic Basmati rice.  It is the best persian rice one can make.  Put rice, water, oil, salt, pepper. or any other ingredient - together in the pot, turn it on and forget it.  Voila a perfect Persian rice.  I love it.  I have already purchased three cookers and the rice to give for gifts.  Highly recommend it.", "Love this cooker for Persian rice with crust. Follow the directions regarding the measure of ingredients and you won’t go wrong. Takes a couple of iterations to get the crust as crispy or light as you prefer. I like mixing in herbs as well. Would be nice if they had a recipe booklet included.", "I was able to cook a variety of persian rice and great tahdigh. Next step is teaching my 15 years old to do it too!<br />A must have for anybody who wants to cook persian rice a have no to little time.", "Perfect rice and tahdig every time.", "The real deal. Sure, the instruction booklet makes zero sense. In fact, I read it as a comedic relief. But once you figure out the timer (based on the type of rice and how many cups you’re cooking), it does the trick. The crispy bottom part of the rice makes it easy to flip upside down as a cake before serving. I had a warranty issue with mine upon using it the first time and the seller was excellent in remedying it. Great buy!", "Tahdigesh tahdigeaaa!!!<br /><br />This is a great rice cooker if you love tahdig (crispy bottom layer of rice) and don't mind some parts of your rice sticking together. It's fairly simple to use and the instructions were helpful. My only negative would be that the cord is too short. Good product overall.", "This rice cooker is really nice. My husband loves it so much that I had to stop him from cooking rice every night. I was afraid of gaining weight :-). The only problem is that it is too small. I ordered a 5 cup size but It is just a 3 or 4 cup, in my opinion. I wish it was a bit bigger. Other than this, it's perfect.", "This Persian rice cooker is perfect for my purpose and meets all my demands. It also gives good tah-dig which we love. I can cook max 8 cups of rice.", "Love it so easy to cook and clean, there is just one problem this rice cooker is so small and the measuring cup measures less than a cup. I ordered 3 cups rice cooker but in reality it cooks 2 cups. Overall for my small family it works perfectly fine I cooked this mixture of rice and quinoa in 20 minutes and came out as I wanted 😋.", "Yes  I like, the pars rice cooker really works, I got my crunchy rice. I recommend to buy this excellent product", "I love this rice cooker. My family is Persian and cooks a lot of rice, and this rice cooker is super easy to use. I just clean the rice, add butter and salt, then set the timer and it is perfectly done in 1 hour. The only down side is that it likes to splash water out the top hole during part of the process so I have to put down a towel or else it gets everywhere.<br /><br />However, I have used this rice cooker for years (granted I have to replace it every so often, probably once a year because the tadig starts turning out weird). It is super easy to use and an easy clean up.", "I love this but the amount of rice/water in the cookbook is off. I had water oozing out of the pot. However, I took some out and let it continue. The final product was perfect (though adding a bit more saffron is something I will do next time). Soooooo, happy with this purchase!", "I have not tried it for conventional white rice but a Persian rice cooker is so easy to use!! 30min gets 1 cup of rice cooked to perfection!  Tasty and very soft!  follow the directions, no rocket science here.  I added some garlic and onions to give a bit of flare and no issues!.. Rice was perfect first time out!", "50 minutes great tasting rice and if you like pegao aka crusty rice this is the cooker for you. I have my sisters now sold on this product.", "Perfect size. Love rice , love it", "Works very well, but instructions are really bad.  Make really good Persian style rice.", "Making Persian Rice in this cooker is a breeze. Only wish I had sized up. The tahdig (crispy rice on the bottom of the pot) comes out perfectly. Only problem is everyone wants it.  Lol. I plan to purchase three of the these  larger sized rice cookers to give as Christmas gifts to my grown kids and their families.<br /><br />The instruction book is terrible. Read other reviews for guidance on amounts of water, rice, salt and oil to use.", "Perfect size and does a great job of letting you set the crispy level of the bottom of the rice.  We really like it.", "Takes a while to get the science.  The instructions say the light changes colors and it doesn’t. After reading reviews and figuring it out the rice comes out perfect every time", "works beautifully, TADEGH ready, if you use 2 cups of rice add 2 and a quarter water. wash the rice fist wait for the water to boil add rice oil and salt, then get ready to feast.", "Works perfectly!  Affordable, easy to clean, but hot to the touch.  This works perfectly, although the recipe inside I found had to be adjusted to add more water.  It heats quickly, the rice doesn't stick, and it cleans very easily.  I love it and use it frequently.  The only bad points are that the cord is very short and the outside is hot to the touch unlike some that stay cool on the outside.", "...you know that Persian cooks disdain shortcuts to any meal.  BUT this rice cooker can make rice with tahdig that is indiscernible from the original (much longer and more complicated) method.  You can find excellent directions among previous reviews, which, if followed, will turn out perfectly cooked rice and tahdig in less time and no bother.", "Love this. Easy to clean and easy to use and the rice comes out perfect every time.  Does anyone know if it can be used successfully with brown rice?", "This is the greatest rice cooker. The tahdig is perfect and it is so easy to use. The rice impresses guests.", "Makes good crust if you like bottom crust. The easiest way to make good rice. The size is just right for two people. Easy to clean.", "The best rice 🍚 cooker ever I love it 😻", "Perfect Persian rice every time.", "Rice and Tahdig (Crispy Rice) came out phenomenal, so delicious that I could eat the rice by itself.<br />But.....The top is wobbly and does not fit very well..", "I love this to make rice the Persian way", "Tahdig is what we bought this for, and what it excels at. Following directions and ratios works well. Only thing I would add is to soak the rice for at least 15 minutes before starting. There is no need to let the water boil before adding the rice. Just put everything in together after the soak and the tahdig will be amazing.<br /><br />(p.s. don’t forget to turn it off after you’ve removed the rice. Also, make sure you don’t use any hard utensils on the teflon.)", "I’ve cooked rice for the first time ever and as you can see it in the pictures it came out just perfect and I love it. Buy this rice cooker and make your dinner perfect.", "My mom has used this product for years and it makes the best rice so I decided to purchase one as well. It makes great crispy rice also known as tahdig in pharsi.", "My mom loves it. It makes Persian rice and tadiq perfectly for one or two people when she is in the mood to set it and forget it and skip the usual method. Clean up is easy.", "I love this rice cooker. It makes the best Persian rice. Easy to use and easy to clean.", "Did exactly what it's supposed to, makes perfect tadig. This was the right size for 4 people to have plenty, making a partial quantity. The directions could be a little better, but searching online and in these reviews provided information to make perfect Persian rice.", "The rice was a little mushy, but the tahdig was perfect.", "Makes great rice. Makes amazing tahdig. Love this thing!", "It’s strange that there are so many bad reviews for this product. I have been trying to make Persian rice on the stovetop and failing miserably, and I’ve also tried an instant pot tahdig recipe that also failed to create any kind of crispy layer. My prior attempts at making tahdig deserve bad reviews. But this product? It’s awesome! This was the easiest thing I’ve tried and it came out perfectly. Yes, the instructions are a joke, but products made in other countries often have absurd wording. If you can find it and buy it online, can‘t you also search recipes and tips online? I found so many, mostly recommending an almost 1:1 ratio of rice to water, with just a little more water. I used 2 cups rice, 2 and 1/4 cups water, 50ml oil and a pinch of saffron. I used exactly half of how much oil is on the chart in the instruction booklet, as recommended in many reviews. I think the salt quantity in the chart is spot on. Next time I’ll use ghee, or maybe experiment with some chopped dried apricot or nuts or something fun.<br />One complaint that I read from many reviewers was that the included measuring cup isn’t a “true” cup. It’s not, a standard US cup is 240 ml, the Persian cup supplied here is 180 ml. Think of it more as a SERVING SIZE. So 4 cups of rice measured with that 180 ml cup serves 4 (very hungry) people. Buy the “cup size” for the number of people you’ll be serving, the four cup size is PLENTY big for a family of four. I’d hate to see us actually eat four whole US cups of rice as just part of a regular meal!", "I suggest  you read the reviews that had suggested correct recipes The pamphlet that come with the cooker is hard to understand. But once you use one of those perfect persian  rice every time", "Perfect for a two-person household.  Produces great rice and a great Persian tadigh crust.", "good product, love the crispy rice, I use it to cook Asian rice, which worked well.", "Great Persian rice, nice and crusty.<br />Only problem lately, the timer works sporadically.<br />A week over for sending it back.", "I purchased the 15 cup rice cooker for my mom, though it does a good job making rice, it only fits 5 cups at most. I truly think the size is mis advertised and the description is wrong. Unless they have shipped the wrong size to us. How can I verify?", "This rice cooker greatly simplifies making Persian rice with tahdiq.  So, very pleased with the results.  However, like other rice cooker manufacturers, calling it a \"5\" cup is misleading.  the cup they provide is not a cup (ie, 8 oz), just like many other companies.  It comfortably cooks 2 cups of rice. Might be able to do 2-1/2, but I wouldn't try more. Also, the 60 minute timer is a limitation.  Would prefer 90 minutes.  It's a pain having to go back and add additional minutes.  Doable, but an annoyance.  Just cooking for 60 minutes does not give dark enough crust, barely blond. Needs an extra 15 minutes.  For brown Basmati, an extra 25-30 minutes.", "Very good,  we are very happy and we are making the best rice with this machine.", "I have a larger Pars rice cooker and had been looking for one that accommodates a maximum of 3-cups of rice. This rice cooker is perfect - one can use 1 to 3 cups of rice and it is easy to use and easy to clean. The rice comes out perfect and I even used basmati brown rice and it turned out to have great crispy \"taddiq\" and delicious tasting rice. My only criticism is that the instructions for this rice cooker are a bit confusing when the procedure is actually quite simple. I don't know why they have this long paragraph (step 6) about how hot the water boils, etc., in the middle of the step by step instructions. Overall, I am very pleased with my purchase and how this rice cooker performs.", "If making rice and following the instructions then you will have excellent rice.", "If you know how to cook persian style rice, this will be your favorite. Simply just soak the rice in water in advance (timing will be depend on type of rice like basmati for 1 hours at list) then flow the instruction of rice cooker and you are set. If you like the darker color tahdig, you may bring the dial to the max again half way once it start cooking.", "This small rice cooker is perfect for my small family. I made organic basmati rice with it and it turned out amazing. Rice grains do not stick to each other  which I usually could achieve only by cooking rice in traditional Iranian way so I am very impressed  (except on the tahdig part) I recommend this rice cooker", "Pars rice cooker has perfected the art of cooking rice along with preparing the best Tahdig “crunchy rice”. The ease of using this unit makes it even better. I recommend to all those who always like the Persian flavorful rice to buy this rice cooker which provides you the best with no hassle. I am a guy and I don’t like cooking and be in a kitchen for a long time so trust me when I say “Best” and “ No Hassle” ! Enjoy your perfect TAHDIG now.", "This was a great purchase. I only wish I had bought the larger capacity rice maker.  As a Persian who knows what great rice (polo) should taste like, this cooker makes amazing rice.  The tadig (the crunchy cover) is fantastic!  I follow the directions and it makes excellent polo each time.", "The rice is cooked well, the lead is not glass like the picture, overal it is great to have, tahdig is done well if you want a great tahdig then once it is done put it back for another 10-15 minutes and it will be a great tahdig.", "I love this machine!  It was so easy to use, once I figured out the instructions!  I used proportions for one cup of rice, set for 50 minutes, added some Lima beans and voilá, perfect rice!", "I use it several times a week.  Easy to use and rice turns out great.", "Perfect for making Persian rice and tahdig! Great for Sabzi Polo as well!", "I bought this specifically to make the type of rice I had growing up at my Persian girlfriend's house and it has not disappointed! It turns out perfect every time!", "for normal rice I woudn't need this, but for a good crispy Tadiq - perfect!", "I've only used it once and it was perfect! It made some good rice!", "Easy to use. Excellent rice!", "This 4 cup rice/tadiq maker is perfect for  1-4 people. If you eat lots of rice per serving , I would suggest 2-3 cups of long grain basmati rice in 4-6 cups of water. (1Cup rice to 2cups water)", "Great rice produced with &#34;Tadek&#34;", "Love Persian rice", "Best rice cooker in the world to have a golden crispy rice!!", "Makes a lot of rice, so would not need a larger size for our family (good for 6-7 servings easy)", "This is an amazing rice cooker! Warning; Persian rice is addictive.", "We bought the five cup model, but according to the YouTube video, the same directions apply to all models. My advice is DON'T READ THE DIRECTIONS. They must have been translated from Pharsi by a vengeful member of the Republican Guard. Instead seek out the YouTube Pars video that explains the operation of their rice cookers in blissfully simple, step by step instructions. Put in the ingredients, twist the timer, leave it for an hour. That's it. All the gobbledygook in the instruction manual about red lights, yellow lights, re-timing etc should be totally ignored. And remember that the \"cups\" measurements in the table of ingredient proportions refers to the little plastic cup that comes with the cooker, not standard cup measurements --another trap just to trip you up.  Why couldn't this company write an easy manual for a cooker?  It is actually beyond simple to use and makes perfect rice with tahdig?", "I already own one of these cookers and I absolutely love how the rice turns out. HOWEVER,<br />- I ordered this rice cooker on Nov 30, and it arrived on Dec 24.<br />- Once arrived, it had a huge dent in it.", "Good for making Persian rice", "Great for making the persian rice with the crispy bottom. So easy to use!", "Becareful, the size is really small. So if you want to cook 5 cups of rice for about 4 or 5 persons buy the 7 or 10 cup cooker.", "Easy to use<br />Easy to clean<br />Wonderful crispy rice on bottom 👌", "Best investment I have made for my kitchen!! Even a non-kitchen savvy, white girl, like myself, can make incredible Persian rice. So delicious and so easy to make!", "It works beautifully but I had requested a 5 cup rice cooker and got 4 cup one which works perfect with 3 cups of rice.", "this is best of all other brand my 3rd one for gift and my own make it best Persian rice", "Super easy to clean and makes fantastic rice!", "easiest tool to make Persian rice with crispy bottom.", "This is exactly what I needed to make the excellent rice &#34;cake&#34; rice!", "Delicious rice every time. It's so easy to use and keeps rice hot and ready to eat for hours.", "Gave to both my sisters for Christmas and they loved it and said their Persian rice came out delicious.", "Easy to use and makes perfect rice", "I cooked the maximum amount of rice in the cooker, and it turned out perfectly. The cooking directions were hard to understand, though.", "This product is fantastic. It doesn’t have the complexity of other product and it do the job perfectly. As you know this rice cooker make a layer of crusted rice which is amazing, not many rice cooker do that.", "rice I love it its very impressive I one I have is 12 cup  very good", "Makes the best rice ever!!", "First: about the product.  It was perfect out of the well-insulated box.  I am not a cook so I need all the help I can get.  This rice cooker made it so easy.  Just add the ingredients, turn the dial, and done!  Perfect Persian rice and tahdig (the crispy bottom of the rice).  It is a no-brainer.  I've seen videos online of people using pots and pans to cook the rice, then re-cook for the tahdig.  This is so much easier and more consistent.  The results speak for themselves.<br /><br />Second: about the company.  Very responsive.  I emailed them before placing my order to inquire how quickly I might receive the rice cooker from the time of ordering it.  I received a very prompt reply with the specifics of their shipping.  I ordered the cooker, received it in 2 days, and cooked rice that night to the delight of the family.<br /><br />Highly recommend!", "Perfect for making crispy rice .", "Love this rice cooker glad I got the biggest one. More cooking area for more burnt rice!", "Burnt rice"], "reference": [112, 52, 27, 27, 24, 23, 16, 12, 10, 9, 9, 8, 8, 8, 8, 7, 6, 6, 6, 5, 5, 4, 4, 4, 4, 4, 4, 4, 4, 4, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.019444444734189246, 0.07600000113248825, 0.08888889021343654, 0.10000000149011612, 0.17499999701976776, 0.05510204178946359, -0.01868512138569644, 0.3888888955116272, 0.07500000298023224, 0.04444444510671827, 0.20000000298023224, 0.699999988079071, 0.4000000059604645, 0.10000000149011612, 0.699999988079071, 0.15000000596046448, 0.20000000298023224, 0.699999988079071, 0.07500000111758709, 0.5750000029802322, 0.10000000149011612, 0.22500000894069672, 0.1714285679009496, 0.04300000064074993, 0.6000000238418579, 0.1760000044107437, 0.8999999761581421, 0.09722222367094624, 0.47777777910232544, 0.02500000037252903, 0.30000001192092896, 0.27500000409781933, 0.1750000026077032, 0.5, 0.10000000149011612, 0.8999999761581421, 0.5, 0.20000000298023224, 0.022222222553359136, 0.3125000046566129, 0.5, 0.27500000409781933, 0.10000000149011612, 0.8999999761581421, 0.2750000096857548, 0.02500000037252903, 0.800000011920929, 0.30000001192092896, 0.8999999761581421, 0.15000000223517418, 0.4000000059604645, 0.7750000059604645, 0.699999988079071, 0.6000000238418579, 0.8999999761581421, 0.800000011920929, 0.4750000014901161, 0.4000000059604645, 0.800000011920929, 0.6000000238418579, 0.5, 0.5000000009313226, 0.800000011920929, 0.30000000447034836, 0.800000011920929, 0.4359999912977218, 0.800000011920929, 0.6000000238418579, 0.800000011920929, 0.25000000931322575, 0.30000001192092896, 0.10000000149011612, 0.10000000149011612, 0.30000001192092896, 0.800000011920929, 0.7000000104308128, 0.10000000149011612, 0.800000011920929, 0.5, 0.8999999761581421, 0.699999988079071, 0.125, 0.699999988079071, 0.4000000059604645, 0.6000000238418579, 0.800000011920929, 0.375, 0.8999999761581421, 0.699999988079071, 0.4000000059604645, 0.8999999761581421, 0.800000011920929, 0.10000000149011612, 0.8999999761581421, 0.04444444510671827, 0.5, 0.30000001192092896, 0.20000000298023224, 0.800000011920929, 0.20000000298023224, 0.699999988079071, 0.800000011920929, 0.03200000047683716, 0.30000001192092896, 0.8999999761581421, 0.6000000238418579, 0.4000000059604645, 0.20000000298023224, 0.2500000037252903, 0.800000011920929, 0.7111110952165393, 0.15000000223517418, 0.10000000149011612, 0.30000001192092896, 0.7250000089406967, 0.30000001192092896, 0.5, 0.4750000014901161, 0.8999999761581421, 0.699999988079071, 0.4000000059604645, 0.699999988079071, 0.6000000238418579, 0.8999999761581421, 0.066666669315762, 0.699999988079071, 0.8999999761581421, 0.800000011920929, 0.5, 0.20000000298023224, 0.699999988079071, 0.699999988079071, 0.800000011920929, 0.699999988079071, 0.20000000298023224, 0.800000011920929, 0.699999988079071, 0.4000000059604645, 0.699999988079071, 0.8999999761581421, 0.30000001192092896, 0.7249999940395355, 0.800000011920929, 0.10000000149011612, 0.8999999761581421, 0.20000000298023224, 0.5, 0.699999988079071, 0.8999999761581421, 0.566666689183977, 0.699999988079071, -0.30000001192092896, -0.4000000059604645]}