{"reviews": ["I was excited about purchasing the PARS Persian Rice Cooker but when I used it for the first time I realized that the rice to water ratio from the directions that came with the cooker were not correct, the rice was dry and hard.  I played with the water ratio and the rice came out much better.  You will need to add more water then the directions say.", "This is the first time I have been successful making tahdig! The only problem I encountered was the English translated directions. They didn’t need make any sense at all. Thankfully I called my Persian friend who told to me to buy it and she gave me the quick version. Basically just throw everything in the cooker and turn the knob all the way until it won’t turn any more. It’s a timer so once it turns off your tahdig is finished. Perfect every time!", "Ok, so you want a Persian Rice Cooker. I am half Persian, been making and eating basmati long grain rice and making Tahdig for over 40 years...so my last Persian Rice Cooker was Imperial. I gave it to my daughter after 4 years of perfection. So after searching: I purchased this PARS 10 cup. I read all the reviews, both negative and positive. I purchased one with damaged packaging to save money. It came without instructions!!! You don't need it. Follow my directions, start enjoying Tahdig after about 1 1/2 hour: thick and crispy!! Let’s go! Take the cup they provide: For every cup of rice, add one cup of water..using their cup NOT yours!! It is not a full cup but about 160ml. I recommend you use at least 2 cups, so you will have some rice after the Tahdig is made. One cup is plenty of rice for one person. So serving 4; use 4 cups unless you like left over. After you to get past 5 cups of rice, you may want to add just a 1/2 cup more water, or check during the process, about 30 minutes and if the top rice is not quite cooked completely, you can add another small amount of water. In the beginning, add a small amount of vegetable oil and water and swirl it around to coat the pot. Add rice, water, a pinch of salt and even a small 1/8 teaspoon of vinegar. Set to max setting, about an hour. I did 6 cups on my first try with this new cooker, used 6 and 1/2 cups of water and I even presoaked the rice in water for an hour prior too cooking. I set to max setting and added another 30 minutes before we were ready to eat. My results pic is posted here. You do not want the cooker to turn off  before you take rice out, or your Tahdig will be soft and mushy. To keep it crispy, Take out immediately after it turns off or before it turns off!! CRITICAL. Two cups of rice may only take one hour to make good tahdig, you need to practice with different volumes and get it the way you like it. Take it out like you would a Bundt Cake and it is not right you can easily put it back in and cook longer to get the Tahdig right. You can even eat the rice after 30 min and leave the bottom part still cooking and eat the Tahdig at the end of your meal. PARS has really done all the work for you. Forget the confusing directions, follow this for perfect Tahdig each time. I am available for questions.", "My first rice cooker of this nature and we love it!  Easy to use and the product is great.  It is annoying that the timer only provides for 60 mins, but I wouldn't let that deter me from this cooker.", "While the instructions are not good, I like the cooker.  I had a crispy bottom like I wanted the first time I used it"], "reference": [6, 4, 4, 3, 0], "score": [-0.4000000059604645, -0.10000000149011612, -0.05000000074505806, -0.20000000298023224, -0.4000000059604645]}