{"reviews": ["I bought this rice cooker during my kitchen remodel, when the only methods of cooking I had were crock pot, microwave, or hot plate.  This thing was, and still is, a life-saver!<br /><br />I love brown rice, but I hate the intense, laborious process of cooking it on the stove.  Watching the heat, getting the water amount just right, constantly having to baby it...no thanks.  With my Zojirushi I just set it to brown and go to town (haha).  The brown rice cycle takes about 2 hours...but if you use the built in timer function, you can have brown rice (or any kind of rice) ready and waiting for you at the time you desire.  The time you set on the timer is the time that your Zojirushi sings it's corny little japanese song to let you know that your rice is ready to eat.  If you aren't ready for it yet, your rice is kept warm without getting dried out or crusty.<br /><br />If you've never tried short or medium grain brown rice, do it.  It's so much better for you and most people I've cooked it for prefer the texture of short grain brown rice to the more common long grain.  In case you were wondering...PF Changs uses medium grain, but I've had trouble finding that.<br /><br />White rice always comes out great, not too sticky or wet...though it does take around 45 minutes.  I make a lot of spanish rice...here's a quick easy recipe for that:<br /><br />**SPANISH RICE***<br />2 Zojirushi Cups White Rice<br />1 Small can Tomato Juice (I think it's 8oz)<br />2-4 Teaspoons of Chicken Buillon  (or use chicken broth instead of the water)<br />2-4 Tablespoons of Taco Seasoning<br />Fill with water to \"2\" and cook on white rice setting<br />It's a pretty forgiving recipe and I frequently spice it up with additional ingredients....chipotle peppers, sweet corn, etc.<br /><br />I also make steel-cut oatmeal nearly every morning.  My timer automatically has it hot and ready for me when I get up for work.  I use 1/2 Zojirushi cup of steel cut oats (rinsed) with 1.5 zojirushi cups of water.  All of this goes in the night before.  More often than not, I have to clean the inside steam vent cover after cooking this, but that doesn't take long.<br /><br />This is the first rice cooker I've ever owned, so I can't vouch for the performance of any other model, though I suspect I'd be disappointed with the cheapo on/off ones sold by most stores.  The 5.5 cup capacity has been plenty for me & my roommate....usually 2 cups is enough for us (and we eat a lot).  I typically cook 4 cups so that I've got leftovers or lunches.<br /><br />If you're trying to decide between this and the induction model...you really don't need to spend the extra money...this one does just fine.  I can't imagine the results being any better than they are...save that extra $100 for something else.  I got the stainless finish because it matches my other appliances, but I'm sure the cooking functionality of the other models is identical.<br /><br />At the time I purchased mine, Amazon was charging a bit more, so I ordered it, cheaper, from a place where I usually buy computer supplies.  Now I see that Amazon has it for about the same price.  You really can't go wrong with Zojirushi.", "I generally only make 1-2 cups of jasmine rice and it comes out great every time. I have yet to make a good batch of basmati rice, but I think its my technique rather than the rice cookers fault.<br /><br />Pros:<br />* The timer - awesome! I set a batch of rice in the morning before work, and will have perfect rice ready by the time I come home. Don't forget the display is a 24H clock though, like I did :)<br /><br />* Extended keep warm cycle - I have set this in the evening with my leftover dinner rice, and had pretty decent rice for breakfast the next morning. Obviously its not the same as fresh cooked rice, but its not bad.<br /><br />Cons:<br />* Not a huge deal breaker, but the inner parts aren't dishwasher safe, so I have to wash it all by hand.", "Very easy to use and makes fantastic rice.  The pot inside is non-stick and very easy to clean.  Markings inside the pot make getting the rice-to-water ratio right a snap.  Only thing I would mention is that while being able to make 5 1/2 cups of rice at one time is nice, the minimum batch is 1 cup.  That's a lot of rice if you happen to be cooking for one with any regularity.  Some of the smaller models will cook 1/2 cup batches, which is a much more manageable amount for most one-person servings.", "If you're like my family, you eat a lot of rice. So if you do you want to buy a rice cooker that will last a long-time and make good rice. Zoji's are the best brand out there for cooking rice. This model fit our needs perfectly and was priced right. We have an older style simple click-on large pot Zoji that we bought years ago and it still performs nicely. But it was too big for just 1-4 cups of rice so I shopped around for a smaller one.<br /><br />A tip for cooking white rice: Rinse your rice at least 4 times! Also if you choose 2 cups or any number of cups in between the marked lines on the bowl, it may be harder to get the right about of water. When I had 3 cups of rice, I filled exactly to the marked line for 3 cups and the rice was perfect. I tried two cups and eye-balled the water and the rice came out a bit mushy so I obviously added too much water. I'll have to try again and see if I can't get it right the next time."], "reference": [22, 4, 0, 0], "score": [0.03125, 0.6000000238418579, 0.6000000238418579, 0.07993826981817866]}