{"reviews": ["Wow!  This thing is great!  I have struggled making Persian rice on the stovetop.  No more!  This cooker makes it so easy!  It makes perfect tadig.  Here is how I do it, and it works for just about any amount of rice.  I have not tried any less than 3 cups (included Persian rice cups, not standard measuring cup), but this recipe works for 3+ cups:<br />Wash the rice - get it good and clean.  I wash about 5 times, right in the cooking pan.<br />Cover rice with water - add water until the rice is covered by about 3/8 - 1/2 of an inch of water<br />Add salt.  I add about a tablespoon per 3 cups.<br />Add oil.  I never measure but add a healthy splash of oil, probably a quarter cup (standard measuring cup) per 3 cups rice.<br />Stir and set to 1 hour on timer.<br />While cooking, I crush some saffron and grind with salt to a powder, and dissolve in about 1/4 cup boiling water.  Let sit.<br />About 10 minutes before the timer is done, I add a half stick of butter (1/8 pound) cut into about 8 pieces onto the top of the cooked rice, and pour the saffron water over the rice.<br />Let it finish cooking the remaining 10 minutes.<br />Perfect Persian rice!", "I'm half Persian and have a love for tahdig! I've never made persian rice or tahdig before, so I bought this rice cooker and on my first try it came out PERFECT! There is no need to soak the rice overnight with this cooker. I rinsed 3 cups of rice (using the measuring cup provided) until the water was clear and mixed the drained rice with 6 tbsp of canola oil. Next I put the rice in the pan and added 3 1/2 cups of water and a little salt. I wrapped the lid in a tea towel, plugged the cooker in and turned it to 50 minutes and it came out great!!", "Throw the directions out because they don't make any sense.  Very poorly translated instruction manual, but using it is self-explanatory enough that you don't need the manual anyway.<br /><br />If you want to make rice for yourself or for a couple more people, it's the perfect size.  If you want to make more than enough for four people or if you eat a lot of rice, I suggest getting a larger sized cooker.<br /><br />It's very easy; you just add your water, salt, and oil, let that combination boil, then add your rice.  Stir it, cover it, and walk away from it for an hour or so.  Makes great Persian-style rice and is very easy to clean.<br /><br />Don't buy this if you're looking for a normal, multipurpose rice cooker/steamer/slow cooker because this unit will cook the bottom of the pot to a crisp - I bought it specifically for that purpose, to make a crispy crust on the rice called tahdig.  Because of how the heat is distributed, it would be hard to avoid burning the bottom of the pot if you wanted to use it for things like soup or stew.  It should only be used for rice.", "The main thing people seem to note about these cookers is a lack of instructions, so I want to address that for any skeptics.  There is a booklet that tells you the water-to-rice proportions, but it doesn't say how long to cook it.  Don't let that deter you;  a quick google search turns up a multitude of sets of instructions, and they all pretty much say the same thing:  cook for an hour and a half.  Some say clean and soak the rice, some don't, some are very detailed, some aren't.  It's all a matter of personal preference.  I just used this cooker for the first time tonight with no special prep-work, just tossing the rice, water, and oil in, setting the timer, and coming back in 90 minutes, and the results were AMAZING!  It is so easy, and if I can do it, I'm confident anyone can.<br /><br />Now as for the quality of the construction:  this cooker is beautiful!  It has all-metal construction, feels very sturdy, and cleans up so easily.  The pot comes right out and I had it cleaned in 2 minutes.  Only complaint (and you will see this everywhere this machine is talked about) is that the timer maxes out at 1 hour.  But it's really no trouble to just set it twice.  For all the labor saved in using this over the traditional way of making tahdig, resetting the timer shouldn't even show up on your radar.", "An excellent rice cooker for making the famous Iranian Tehdegh rice. It is very easy and straightforward to make.  The instructions are confusing. Suggest you follow the rice and water proportion and use your judgement for oil and salt. You can vary the cooking time depending on how much crunchy you like the Tehdegh (bottom crust). You will need to cook at least for an hour, the maximum timer limit.  I have experimented with 1.5 and 1.25 hours so far. Both turned out pretty good. Next I am going to try it for 1 hour cooking time.  By the way, for cooking time greater than 1 hour just turn the timer dial by the extra time anytime during the cooking cycle.  Finally, I have cooked just 2 cups in this cooker and it came out just fine ( the instructions says a minimum of 3 cups).", "I’m not one to write many reviews but as I love this Tahdig cooker, I had to sing its praises. I’ve been wanting to make Tahdig for a while and watched a lot of videos on YouTube. I found them fairly intimidating but had found references to the Pars cooker. I bought the 4 cup one as there are 2 of us and I don’t entertain big crowds any more. It did sit in its box for a while but once I started using it, it didn’t even go back into the appliance cabinet. I have made only the one cup servings which is more than enough for the 2 of us. Their cup measure is less than a regular measuring cup and it gives a lot of crunch surface area. I’m still experimenting with “darkness” settings and different kinds of oils. I’ve used olive oil, canola oil and ghee and it comes out slightly differently but perfectly and crunchy every time. I do add saffron and have added Greek yogurt to sone batches. I’ve done it with cold water as well as waiting for the water to boil ( when I add the saffron strands and mash them). It’s great every time. The Tahdig comes out of the bowl easily and it’s very easy to clean.", "Look at other brand rice cooker, you will be happier. I have two other rice cooker from different brand and they have been working fine for almost twelve years.  the reason I bout this one was because the large 15 cups( which is not really able to cook 15 cups of rice, it is just enough for 10 cups)I bought this on July of 2015, and after about two months later used it for the first time, but realized that the on and off automatic timer system did not work. The rice cooker kept working and working no matter which time I put it on. I had to plug off the cooker in order to stop it from cooking. first rice dish came out burned in the bottom and second one was good because I unplugged it on time.The cooker was new out of box, but broken. It should not be sold with electronic malfunction. I called the manufactory and talked to the owner's son. I explained everything to him. He said that he will talk to his dad the owner of the company and will get back to me. He took all my information, but have not heard from him for almost 10 months. I even left another message  reminder for him, but nothing was done about it.", "Love the cooker, although the lid is a chrome lid - not the glass lid pictured here.  Other than that - the cooker is great!", "Outstanding! Made perfect rice with wonderful tahdig. I've made Persian rice since the '70s and never satisfied with crunch in the oven or on the stove, this works exactly as you would want. I read many of the comments and all were helpful, some suggested trial and error, but I had guests for dinner, so I used 5 of the &#34;cups&#34; per the one provided( I bought the 7 cup),  washed the rice throughly, soaked it one hour then added the chopped dried apricots and chopped dried sour cherries, 2 tsp salt. Into the pot I put 1/2C ghee, and the suggested amount of water. Turned the dial to 60 minutes and waited until it just came to a boil, added all the rice and fruit, used a coffee mug to compress the rice, turned the dial back to 60, the keep warm 45 minutes. Came out of the pot perfectly, no sticking at all, and perfect dark gold crunchy tahdig. I'm thrilled with this no hassle and dependable cooker for Persian rice. Also happy that it cooked the jeweled rice so that now I know I can't any version I like. The 5 &#34;cups&#34; made plenty for a party of 6 big eaters, so I see no problem with the cup measure that is included with the cooker-a lot of people complained, but, I don't get why, just add one extra of their cups and you'll be fine.<br />BTW- I saw a lot of folks wanting to know about brown Basmati rice, so here's a tip: Wash the brown rice well and soak in plenty of water over night, drain and continue as for white rice, the timing will work for the soaked brown rice with the same timing as white rice, this goes for brown Jasmine rice too, I have no idea if it would work for regular brown rice, never tried it, rarely use it.", "I just received the ten cup rice maker and made my first batch of tagdig last night. I followed the directions others have posted (don't bother with the directions or the plastic cup included with the cooker), and it was perfect.<br /><br />For two cups (US measures) of dry basmati rice, I used 3-½ cups water along with two tablespoon of oil and a teaspoon of salt. I rinsed the rice very well (no need to soak the rice) and added everything to the cooker, smoothing out the rice so the top was even. No need to put a towel under the lid. I set the timer to 60 minutes.<br /><br />After the timer went off, I added a bit of ground saffron mixed with a tablespoon of hot water and 2 tablespoons of melted butter - sprinkled over the top. I cooked it another 15 minutes and inverted it on to a plate. It had a beautiful golden crispy shell and the rice was light and fluffy.<br /><br />Next time, I'll add the butter and saffron at the beginning with the water, which will help disperse the yellow saffron color throughout the rice, rather than leaving streaks when it's added later.<br /><br />I'd also like to try making tachin with chicken and some vegetables, but not sure about the timing. I'll obviously precook the chicken, but since it cooks for an hour I don't want the chicken to overcook. Not sure when to add the yogurt either. Any advice?", "We got the 10 cup rice cooker and I've always made tahdig the old fashioned way, but this does make a good quick version. At first I wasn't getting a good result and then I talked to a friend who has one and she helped with the proportions and it started working.<br /><br />First of all...you must get very good Persian approved basmati rice. This is critical. I made some with a lesser rice and I got mush.<br /><br />This is what you do...<br /><br />Soak the good rice for at least 30 min and up to as long as you want.<br />Rinse it until water runs clear.<br />In the bottom of the cooker put a oil (or for even better flavor oil and ghee mixed together...you may need to turn on the cooker to melt the ghee if you do this). I put enough in so that the whole bottom is covered (sides and center).<br />Add the drained rice into the cooker.<br />Add the same amount of water as rice adding one additional cup (for 3 cups rice, add 4 cups water).<br />Add a decent amount of salt to the water.<br />Cook for about an hour and a half (you will need to add extra time on the cooker).<br />When rice is done, fluff and add some saffron tea (a bit of saffron added to hot water to release flavor/color).<br /><br />It's delicious!", "This rice cooker is fantastic.  After years of hit-or-miss success with persian rice - and getting the crust right  - this cooker did it the first try!  It is so easy to use...rinse the rice, boil the water, add the rice, salt and oil in the proportions recommended in the book and turn the dial to 60.  After it expired, I put it on another 5-8 minutes and the crust was perfect.  My family was thrilled.  Ignore the instructions in the book other than the proportions of rice to water and oil.  The rest of the instructions make no sense.  Quick easy clean up as well.  So much easier than cooking on the stove.", "Please note:  don't purchase this if you're just looking for a rice cooker; you'll be disappointed.  This is a specialty cooker for making tadiq, which is also called by several other names in the Middle East.  The reason it has a dial-timer on the front is that it needs to stay on after the water has boiled away, to make that delicious crust in the bottom of the pot.  It has worked perfectly for me; I learned to love this dish through Persian friends and it's tough to do properly in a regular cooker because they keep turning off.<br /><br />If tadiq is what you want to make, this will work well for you.  I bought the smallest size because I live alone and didn't need a larger one.  This is also quite well-made and weighs more than any of my 3 regular rice cookers.", "I've never been smitten with kitchen gadgets (or rice!), but was persuaded to buy this by a family member. It's changed my world!<br />Rice is now this delicious crispy treat that everyone loves, and the cooker makes it perfectly and beautifully each time.<br />It's easy (usage, cleaning, storage), lightweight, and I like its low-tech nature--no digital pad with a zillion options.  Highly recommend.", "My first rice cooker of this nature and we love it!  Easy to use and the product is great.  It is annoying that the timer only provides for 60 mins, but I wouldn't let that deter me from this cooker.", "Love this cooker!  My first try and it’s perfect!  Taste delicious and crust is perfect too..  I used 4 cups of rice, 5 cups of water, 3/4 cup olive oil. Don’t use their measuring cup.  Use you own.", "So far, so good.  I'm still trying to master the perfect batch.  Deciphering the poor English is a funny challenge.  I think I'll end up loving this cooker.", "excellent cooker. the instructions were sketchy, at best, but I called the PARS office and they were great. I recommend this to anyone, including Perdians.", "This rice cooker works great. It is perfect for tadig. I think it works better for most rice dishes, unless you are going to make a specifically Asian dish like sushi or stir fry (which would require frying in a wok after steaming). The rice that this makes is looser, more oily, and seasoned than typical rice from a regular rice cooker like a Tiger or Zojirushi rice cooker. You can make 1 to 4 cups of rice with the 4 cup model (I have the 4 cup model). I have read reviews that say you cannot make as many cups as advertised, but, at least with the 4 cup model, that is not the case. I can easily make 1 to 4 cups of rice with this cooker. It works as advertised and I would recommend it to anyone who enjoys eating rice. It is easy to use and the price is inexpensive compared to most other quality rice cookers. One piece of advice, if you would like to cook only 1 cup or rice I would recommend the 3 or 4 cup rice cooker. If you purchase a model that cooks 5 or more cups the instructions will note that the minimum amount that you can cook at one time is 2 cups. I frequently cook 1 cup of rice for myself so that 4 cup was the model I chose. I do not like to cook a lot of rice and store it, but prefer to cook rice freshly for each dinner.", "I have the larger Pars cooker which cooks much better.  This one burns the bottom if on the farthest (highest) setting. Good size for two people, though.", "It is a nice size cooker for my husband and I.  It is working good so far.  I have two rice cooker. So, I use this cooker only when I need to.", "Love this cooker for Persian rice with crust. Follow the directions regarding the measure of ingredients and you won’t go wrong. Takes a couple of iterations to get the crust as crispy or light as you prefer. I like mixing in herbs as well. Would be nice if they had a recipe booklet included.", "Love the cooker, we received it as expected.... supposed to be a 10-cup cooker but according to their own instructions you can't use it for more than 6-7 cups of rice (using their own included measuring cup). This is ridiculous! And it's the only reason I'm giving it 3 stars.", "50 minutes great tasting rice and if you like pegao aka crusty rice this is the cooker for you. I have my sisters now sold on this product.", "Making Persian Rice in this cooker is a breeze. Only wish I had sized up. The tahdig (crispy rice on the bottom of the pot) comes out perfectly. Only problem is everyone wants it.  Lol. I plan to purchase three of the these  larger sized rice cookers to give as Christmas gifts to my grown kids and their families.<br /><br />The instruction book is terrible. Read other reviews for guidance on amounts of water, rice, salt and oil to use.", "The best rice 🍚 cooker ever I love it 😻", "the instructions were horrible.  the cooker is fine", "Easy to use and great cooker", "They send used ones instead of brand new the cooker is used before and it has scratches.<br />You can find brand new cooker with better quality and cheaper price. The price doesn’t correspond the quality. Cheap material of pot of cooker", "This was a great purchase. I only wish I had bought the larger capacity rice maker.  As a Persian who knows what great rice (polo) should taste like, this cooker makes amazing rice.  The tadig (the crunchy cover) is fantastic!  I follow the directions and it makes excellent polo each time.", "I cooked the maximum amount of rice in the cooker, and it turned out perfectly. The cooking directions were hard to understand, though.", "Instructions for the product are hilariously bad. But the cooker itself works very reliably and very well! Makes great tadig!", "First: about the product.  It was perfect out of the well-insulated box.  I am not a cook so I need all the help I can get.  This rice cooker made it so easy.  Just add the ingredients, turn the dial, and done!  Perfect Persian rice and tahdig (the crispy bottom of the rice).  It is a no-brainer.  I've seen videos online of people using pots and pans to cook the rice, then re-cook for the tahdig.  This is so much easier and more consistent.  The results speak for themselves.<br /><br />Second: about the company.  Very responsive.  I emailed them before placing my order to inquire how quickly I might receive the rice cooker from the time of ordering it.  I received a very prompt reply with the specifics of their shipping.  I ordered the cooker, received it in 2 days, and cooked rice that night to the delight of the family.<br /><br />Highly recommend!", "While the instructions are not good, I like the cooker.  I had a crispy bottom like I wanted the first time I used it"], "reference": [112, 52, 27, 27, 24, 8, 6, 5, 4, 4, 4, 4, 3, 3, 3, 2, 2, 2, 2, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.800000011920929, 0.20000000298023224, 0.4000000059604645, 0.7999999821186066, 0.30000001192092896, 0.15000000596046448, 0.02500000037252903, 0.5999999940395355, 0.6000000238418579, 0.2750000096857548, 0.04444444510671827, 0.30000001192092896, 0.10000000149011612, 0.8999999761581421, -0.20000000298023224, 0.8999999761581421, 0.699999988079071, 0.8999999761581421, 0.4000000059604645, 0.6000000238418579, 0.4000000059604645, 0.8999999761581421, 0.22499999403953552, 0.5, 0.699999988079071, 0.8999999761581421, 0.5, 0.8999999761581421, 0.1750000026077032, 0.30000001192092896, 0.30000001192092896, 0.5, 0.6000000238418579, -0.4000000059604645]}