{"reviews": ["I bought this rice cooker during my kitchen remodel, when the only methods of cooking I had were crock pot, microwave, or hot plate.  This thing was, and still is, a life-saver!<br /><br />I love brown rice, but I hate the intense, laborious process of cooking it on the stove.  Watching the heat, getting the water amount just right, constantly having to baby it...no thanks.  With my Zojirushi I just set it to brown and go to town (haha).  The brown rice cycle takes about 2 hours...but if you use the built in timer function, you can have brown rice (or any kind of rice) ready and waiting for you at the time you desire.  The time you set on the timer is the time that your Zojirushi sings it's corny little japanese song to let you know that your rice is ready to eat.  If you aren't ready for it yet, your rice is kept warm without getting dried out or crusty.<br /><br />If you've never tried short or medium grain brown rice, do it.  It's so much better for you and most people I've cooked it for prefer the texture of short grain brown rice to the more common long grain.  In case you were wondering...PF Changs uses medium grain, but I've had trouble finding that.<br /><br />White rice always comes out great, not too sticky or wet...though it does take around 45 minutes.  I make a lot of spanish rice...here's a quick easy recipe for that:<br /><br />**SPANISH RICE***<br />2 Zojirushi Cups White Rice<br />1 Small can Tomato Juice (I think it's 8oz)<br />2-4 Teaspoons of Chicken Buillon  (or use chicken broth instead of the water)<br />2-4 Tablespoons of Taco Seasoning<br />Fill with water to \"2\" and cook on white rice setting<br />It's a pretty forgiving recipe and I frequently spice it up with additional ingredients....chipotle peppers, sweet corn, etc.<br /><br />I also make steel-cut oatmeal nearly every morning.  My timer automatically has it hot and ready for me when I get up for work.  I use 1/2 Zojirushi cup of steel cut oats (rinsed) with 1.5 zojirushi cups of water.  All of this goes in the night before.  More often than not, I have to clean the inside steam vent cover after cooking this, but that doesn't take long.<br /><br />This is the first rice cooker I've ever owned, so I can't vouch for the performance of any other model, though I suspect I'd be disappointed with the cheapo on/off ones sold by most stores.  The 5.5 cup capacity has been plenty for me & my roommate....usually 2 cups is enough for us (and we eat a lot).  I typically cook 4 cups so that I've got leftovers or lunches.<br /><br />If you're trying to decide between this and the induction model...you really don't need to spend the extra money...this one does just fine.  I can't imagine the results being any better than they are...save that extra $100 for something else.  I got the stainless finish because it matches my other appliances, but I'm sure the cooking functionality of the other models is identical.<br /><br />At the time I purchased mine, Amazon was charging a bit more, so I ordered it, cheaper, from a place where I usually buy computer supplies.  Now I see that Amazon has it for about the same price.  You really can't go wrong with Zojirushi.", "Because I have been 100% happy with my Zojirushi Bread Maker for about 10 years. I bought the Zoji Rice Cooker and expected it to produce perfect rice and porridge. I've owned it less than a week and made brown rice twice (4 cups and 1 cup volume) and steel cut oats (for 2 people) three times, carefully following the instructions! The results were mushy (almost like mashed potatoes). Disgusting! Yes, the cooker was made in China, not Japan. The seller, MVTrading, will not accept a return and provide a refund.", "I've had this rice cooker for almost a year and it has been the best kitchen-tool investment I've ever made. I use the rice cooker almost every day for a wide variety of grains.  I'm now contemplating getting the 3-cup model in addition because the rice cooker is so versatile and essential to our daily meals that there are times I could employ two of them.<br />I've been delighted to find that I can make no-hassle (and fantastic) polenta, any kind of hot breakfast cereal (ready to eat when I get up), excellent rice (which my kids love because \"its just like the Chinese restaurant rice\"), and perfect grains every time - quinoa, spelt, barley.  The only thing I haven't tried yet is amaranth.<br />I wasn's sure I'd use the timer function, but it has become essential, especially as I pre-soak and ferment all my grains now (a la Nourishing Traditions.)  The porridge setting, too, has made busy mornings that much easier.  It takes a little experimentation to find the right proportions of water-to-grain for porridges (I recommend getting [[ASIN:1558322035 The Ultimate Rice Cooker Cookbook : 250 No-Fail Recipes for Pilafs, Risottos, Polenta, Chilis, Soups, Porridges, Puddings and More, from Start to Finish in Your Rice Cooker]] for a handy reference guide for all grain/water ratios) but too little water is easily remedied by opening the lid when the timer goes off, stirring to mix water that hasn't been fully incorporated, and adding water to the desired consistency.  The porridge will stay on \"Keep Warm\" until you're ready for breakfast.  I make oats, steel cut oats, cream of wheat, cream of brown rice, and others using the porrodge setting.<br />Other reviewers have mentioned that having the wipe the inside lid after every use is a pain, but I've found it takes just a moment.  Unlike other rice cookers I've had, there is almost never an explosive mess of cooked-on grain schmutz on the lid, so cleaining is fast and easy.  The no-stick pot is great, too.<br />If you are cooking for 4 or more regularly, I recommend the 5 1/2 cup size; you'll have leftovers, but not too much.  Porridge for one (which is what I use it for) comes out just fine, despite the small amount of grains in the pot (hence, the need to stir after cooking.)  If you are cooking for 1 or 2, then the 3 cup size should be adequate", "If you happen to love rice, as I do,you will not be disappointed with this rice cooker.  It makes amazing rice (I cook brown rice primarily), and the timer works perfectly.  It is still amazing to me that I can tell it when I want my rice done, and it is done, and goes from 'cook' to 'warm' at exactly that time, with the rice perfectly cooked.  It is great to have an item of my dinner that I need pay no attention to during dinner preparations, and still know it will be exactly right.  I also make steel-cut oats, barley, and other grains, as well as cooking dried beans, and they all come out perfectly.  I use (and highly recommend) the cookbook that I ordered at the same time: [[ASIN:1558322035 The Ultimate Rice Cooker Cookbook : 250 No-Fail Recipes for Pilafs, Risottos, Polenta, Chilis, Soups, Porridges, Puddings and More, from Start to Finish in Your Rice Cooker]].  Clean-up is a breeze, and I am eating more whole grains and beans.  Very happy with this product.", "I overall like the product.  Easy to use, more options and retractable cord.  But, it takes much longer to cook rice than my previous basic Jojirushi.  I used to be able to start preparing my stir fry meat and veggies and then plug in the rice cooker.  This one takes more planning ahead.  However, the rice is better.  Perhaps excellent rice takes longer to cook.", "I bought mine here from Amazon a couple of weeks ago.  I live at very high altitude, almost 10,000 feet, so I was a little worried about how it might perform up here.  We previously had a less expensive Aroma brand that was used weekly for many years, and it finally started giving out so I did my internet reseach and decided on the Zoji.<br /><br />We have been using this thing every day since we bought it.  From steel cut oats that are done when we wake up, to sushi rice, jasmine rice, brown rice, mixed rice, rice pilaf, risotto, I think we've done everything but try the cake setting, it's all been fabulous.  I love the timer setting and being able to tell it to have the rice done at a certain time, and voila, it's done.  I grew up on risotto, but the batch I made in the Zoji was the best I think I ever had.  The oatmeal in the morning is awesome, with some butter, bananas and maple syrup.  I don't think I've ever eaten anything that comforting before, you just feel so good after eating it.<br /><br />We also bought the two recommended cookbooks.  The rice cooker cookbook I like a lot, and never would have thought of all the different uses myself.  We tried the lemon rice and it was incredible.<br /><br />The only problem I have is that there are no leftovers, we eat everything that comes out of this machine.", "I bought this product based on all the great reviews. I haven't been impressed with the rice - quick or standard cooked white rice. I have had better rice cooked in much cheaper cookers. The result has improved somewhat over the months - by experimenting with the amount of water added but it shouldn't be this hard. I would not recommend this product over cheaper versions that I have found easier to use, easier to clean and provide a better cooking result.", "Have had this unit for over one year. We have rice at least once a week. Cooking white rice with either the slow or fast method, the rice comes out fine. However after about 15 minutes in the warm mode the rice tends to dry out. Looking for another brand.", "I purchased this product last weekend and it arrived yesterday. Shipping time was great. That said, when I pulled the unit from the box and set it on the counter top I realized that it was wobbling. The legs are not all the same height. That didn't bode well for Zojirushi's quality control.<br /><br />I set about preparing a pot of brown rice. Following the directions very closely my rice took nearly two hours to cook. Two hours! Considering that you can cook a pot of brown rice in a pressure cooker in under 15', and maybe 45' in a cheap rice cooker or stove-top pot, the two hour time-frame is mystifying.<br /><br />But to really top it off, the rice had the consistency of pudding; very soggy and mushy. Clearly it had been overcooked. Not to be outdone I tried white rice too, but with the same results. After cooking the first pot of \"rice\", the underside of the lid behind the top plate had already become discolored. The LED display isn't even back-lit!<br /><br />As I like to read the reviews before making a purchase like this, I saw many people giving this product five stars and think we must be talking about two different things. Mine is a Zojirushi NS-TGC10, made in China with a cheesy non-stick aluminum (not even hard anodized) cooking pot and raw aluminum top plate. The only stainless steel on it is the wrap-around sides and front.<br /><br />$144.00 (shipped) is allot of clams for something of such poor quality. Mine will be returned. Funny thing is, my little $20. cheapo rice cooker lasted for years and cooked a perfect pot of rice every time. Go figure.", "I generally only make 1-2 cups of jasmine rice and it comes out great every time. I have yet to make a good batch of basmati rice, but I think its my technique rather than the rice cookers fault.<br /><br />Pros:<br />* The timer - awesome! I set a batch of rice in the morning before work, and will have perfect rice ready by the time I come home. Don't forget the display is a 24H clock though, like I did :)<br /><br />* Extended keep warm cycle - I have set this in the evening with my leftover dinner rice, and had pretty decent rice for breakfast the next morning. Obviously its not the same as fresh cooked rice, but its not bad.<br /><br />Cons:<br />* Not a huge deal breaker, but the inner parts aren't dishwasher safe, so I have to wash it all by hand.", "I got this rice maker about 10 months ago from Amazon and I'm so in love with it that I'm going back to review it in hopes that someone else will buy it and experience its wonder.  I use it probably 3 times a week, my roomate and I eat a lot of rice. Cooks it so perfectly. Way better than the regular pot style rice maker I had before this one, or just on the stove. I never thought I would be so opinionated about rice. Totally unexpected use at least once a week:  I use the porridge setting to make steel cut oats for my breakfast.  1.25 cups oatmeal to 3 cups water.  I set it up the night before with a timer for approx 10 minutes b4 I want to eat, and when I'm ready for breakfast it's all ready for me.  It reheats well for the rest of the week.<br />Also, it plays twinkle-twinkle-little-star and tunes to tell you when it's done cooking.", "This rice cooker is very easy to use. We use it on a regular basis to cook white rice for breakfast, lunch, and dinner. I typically use either the regular white rice setting or the \"quick cook\" and both results turn out delicious.<br /><br />A couple of tips when selecting a Zojirushi:<br />1) The 5-cups they refer to are their special measuring cups. This model did end up being rather small. Perfect for daily and family uses, but if you needed rice for a party you'll want a bigger model.<br />2) Cooking rice will take longer than the 15 minutes it took on the stove top. It'll take between 20 - 50 minutes depending on the setting, but worth it. :-)", "The smaller version came highly recommended by my daughter. We prefer brown rice and so far it has been rather mushy. My husband likes mushy rice but I do not. My pot on the stove process produces better and quicker rice than this rice cooker. However, this rice cooker is less messy and easier to clean up. I have not tried oatmeal or baked a cake in it yet but plan to in the future. The length of time it takes to cook is astounding - why so long; 1 to 1 1/2 hours? But, you can set the timer. I gave it four stars because the directions are well written, it appears to be built well, easy to clean, can cook a lot of rice, has a timer, and has a retractable cord which helps in storage. I did forget to mention that each time we have cooked rice it has been a double batch and could be the reason for the mushy results.", "This is my second Zojirushi rice cooker as I had to buy another one for the US. The other one has a european adapter.<br /><br />I highly recommend it. It is so easy to clean and it makes perfect rice. I never had a rice cooker before but I bought this one after looking up reviews of this brand.<br /><br />I make rice 2 to 3 times a week so this little machine really is worth the while. This one I thought had an incredible price by the way!<br />It doesn't take much space and -OH!, it has a retractable power cord which is just great! I am just very enthusiastic when it comes to kitchen appliances that work for me!<br /><br />Tips for best rice:<br />- white thai or similar rice: stir when finished and then close the lid and leave for 5 more minutes. It will be on the keep warm feature.<br />- sushi rice: Leave for 10 minutes and then stir and use.<br />- any rice: always use the right amount of water. This can be slightly different depending on the type of water so pay attention to that.<br /><br />Cooking time: for white rice it takes about 30 minutes which I thought was very fast. In the european cooker I have, which is the same model, it takes about 40 minutes, even a little more in the beginning (have no idea why).<br /><br />Enjoy!", "I bought one of these a year ago for my son to use in his college dorm room. He grew up on brown rice (or just about any variety of the Lundberg brand rice products) so we all thought it would make something healthy for him to snack on. My son loves it, and uses it almost every day, mainly for different kinds of rice, but also for quinoa and for baking an occasional cake. No matter which variety of rice he makes, long grain, short grain, jasmine, wild, etc. he says it comes out just right every time.<br /><br />This year his roommate was an exchange student from Japan. Yugi (the student's name) couldn't believe that my son had a Zojirushi. He was very pleased with the rice (unlike the rice that was served in the college cafeteria). He said it was just the way they like it in Japan, whether making regular rice, sweet rice, or any other kind. College kids aren't known to be especially careful with appliances like this, and the Zojirushi ended the year at college looking like it was still brand new.<br /><br />Yes, it is a lot of money to pay for a rice cooker. But this one's so easy to use, and flexible enough to make things other than rice, so I'm glad we bought it. Bottom line: I'd buy exactly the same thing if I had to do it over again- it's that good!", "Thank you Amazon community -the reviews were very helpful in selecting his rice cooker. The negative reviews and people who mentioned the cons were also considered in the making the purchase. OUt of the box, I washed all components, including the base with a washcloth. I am not a fan of that \"from the factory\" smell.<br /><br />Within 20 min I was cooking. The faceplate is extremely simple and user friendly. Instead of making rice, I cooked barley. The ratio was 1 c barley to 1-1/2 c chicken broth with a bouquet garni. I am looking forward to having a grain ready for dinner every night when  get home. I will cook farro, quinoa, black rice, basmati, etc.. Damn great buy!<br /><br />Watch the videos is you want to learn the basics. [...]", "We have used rice cookers for as long as they have been available. Our previous model was Japanese built and we had to use a transformer to convert the electric power. It still worked well, but the inner bowl was beginning to scratch.<br /><br />The new Zojirushi NS-TGC10 is fantastic. It not only does regular rice, but other types such as mixed rice recipes, or \"okaiyu\" (gruel) which is useful when you have digestive problems, to perfection. What this model does also, is to prepare perfect cheesecake. Do let it cool down well before removing from the cooker. This is a bonus feature and not found on other rice cookers. To summarize, this is a fantastic product.", "I got this last christmas for my husband and I.  Thinking back on it I should have gotten the smaller one (I over estimated the amount of rice we cook and how many times we would use this for company.)  It works amazing.  The rice is almost always perfect.  The only frustrating thing is how dirty it gets after using.  It's not difficult to clean but it can cake this film on the spinner inside.<br /><br />I LOVE the retractable cord and that it can keep the rice warm for however long I need to really.  Start it earlier in the day and it's ready for dinner that night.  My only last precaution is that the steam is VERY hot and to make sure not to have it running under any cabinets unless you want to try and ruin the finish.<br /><br />Definitely recommended!", "Love this rice cooker!  Makes perfect rice!  I have yet to use the quick function, so I'm not sure how good the rice will turn out with that.  But, on the regular white rice setting, it cooks for approx. 40 minutes and comes out perfect each time.  It plays a little song when cooking starts, and a different song when cooking stops.  I also really like that the inner lid is detachable and can be washed after each use - as anyone who cooks rice knows...things can get caked on there.", "My old cooker had the steam vent in the lid right near the finger grip for opening the lid; it spit, dribbled and leaked cooking water, overcooked and browned the bottom of the rice even when immediately turning the power off, and simply couldn't manage to cook brown rice or pilaf completely. The Zojirushi is a dream!! No more burnt fingers, no mess on my countertop, the rice is done to perfection AND I've finally discovered the fantastic taste of properly cooked brown rice!! I bought this cooker because I trust the Zojirushi name. I've been using one of their bread makers for 17 years and I believe this Rice Cooker will provide the same long and durable service. As well, it looks nice, and the retractable cord and fold-down carry handle are nice touches.", "Zojirushi NS-TGC10 Micom 5-1/2-Cup Rice Cooker and Warmer, Stainless Steel. This rice cooker is just great. It cooks brown rice and any kind of rice (and ALL whole grains!) to perfection. I especially love timer feature that allows you to wake up to a fresh meal.Very easy to use, BIG HELP FOR BUSY PEOPLE.Thank you Zojirushi for another high quality product!Customer service in Zojirushi is also great.My rice cooker happen to miss a spatula(which is very useful and nicely shaped),but the problem was fixed promptly.Thanks to the Amazon for their outstanding service as well.<br />The Ultimate rice cooker cookbook  is a lovely addition to your rice cooker, packed with useful info and variety of interesting recipes to experiment with.:)", "I can understand now why this brand is #1 in Japan.  Very eay to use.  Rice always taste great and the fuzzy logic is amazing in adjusting variables to ensure that your rice is cooked perfectly and will wait until you are ready to serve it.  It does take about twice to three times as long to prepare rice, but that is not a problem as long as you plan for it.  The retractable cord is a great feature when you are ready to store the unit.  Ours looks so good though, that we keep it on the countertop.", "Does the rice up perfectly every time...and it's extremely simple to operate and clean.<br /><br />BUT, the non-stick coating has started coming off the inside of the bowl right at the top of the rice despite ALWAYS using the plastic spatula and cleaning with a non-abrasive sponge. Will have to buy a replacement. Bad idea to eat rice with non-stick coating in it.<br /><br />NOTE: After having this rice cooker for 3 1/2 year, the cooker itself is still working fine. BUT I'm on my third bowl. Every bowl has the same problem, non-stick coating starts flaking off where the level of the rice cooks. And once the coating starts flaking off, you'll need a replacement bowl.", "This couldn't be easier to use, and the rice has been perfect each time. Since I don't use it very often,  I'm always surprised at how easy it is to use.  Just measure and rinse the rice, add 1 1/2 times the water,close the lid and push the \"cooking\" button.  It does the rest and tells you when it's ready to serve.", "This is a great rice cooker for the price.  Small and compact.  Cooks brown and white rice.  Bought one for my mom and sister in law as well and they both love it.<br /><br />Only downside is that to cook brown rice can take up to 2 hours so just be prepared.  Don't cook the brown rice under any other setting but brown rice or else it will not cook well and be hard and dry.<br /><br />This rice cooker is def. worth the money and the investment!", "I love this rice cooker. I have purchased many others over the years but this has been the best.  I love getting up in the morning and have nice warm rice for breakfast.  The only problem so far is if you use the quick cook setting the rice seems to more dried out. But all in all I would recommend this rice cooker to anyone who loves warm rice though out the day.", "I use this rice cooker at least once a day, sometimes twice.  I use it to make steel-cut oatmeal for breakfast, and also cook rice or another grain for dinner.  I love the timer function - it's very accurate, the food comes out consistently good, and it's very easy and quick to set.  I work full-time and have a little one, so I need the food to be done and ready-to-serve as soon as I get up in the morning, and as soon as we come in in the evening, and it is.  AND rice is still warm and tastey for my husband when he gets in later.  I've tried a lot of different things in it, different varieties of white and brown rice, risotto, polenta, couscous and everything has come out perfectly.  I haven't tried the cake function - I'm not a cake person apart from cupcakes.<br /><br />Clean up is incredibly easy.  Even with super-sticky polenta a quick soak of the inner bowl, and a quick clean of the outer lid and the inner lid is all that is needed.<br /><br />I bought the Ultimate Rice Cooker Cookbook by Beth Hensberger at the same time, and I have to say the combination of the two is great.  I've been able to really get the most out of the rice cooker, which should really be called grain cooker, because it is so versatile.<br /><br />It seems well-built, but I can't comment since I've only had it for a month.", "I got my new rice cooker this afternoon and immediately tried it out.  My first batch used 3 cups of long grain white rice and filled the cooker up to the 3 cup mark.  The rice came out perfectly.  My family ate the rice with a little soy sauce or a little butter.  Either way, it was great.  My second batch just finished cooking.  I love the fact that it stays warm for hours without deteriorating the quality of the rice.  If you buy this machine, you will not be sorry.", "I've had this rice cooker for a few months now and I'm generally happy with it.<br /><br />Things I like:<br />- It looks very nice, matching with my stainless steel appliances<br />- The unit feels very sturdy and made with quality material<br />- The bowl is easy to clean<br />- The rice it makes tastes very good.  Everything is cooked evenly.<br /><br />But there are a few things that are annoying with it:<br />- It takes about 45 minutes to make white rice and 2 hours to make brown rice.  This is a lot longer than my previous Panasonic rice cooker.<br />- When pressing the top button to open the rice cooker, the lid only comes up halfway and then I have to open it up manually<br />- The little lid inside of the lid needs to be washed every use or it gets this funk on it.", "I have never made sushi rice, but read many reviews before purchasing this product. It is somewhat pricey, but when you see how it works and how easy it is, it was all worth it.  You can tell this one is going to last a long time and there is practically no cleaning up (it takes me less than 1 minute to wipe of the little bit of rice that was left).  The rice comes out perfect after about 40 minutes, but there is nothing to do except put water and rice and turn it on with one button. Then you wait 40 minutes and the little music goes on when it's ready! It can make all kinds of rice too: rice cake, sushi rice, white rice, brown rice, etc. I loved this product!", "It worked for 3 years and it started giving problem. we need it always as rice is our staple food. But after 3 years it started behaving strange -sometimes it turn on and other times it wouldn't heat up. another problem is it warms even if you put it in cooking mode.", "I value the reviews by others when getting products and this one is no exception..what I wanted was a selection for the brown rice..I was so excited to get it..the first thing I cooked?  you guessed it..brown rice.  I used the brown rice measurement on the pan and cooked away..well, it came out like sticky rice.  I told my husband I may send it back..he said to give another try and use less water.  Well, I did use the measurement for the regular rice and the brown rice came out just the way I like it..the grains separated and was able to make my stir-fry..I make rice by the week and added to stir-fries during the week..it is my main staple..so I'm satisfied for now..I have not tried to make a cake or pasta..bottom line, I should have stuck with just a regular rice cooker and not pay so much for it.", "We love that we can put our rice and water in press a few buttons and leave it!  Since the tub has markings for water and a special measuring cup for rice it's a no brainer!  It's well worth the price for our family!", "I make rice everyday for my family and this rice cooker does not disappoint.  I love the timer feature where you can set the time you want the rice to be ready.  I've used the rice cooker for white rice and brown rice and both kinds come out fine.  It is a good size and fits nicely on my not so big kitchen counter.", "It is ridiculously simple to make perfect rice each and every time!  Although it takes longer to prepare the rice (we have not tried the Quick Rice feature yet), this can be easily overcome with a little planning.  I cannot overstate how simple it is to prepare perfect rice every time.  I also like the compact design that does not take up a lot of counter space.  I have yet to try the device on grits and oatmeal.", "after the first use, I made adjustments to the rice/water ratio and it makes perfect rice just the way we like it.", "Purchased after my girlfriend dropped hints she was missing her rice cooker in college.  After a little research, it was quite clear, this manufacturer and model were the best bang for the buck.  I know rice is easy to make, but this cooker really does it right.  Cooks sticky rice perfect every time.  I even enjoy the twinkle twinkle little star chime.  Definitely would recommend.  Only complaint, it does take a little while to cook, but if you plan ahead it doesn't come into play.  For example, come home, pour a little water and rice into the cooker, hit the settings, and walk away for a work out, TV, or to start complementary ingredients and it's done in 30-40 minutes.", "Very easy to use and makes fantastic rice.  The pot inside is non-stick and very easy to clean.  Markings inside the pot make getting the rice-to-water ratio right a snap.  Only thing I would mention is that while being able to make 5 1/2 cups of rice at one time is nice, the minimum batch is 1 cup.  That's a lot of rice if you happen to be cooking for one with any regularity.  Some of the smaller models will cook 1/2 cup batches, which is a much more manageable amount for most one-person servings.", "Zojirushi NS-TGC10 Micom 5-1/2-Cup Rice Cooker and Warmer, Stainless Steel..<br /><br />This is quite possibly the best rice cooker ever! I was concerned about the price, but I make rice at least 4x a week, and this little machine has mad it so easy. Small amounts of rice, large amounts of rice, different types of rice, it does it all and perfectly! I can (and do) buy rice in bulk, I rinse the rice before I cook it, and it comes out perfect every time! When we have dinner guests and rice is on the menu, they always comment \"Wow, this is the best rice I have ever tasted!\"<br />If you are serious about rice, this is the machine for you! You will not be disappointed. I can be a bit distracted, and forget I am cooking rice, not a problem, the Zojirushi NS-TGC10 has a rice warming feature and it will keep your rice perfect for hours! Amazing!<br />I have been using the Zojirushi NS-TGC10 for a few years now, week in and week out, and have never had a problem with it, just a great little machine..<br /><br />HIGHLY RECOMMEND..", "All the other reviews have already said it all, so I'll just add my two cents:  it looks beautiful, it works great, it makes amazing rice, and it is actually very easy and intuitive to program it to make rice at a certain time.  It makes perfect congee and oatmeal, too.  And the tones it uses to tell you the rice is cooking/ready are a hoot.", "This is a gem! My 2 year old can't get enough rice so I figured it was time to find a way to make it and keep it ready to go for a solid day.  This Zojirushi does the job quick and VERY well.  Not only does it cook and keep rice ready to be eaten, it is also VERY easy to clean which is half the battle with any kitchen cooking machine.  I am also amazed at all the other items it can cook too.  Not the cheapest or the most expensive rice cooker out there, but it does what it says and the price is fair too.  Oh, and it plays cute little songs when its done cooking (please don't tell my buddies I used the word \"cute\" ;) )...", "I grew up eating rice and am definitely picky about the quality of my rice. I have tried different brands (love Kokuho rice) and different rice cookers. I grew up in a household that had an amazing Zojirushi. My first couple of rice cookers were junky cheap ones that lasted only a couple years each (I'm sure they were never intended for such heavy use). I then purchased a Zojirushi that was a real disappointment (see my other Zojirushi review), especially for the price. I hesitated to buy another Zojirushi but my family members have had great experiences with this well-known brand. I have now been using the same Zojirushi for over two years, and am still delighted. I LOVE this rice cooker.<br /><br />1. The rice cooks beautifully.<br />2. I love the timer setting so that I can add the rice in the morning, and have it be freshly cooked in the evening. I use this feature frequently.<br />3. I never have a problem with steam oozing out of the rice cooker and making a mess (something that I dealt with for FIVE other rice cookers, including a fancy Cuisinart and a fancy Zojirushi).<br />4. I love the option to \"quick cook\" the rice if I forget to start the rice earlier. It works great with only a slight quality difference from the other version of the rice.<br /><br />The rice cooker has some other fancy features but the important thing is that after several bad rice cookers, I finally have one that simply cooks rice well, and without making a mess.", "Pricey, but exceptional at cooking perfect rice.", "perfect rice cooker if you want to make brown rice. Typical rice cooker usually burned the brown rice because it does not have the setting for it. With Zojirushi, the rice come out perfectly cook and taste excellent. If you want to make perfect rice you should consider this one.", "I love it! My  kids come home to a warm, delicious rice . It is easy to clean , easy to store away .", "I was raised in a Cajun household where my dad didn't think he'd eaten on a day we didn't have rice.  I learned to cook rice on top of the stove at an early age, and that's the way it was done for generations.  These days, though, it's a rare Cajun household that doesn't have a rice cooker.  I've had several over the years.<br /><br />Now I've got this one, and compared to the $15 unit it replaced, this one's pricey.  I think it's worth it.<br /><br />it does rice to perfection:  the medium-grain rice that I was raised with, long-grain, brown, and basmati that I use now, all to perfection.<br /><br />It does a fine job, too, on cereals like steel-cut oats.  I use the timer function, and the stuff is ready in the morning when my alarm wakes me.  It does wheat berries to perfection.<br /><br />It's simple to use, easy to clean, and comes with a pretty good instruction book, and honestly, I'd be lost without it now.", "I have loved this little machine since the day I got it. Yes, it is slow. I didn't buy a rice cooker to make rice quickly, I bought one to make it well, and certainly does! The white rice cooks to glorious perfection. Even brown rice, comes out delicious in this thing. Delicious enough that my kids will eat it (they do still prefer the white though). I haven't really tried the cake setting on this, but I have made slow cooked, steel cut Irish oats. Again, I'll take the slow cooking time so I can set it up the night before and wake up to delicious perfect oatmeal", "I bought this rice cooker for my parents for christmas. They were ecstatic! Dad said it was the<br />Best rice ever made, all kernels separately cooked. No clumps or burns. Super<br />Easy clean up. Excellent product!", "Every positive word others have written, I echo. Can an appliance make someone feel happy?  This one, with its happy start and stop tune makes me smile.  I get back from my morning walk and my steel cut oatmeal is there waiting for me...even if I am late getting back, it is there protecting my breakfast as a reward for my morning efforts.  Sometimes, I add pieces of apple to the uncooked oatmeal. Hmmmm.....yum. My other appliances sit there mute and functional (mostly) as appliances are supposed to do. But, Zojirushi speaks to me. Zoji cares.  I love the size. I like how Zoji looks. Zoji is a dream to clean. Oh and it makes rice, too!", "Bought this after making my own rice (got pretty good using a pot on the stove).  We make rice just about every other night now as it is a no brainer, so easy, so fast, perfect every time (my own pot receipe needed attending and was not so consistent). I like the brown rice.  Would highly recommend.  This one has a timer as well - so you can have a major item for dinner ready when you walk in the door.", "What a beautiful rice cooker.  Used it for the first time and the rice was perfect.<br /><br />Can't wait to try Basmati Rice.  So simple to use could teach my 10 year old how to make perfect rice.", "I cook rice daily. Comes out perfect every time. I have been using it for a solid year now with no problems.", "I have been using Rice Cookers for twenty years.  Usually I just pick one out based on price - the lower the better.  This is the first rice cooker I have owned that cost more than $75 - and it is SO worth it.  I've made rice, brown rice, steel cut oats - all delicious.  I highly recommend.", "with the rice recipe book, this is an excellent cooker to make, cook, warm your rice. compact east to store, just a great product.", "Moving away from instant rice has never been easier. I love my rice cooker. Easy to use. Easy to clean. Amazingly healthy alternative with very little effort!", "Wow what can i say, this is one of the best rice cookers i have ever bought, the rice comes out perfect an verry tasty. i was debateing buying an expinsive one but im glad i bought this rice cooker, keeps the rice nice an warm. Glad i spent good money on a perfect rice cooker", "I have owned this item for almost 4 months.  Prior to the purchase of this item, I had 3-cup sylvania rice cooker. I hated the product because the water always overflows when it's about to finish cooking, and getting rid of the rice at the bottom of the lid after use was a pain. I felt like I was wasting rice.<br />So, I decided to buy something better.<br />Like the most reviewed customer said, I was debating between the 3-cup rice cooker.  I live alone and thought this product would be too big for me.<br />But having used this rice cooker for 4 months, it hasn't caused any problem for me.  I usually cook 3-zojirushi cup rice, and I put the leftover into freezer. Although I love the taste of it when it's freshly cooked, microwaved rice is still good.<br />I have only tried cooking white rice and mixed rice. Would like to try the baking feature soon.<br /><br />Pros:<br />- Timer (can be timed to be cooked for next morning, after work, etc.)<br />- Easy to wash (the inner lid is VERY easy to clean. Does not stick at the bottom)<br />- Bumpy spatula (rice does not stick.)<br />- Warming (regular & extended warm - keeps the rice warm and fresh)<br /><br />Cons:<br />- The inner lid moves around when getting the rice out<br />- Takes little long to cook (Regular-40min, Quick-25min) although I don't mind it because I usually use timer for next day or for later use<br />- If rice is in warming mode for too long, it gets hard at the bottom.<br /><br />If you are considering to buy a nicer rice cooker, but not so much into buying IH (induction heating) rice cooker, this one is the way to go. You won't regret it.", "I love rice I stink at making it. Friends make fun of me but no matter what I do it comes out horrible.  My friend took a trip to Japan and said he saw this brand all around.  I did some looking and decided to get this one.  I've owned this for a little close to a year and love it.  My wife and I use it often.  We make mixed rice, red/white/wild/brown and then we make just brown rice.  I've used both long/short grain and each has turned out great.  The fuzzy technology is awesome and there are days I start the rice at 6am get home at 5pm and in ready to eat.  I'm 100% happy I bought this unit and I'm going to try my luck in baking bread with it :)", "If you're like my family, you eat a lot of rice. So if you do you want to buy a rice cooker that will last a long-time and make good rice. Zoji's are the best brand out there for cooking rice. This model fit our needs perfectly and was priced right. We have an older style simple click-on large pot Zoji that we bought years ago and it still performs nicely. But it was too big for just 1-4 cups of rice so I shopped around for a smaller one.<br /><br />A tip for cooking white rice: Rinse your rice at least 4 times! Also if you choose 2 cups or any number of cups in between the marked lines on the bowl, it may be harder to get the right about of water. When I had 3 cups of rice, I filled exactly to the marked line for 3 cups and the rice was perfect. I tried two cups and eye-balled the water and the rice came out a bit mushy so I obviously added too much water. I'll have to try again and see if I can't get it right the next time.", "This is the best rice cooker that I have ever used. It is so easy to clean and cooks the rice perfectly every time.", "Zojirushi makes great and durable product. I have had it for 7 years, still running strong and only need to replace the inner pot recently due to some scratches, other than that everything still works great. It was an expensive rice cooker but worth every penny I spent. Only thing I don't like is the timer, you can set timer to cook for mixed rice."], "reference": [22, 13, 13, 9, 7, 5, 5, 5, 5, 4, 3, 3, 3, 3, 3, 3, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.05308642063611819, 0.5, 0.6000000238418579, 0.6652343750465661, 0.44320987946825263, 0.6000000238418579, 0.6000000238418579, 0.19753086714097012, 0.12479999628067015, 0.13437499952851795, 0.0062500000931322575, 0.46875, 0.1691406324680429, 0.23361099640164262, 0.23336110302231203, -0.10000000149011612, 0.4000000059604645, 0.8437499776482582, 0.6812499891966581, 0.7250000108033419, 0.30000001192092896, 0.04374999925494194, 0.05061728470487359, 0.05000000074505806, 0.10000000149011612, 0.060493838639906906, 0.2812500111758709, 0.5187500007450581, -0.23950617622446133, 0.30117187707219273, 0.30000001192092896, 0.19506173130170798, 0.12500000139698386, 0.32500001043081284, 0.6000000238418579, 0.21250000316649675, 0.40123457378811306, 0.43125000409781933, 0.42225000380650163, 0.5875000227242708, 0.5, 0.4333194517210492, 0.800000011920929, 0.6062500216066837, 0.800000011920929, 0.14814815403502665, 0.699999988079071, 0.4000000059604645, 0.4000000059604645, 0.49375000037252903, 0.7937500104308128, 0.10000000149011612, 0.5, 0.30000001192092896, 0.20000000298023224, 0.5249999985098839, 0.11653478015392635, 0.3481481422980626, 0.20003048148283853, 0.8999999761581421, -0.5]}