{"reviews": ["Throw the directions out because they don't make any sense.  Very poorly translated instruction manual, but using it is self-explanatory enough that you don't need the manual anyway.<br /><br />If you want to make rice for yourself or for a couple more people, it's the perfect size.  If you want to make more than enough for four people or if you eat a lot of rice, I suggest getting a larger sized cooker.<br /><br />It's very easy; you just add your water, salt, and oil, let that combination boil, then add your rice.  Stir it, cover it, and walk away from it for an hour or so.  Makes great Persian-style rice and is very easy to clean.<br /><br />Don't buy this if you're looking for a normal, multipurpose rice cooker/steamer/slow cooker because this unit will cook the bottom of the pot to a crisp - I bought it specifically for that purpose, to make a crispy crust on the rice called tahdig.  Because of how the heat is distributed, it would be hard to avoid burning the bottom of the pot if you wanted to use it for things like soup or stew.  It should only be used for rice.", "The main thing people seem to note about these cookers is a lack of instructions, so I want to address that for any skeptics.  There is a booklet that tells you the water-to-rice proportions, but it doesn't say how long to cook it.  Don't let that deter you;  a quick google search turns up a multitude of sets of instructions, and they all pretty much say the same thing:  cook for an hour and a half.  Some say clean and soak the rice, some don't, some are very detailed, some aren't.  It's all a matter of personal preference.  I just used this cooker for the first time tonight with no special prep-work, just tossing the rice, water, and oil in, setting the timer, and coming back in 90 minutes, and the results were AMAZING!  It is so easy, and if I can do it, I'm confident anyone can.<br /><br />Now as for the quality of the construction:  this cooker is beautiful!  It has all-metal construction, feels very sturdy, and cleans up so easily.  The pot comes right out and I had it cleaned in 2 minutes.  Only complaint (and you will see this everywhere this machine is talked about) is that the timer maxes out at 1 hour.  But it's really no trouble to just set it twice.  For all the labor saved in using this over the traditional way of making tahdig, resetting the timer shouldn't even show up on your radar.", "I made Persian rice for the first time using the Pars 10 cup rice cooker and it came out perfect. I used the recipe for 2 cups of rice offered by another reviewer on Amazon and followed the instructions that came with the cooker--bring water, salt, oil (and butter) to a boil in the cooker and then add the washed rice.<br /><br />I set the dial on 60 and put the lid on and when the water came to a boil I added the washed basmati rice to the pot, leveled it, and covered it with the lid wrapped in a tea towel as I'd seen a friend do when making rice on the stove top. When the dial reached the 10 mark I turned it back to 25 to add in more cooking time as was suggested in the reviewer's recipe. I think the extra time was needed because the recipe had more water to rice than most I've seen (2 cups dry rice, 3 and a half cups of water).<br /><br />When the time was up I pulled out the inner pot and turned it upside down onto a plate and--presto!--delicious rice with beautiful tadig. The rice came out of the pot cleanly in one piece leaving nothing behind. It could not have been any easier to clean the pot. I wiped it out with a soapy sponge, rinsed, and was done.", "I love this pot.  You cant mess it up!  I have tried all the settings and i have adjusted the oil and salt to play around with it.  The only thing I have not changed was the recommended ratio of water to rice.  I did have trouble understanding the directions and went online to read more.  SO really all you have to do is turn the dial clockwise to turn it on,  let the water, oil, and salt come to a boil.  Stir in the rice, then turn the knob again clockwise  to the time you want it to cook.  Steam will escape from around the lid but DON&#34;T PANIC-  it doesn't matter!  The further you turn it the darker the crispy part on the bottom gets.  EASY.  If you want to add other things, like dill and lima beans or sour cherries,  just add them when you stir in the rice.  My favorite is setting is the one that says 50 minutes.", "I used the measuring cup it came with, cooked 2 (dry) cups and the pot was full to the rim after cooking. So not a “3” cup as advertised.", "The instructions are nonsense. i went online and found recommended instructions from others. Also tried different settings myself. It produces nice rice and tahdig. Not as good as made the old fashioned way in a pot with a towel wrapped around the lid, but it's a great way to make quick full proof Persian rice with tahdig, especially for inexperienced rice cookers. Highly recommend it.", "Outstanding! Made perfect rice with wonderful tahdig. I've made Persian rice since the '70s and never satisfied with crunch in the oven or on the stove, this works exactly as you would want. I read many of the comments and all were helpful, some suggested trial and error, but I had guests for dinner, so I used 5 of the &#34;cups&#34; per the one provided( I bought the 7 cup),  washed the rice throughly, soaked it one hour then added the chopped dried apricots and chopped dried sour cherries, 2 tsp salt. Into the pot I put 1/2C ghee, and the suggested amount of water. Turned the dial to 60 minutes and waited until it just came to a boil, added all the rice and fruit, used a coffee mug to compress the rice, turned the dial back to 60, the keep warm 45 minutes. Came out of the pot perfectly, no sticking at all, and perfect dark gold crunchy tahdig. I'm thrilled with this no hassle and dependable cooker for Persian rice. Also happy that it cooked the jeweled rice so that now I know I can't any version I like. The 5 &#34;cups&#34; made plenty for a party of 6 big eaters, so I see no problem with the cup measure that is included with the cooker-a lot of people complained, but, I don't get why, just add one extra of their cups and you'll be fine.<br />BTW- I saw a lot of folks wanting to know about brown Basmati rice, so here's a tip: Wash the brown rice well and soak in plenty of water over night, drain and continue as for white rice, the timing will work for the soaked brown rice with the same timing as white rice, this goes for brown Jasmine rice too, I have no idea if it would work for regular brown rice, never tried it, rarely use it.", "Thrilled to finally make perfect Tahdig after years of trying. Please know the timer is pretty fast and does not match minutes but the tahdig color scale on the dial that you turn the pot on with is perfect for tone of tahdig doneness! Perfect thanks PAR! Also I got a 10 cup and would not recommend smaller! I make 2 American size cups of boiled rice piled in the PAR for tahdig and it is perfect!", "I have tried three of these and they all burn the rice if set to more than 30 minutes (no tahdig). I have had older models which made perfect rice and tahdig when set to 60 minutes and left plugged in for even longer.  The older units have a spring loaded button that lifts the pot a fraction of an inch at the appropriate time  but that seems to have been eliminated in the newer generation which may be the culprit.", "I don't know what kind of magic is involved, but this rice cooker somehow makes a perfect pot of rice with a perfect layer of tadik. One of my smarter purchases!", "Everything to love about this rice maker. Wash your rice; add water, salt and oil; turn it on and in less than an hour a perfect pot of rice with the best crisp all around.", "I am very satisfied with this purchase.  It makes great Persian style rice, the grains of rice are separate after cooking and not sticky.  There is a nice golden crust on the bottom and the non stick coating of the pot allows you to easily invert the rice onto a platter for a nice presentation.  I bought the 8 cup size and the instructions say that the minimum recommended amount of rice to cook is 4 cups.  (The rice cooker comes with a plastic measuring &#34;cup&#34; that is equal to 3/4 cup U.S. measuring cup.)  The water, salt and vegetable oil are brought to a boil in the rice cooker and then the rice is added and cooked for about 50 minutes.  As with any rice cooker, the steam when cooking is hot so caution must be used when removing the lid.", "Making Persian Rice in this cooker is a breeze. Only wish I had sized up. The tahdig (crispy rice on the bottom of the pot) comes out perfectly. Only problem is everyone wants it.  Lol. I plan to purchase three of the these  larger sized rice cookers to give as Christmas gifts to my grown kids and their families.<br /><br />The instruction book is terrible. Read other reviews for guidance on amounts of water, rice, salt and oil to use.", "Gift for father and made his life much easier. The tah dig is better and more even than when he used a pot."], "reference": [27, 27, 23, 9, 7, 5, 4, 3, 2, 1, 1, 1, 0, 0], "score": [0.30000000447034836, 0.5, 0.02500000037252903, 0.8999999761581421, 0.10000000149011612, 0.5, 0.20000000298023224, 0.6000000238418579, 0.10000000149011612, 0.30000001192092896, 0.699999988079071, 0.4000000059604645, 0.6000000238418579, 0.30000001192092896]}