{"reviews": ["Wow!  This thing is great!  I have struggled making Persian rice on the stovetop.  No more!  This cooker makes it so easy!  It makes perfect tadig.  Here is how I do it, and it works for just about any amount of rice.  I have not tried any less than 3 cups (included Persian rice cups, not standard measuring cup), but this recipe works for 3+ cups:<br />Wash the rice - get it good and clean.  I wash about 5 times, right in the cooking pan.<br />Cover rice with water - add water until the rice is covered by about 3/8 - 1/2 of an inch of water<br />Add salt.  I add about a tablespoon per 3 cups.<br />Add oil.  I never measure but add a healthy splash of oil, probably a quarter cup (standard measuring cup) per 3 cups rice.<br />Stir and set to 1 hour on timer.<br />While cooking, I crush some saffron and grind with salt to a powder, and dissolve in about 1/4 cup boiling water.  Let sit.<br />About 10 minutes before the timer is done, I add a half stick of butter (1/8 pound) cut into about 8 pieces onto the top of the cooked rice, and pour the saffron water over the rice.<br />Let it finish cooking the remaining 10 minutes.<br />Perfect Persian rice!", "I’m shocked that someone could sell a product in the US with instructions that are filled with spelling and grammatical errors. The makers didn’t even bother having someone proof read it. Oh, aside from these errors they also make no sense!<br /><br />Here’s what I learned by trial and error:<br />(1) for up to 4 cups of rice, use a half cup more of water ex. 3 cups rice to 3.5 cups water. For over 4 cups of rice, use one cup more water ex. 5 cups rice, 6 cups water.<br />(2) for 4 cups of rice I use 1/3 cup of oil. Whatever you do, do not go by their recommended oil usage of whatever this thing “salad oil” is called. You’ll end up with super oily rice! I use half blend of avocado and olive oil which is a pale colored oil and not super heavy. Works great.<br />(3) I cook 4 cups of rice for 60-min and the tahdig (crispy bottom) comes out perfectly.<br />* Add 20 more minutes for more than 4 cups<br />* Do not stir the rice, you’ll break it and it won’t come out perfectly. Maybe one light stir but no more is needed.<br />(4) when there’s about 10 minutes left and you don’t see any more water, pour in your saffron<br /><br />The lid does not have a rubber seal so the whole time it whistles which can definitely be improved upon. Other than that it works once you actually get the hang of it.", "The main thing people seem to note about these cookers is a lack of instructions, so I want to address that for any skeptics.  There is a booklet that tells you the water-to-rice proportions, but it doesn't say how long to cook it.  Don't let that deter you;  a quick google search turns up a multitude of sets of instructions, and they all pretty much say the same thing:  cook for an hour and a half.  Some say clean and soak the rice, some don't, some are very detailed, some aren't.  It's all a matter of personal preference.  I just used this cooker for the first time tonight with no special prep-work, just tossing the rice, water, and oil in, setting the timer, and coming back in 90 minutes, and the results were AMAZING!  It is so easy, and if I can do it, I'm confident anyone can.<br /><br />Now as for the quality of the construction:  this cooker is beautiful!  It has all-metal construction, feels very sturdy, and cleans up so easily.  The pot comes right out and I had it cleaned in 2 minutes.  Only complaint (and you will see this everywhere this machine is talked about) is that the timer maxes out at 1 hour.  But it's really no trouble to just set it twice.  For all the labor saved in using this over the traditional way of making tahdig, resetting the timer shouldn't even show up on your radar.", "Tahdig is one of mankind's greatest achievements that is astoundingly difficult to make properly. My husband is Persian and can make some semblance of tahdig about 50% of the time he tries.<br /><br />After 15 years of marriage, he finally tells me that there is such a thing as a Persian rice cooker. We've owned a few different high-end rice cookers over the years, none of which ever produced tahdig. This model is very basic feature-wise, but it does the trick.<br /><br />The instructions are a little hard to follow in parts- they didn't do a great job translating them but they aren't terrible. The suggested measurements for water, salt and oil are pretty much spot on but you will want to try different oils (ghee, grapeseed, etc) to see which one produces your desired result. You kind of have to guess at the timer settings, but with some trial and error, you too can enjoy tahdig whenever you need it.", "If you enjoy the crispy &#34;bottom of the pot,&#34; or &#34;Tah Deeg,&#34; that is so characteristic of many Persian rice preparations, but are frustrated by the inconsistent results (not crispy enough one time, charcoal the next) achieved by making it 'manually,' then this rice cooker is for you. You may want to consult the Internet and watch some helpful YouTube videos to learn all the tips and tricks (most importantly, that the amounts of oil suggested in the manual are somewhat excessive), but ultimately, the PARS is easy to use right out of the box. Be sure to use only the highest quality Basmati, and you can enjoy a thick crust of golden Tah Deeg every single time.", "I just received the ten cup rice maker and made my first batch of tagdig last night. I followed the directions others have posted (don't bother with the directions or the plastic cup included with the cooker), and it was perfect.<br /><br />For two cups (US measures) of dry basmati rice, I used 3-½ cups water along with two tablespoon of oil and a teaspoon of salt. I rinsed the rice very well (no need to soak the rice) and added everything to the cooker, smoothing out the rice so the top was even. No need to put a towel under the lid. I set the timer to 60 minutes.<br /><br />After the timer went off, I added a bit of ground saffron mixed with a tablespoon of hot water and 2 tablespoons of melted butter - sprinkled over the top. I cooked it another 15 minutes and inverted it on to a plate. It had a beautiful golden crispy shell and the rice was light and fluffy.<br /><br />Next time, I'll add the butter and saffron at the beginning with the water, which will help disperse the yellow saffron color throughout the rice, rather than leaving streaks when it's added later.<br /><br />I'd also like to try making tachin with chicken and some vegetables, but not sure about the timing. I'll obviously precook the chicken, but since it cooks for an hour I don't want the chicken to overcook. Not sure when to add the yogurt either. Any advice?", "I bought this rice cooker as a gift for my half Iranian boyfriend who struggles to make Persian rice despite the tips his parents have passed on. First try - we made 2 cups of rice, with about 60ml of oil and the tah dig was amazing! As was the actual rice itself, perfectly cooked. We just put all the ingredients in, set the timer for 1 hour and forgot about it, didn’t check on it once. This product is such a game changer and we’re super excited about it.<br />It took me a long time to decide which size to get - and i ended up going for 5 which is a great size for a couple or a small family. 2 cups was enough for 3 people, I think.", "This rice cooker is fantastic.  After years of hit-or-miss success with persian rice - and getting the crust right  - this cooker did it the first try!  It is so easy to use...rinse the rice, boil the water, add the rice, salt and oil in the proportions recommended in the book and turn the dial to 60.  After it expired, I put it on another 5-8 minutes and the crust was perfect.  My family was thrilled.  Ignore the instructions in the book other than the proportions of rice to water and oil.  The rest of the instructions make no sense.  Quick easy clean up as well.  So much easier than cooking on the stove.", "Product works great if you are making Persian rice with tahdig for 2-4 people. As other reviewers have stated, after looking at rice/water amounts throw out the instructions. They are written as if someone speaking only farsi told someone only speaking chinese at the Chinese manufacturer how to write them but they need to be in English. Read them for entertainment, not information. Once you get the oil/butter and salt amount to your taste and you play with time, the rice is perfect. First time out, using the cup they provide, used 4 cups rice, not quite 5 cups water, 2 tbsp. butter, and just ground a couple times with salt, guessed at 1 hr 20 min. Rice was perfect but tahdig was starting to burn in a couple places on top. Will add lots more butter, double the salt, and reduce time to 1 hr next time. Good luck!", "This is an excellent product with focus on quality and build material.<br />For many who are unaware, this is not your typical rice cooker. If you are thinking about your average rice cooker then don't bother with this brand. This rice cooker is specifically made for making Persian rice. Yes you heard me right. The type of rice and the method of cooking with a Persian rice cooker is slightly different. Feel free to search online by what I mean.<br />As for the capacity, I found this size to be excellent for single person or couples at most. As a college student, this is by far an excellent investment. Just place the rice, add the oil and salt and turn it on.<br />I strongly recommend this rice cooker.", "Everything to love about this rice maker. Wash your rice; add water, salt and oil; turn it on and in less than an hour a perfect pot of rice with the best crisp all around.", "Once you understand how to use this its easy and fun. Go to You Tube to see instruction. I add a little butter to the oil to make it taste richer!"], "reference": [112, 28, 27, 6, 4, 4, 4, 4, 3, 3, 1, 0], "score": [0.15000000223517418, 0.02500000037252903, 0.4000000059604645, 0.10000000149011612, 0.4000000059604645, 0.30000001192092896, 0.699999988079071, 0.02500000037252903, 0.699999988079071, 0.20000000298023224, 0.800000011920929, 0.10000000149011612]}