{"reviews": ["Seriously, it plays Twinkle, Twinkle, Little Star when you start it.  But, we love it!<br /><br />This is my second Zojirushi rice cooker with fuzzy logic.  I received the first one as a gift 10 years ago and it still works fine.  We got this one, because we wanted a smaller cooker that didn't take up as much space in our overloaded kitchen.  Our old cooker is a 10-cup model and worked flawlessly.  The new model is much improved.  The retractable cord is an excellent feature and the cooker is easy to program. It is also easy to clean and nonstick.  Cooks rice to perfection.  Yes, it's expensive, but it does an excellent job and it's built to last.  We had originally gotten a cheaper brand ($40) to replace our old Zojirushi.  Big mistake.  It lasted less than a year.  Zojirushi is much higher quality and we look forward to another decade or more of regular use.  Highest recommendation!!<br /><br />Update May 2009:  Still using this cooker regularly.  Does a great job and is holding up well!!  No problems.", "To the other helpful reviews below, I can add a few points.<br /><br />Size/Capacity: Should you get the 3, 5, or 10 cup?<br /><br />* As a rule of thumb, I would offer that the 3 cup cooker may be good for singles & couples; the 5.5 cup for families; and the 10 cup for those who want to make a whole lot of rice, or maybe use the cooker as a kind of crock pot.<br /><br />* As noted by other reviewers, the \"cup\" indicated in these models is not a standard US dry measure cup; the measuring \"cup\" that comes with the cooker is about 3/4 of a typical measuring cup.<br /><br />* The \"cup\" measure is important because the cooker comes with a detailed spreadsheet that describes the type of rice and the maximum amount of rice you should cook. The \"cups\" refers to WHITE rice. Brown rice has a different capacity-- with brown rice the maximum amount of rice is 2 \"cups\" in the \"3 cups\" rice cooker. The spreadsheet describes capacities for white rice, brown rice, sweet rice, long grain white, Jasmine, Basmati, wild rice, and oats. Here are some details, just for white and brown rice:<br /><br />White rice<br />3 Cup Cooker -- 3 \"cups\" max<br />5.5 Cup cooker -- 5.5 \"cups\" max<br />10 Cup cooker -- 10 \"cups\" max<br /><br />Brown rice<br />3 Cup Cooker -- 2 \"cups\" max<br />5.5 Cup cooker -- 4 \"cups\" max<br />10 Cup cooker -- 8 \"cups\" max<br /><br />* To summarize, the 3 cup cooker is small.<br /><br />Construction<br /><br />I bought this cooker to replace a fuzzy-logic cooker made by Panasonic that I had for 15 to 20 years. It worked fine until destroyed by human error. What impressed me about Zojirushi is the cooking bucket.<br /><br />* This cooker has a heavy, thick metal cooking pot. It is much heavier than the pan that came with my old Panasonic cooker. I believe that this does improve cooking quality, just as heavy pots can be better on the stove for distributing heat.<br /><br />* The cooker has clearly marked, easy to read measurements etched into the pan. The instructions recommend dumping the correct number of \"cups\" into the cooker, and then adding water up to the appropriate mark on the cooking pan. This is actually more convenient than measuring rice and then measuring water in a separate measuring cup.<br /><br />* There is a non-stick surface on the cooking pot, but it seems to be a next-generation material. Like others, I have some concerns about ingesting non-stick surface particles, and didn't like the fact that the surface in my old Panasonic cooker was scratching off. I am hopeful that this cooker, which looks better made, will not do this. Time will tell.<br /><br />* I was hoping that this product was made in Japan, feeling that this would assure some higher level of quality control. However, this cooker is Made in China, but the construction quality seems very high.", "Bought this cooker last Decmeber and it worked great...for eight months. Zojirushi advised me in August to send it to Goodman Appliances in Miami for warranty service. Now it's the end of November. Everytime I call Goodman to inquire I'm told they're waiting for a part. It's a rice cooker, not a nuclear power plant! If they can't fix it in a reasonable time Zojirushi should replace it. Just ordered a Sanyo...done with this kind of poor service.", "My old cooker had the steam vent in the lid right near the finger grip for opening the lid; it spit, dribbled and leaked cooking water, overcooked and browned the bottom of the rice even when immediately turning the power off, and simply couldn't manage to cook brown rice or pilaf completely. The Zojirushi is a dream!! No more burnt fingers, no mess on my countertop, the rice is done to perfection AND I've finally discovered the fantastic taste of properly cooked brown rice!! I bought this cooker because I trust the Zojirushi name. I've been using one of their bread makers for 17 years and I believe this Rice Cooker will provide the same long and durable service. As well, it looks nice, and the retractable cord and fold-down carry handle are nice touches.", "I bought this cooker just a little over 2 years ago and was reasonably happy with it. Recently however I noticed that the non-stick coating on the pan is softening, blistering, and flaking in a 2cm band running around the inside wall at about the halfway level. I contacted Zojirushi who promptly replied that \"the inner pan will tend to wear out and they need to be replaced\". They pointed me to their parts department where they sell the pan for $30 + $8 shipping. It was actually out of stock, probably because they sell so many of them. For me, this is not acceptable. I have pots with non-stick coatings that I have roasted at high temperatures for many years and they're still going strong. If this was a sub $50 cooker I would understand, but this is supposedly a premium product.", "This is a wonderful rice cooker.  I bought the first one for myself 2 years ago.<br />Believe it or not, my 7 year old grandson asked for one for Christmas 2010 and a 25 lb. bag of Jasmine Rice from Thailand....even a 7 year old can operate this computerized cooker.  He's getting his Christmas wish with this latest cooker.", "I got my new rice cooker this afternoon and immediately tried it out.  My first batch used 3 cups of long grain white rice and filled the cooker up to the 3 cup mark.  The rice came out perfectly.  My family ate the rice with a little soy sauce or a little butter.  Either way, it was great.  My second batch just finished cooking.  I love the fact that it stays warm for hours without deteriorating the quality of the rice.  If you buy this machine, you will not be sorry.", "Purchased after my girlfriend dropped hints she was missing her rice cooker in college.  After a little research, it was quite clear, this manufacturer and model were the best bang for the buck.  I know rice is easy to make, but this cooker really does it right.  Cooks sticky rice perfect every time.  I even enjoy the twinkle twinkle little star chime.  Definitely would recommend.  Only complaint, it does take a little while to cook, but if you plan ahead it doesn't come into play.  For example, come home, pour a little water and rice into the cooker, hit the settings, and walk away for a work out, TV, or to start complementary ingredients and it's done in 30-40 minutes.", "with the rice recipe book, this is an excellent cooker to make, cook, warm your rice. compact east to store, just a great product."], "reference": [89, 6, 5, 2, 1, 1, 1, 0, 0], "score": [0.5011718676250894, 0.04285629746707869, 0.5, 0.3500000052154064, 0.6000000238418579, 0.10625000158324838, 0.10000000149011612, 0.04374999925494194, 0.5]}