{"reviews": ["I’m shocked that someone could sell a product in the US with instructions that are filled with spelling and grammatical errors. The makers didn’t even bother having someone proof read it. Oh, aside from these errors they also make no sense!<br /><br />Here’s what I learned by trial and error:<br />(1) for up to 4 cups of rice, use a half cup more of water ex. 3 cups rice to 3.5 cups water. For over 4 cups of rice, use one cup more water ex. 5 cups rice, 6 cups water.<br />(2) for 4 cups of rice I use 1/3 cup of oil. Whatever you do, do not go by their recommended oil usage of whatever this thing “salad oil” is called. You’ll end up with super oily rice! I use half blend of avocado and olive oil which is a pale colored oil and not super heavy. Works great.<br />(3) I cook 4 cups of rice for 60-min and the tahdig (crispy bottom) comes out perfectly.<br />* Add 20 more minutes for more than 4 cups<br />* Do not stir the rice, you’ll break it and it won’t come out perfectly. Maybe one light stir but no more is needed.<br />(4) when there’s about 10 minutes left and you don’t see any more water, pour in your saffron<br /><br />The lid does not have a rubber seal so the whole time it whistles which can definitely be improved upon. Other than that it works once you actually get the hang of it.", "Ok, so you want a Persian Rice Cooker. I am half Persian, been making and eating basmati long grain rice and making Tahdig for over 40 years...so my last Persian Rice Cooker was Imperial. I gave it to my daughter after 4 years of perfection. So after searching: I purchased this PARS 10 cup. I read all the reviews, both negative and positive. I purchased one with damaged packaging to save money. It came without instructions!!! You don't need it. Follow my directions, start enjoying Tahdig after about 1 1/2 hour: thick and crispy!! Let’s go! Take the cup they provide: For every cup of rice, add one cup of water..using their cup NOT yours!! It is not a full cup but about 160ml. I recommend you use at least 2 cups, so you will have some rice after the Tahdig is made. One cup is plenty of rice for one person. So serving 4; use 4 cups unless you like left over. After you to get past 5 cups of rice, you may want to add just a 1/2 cup more water, or check during the process, about 30 minutes and if the top rice is not quite cooked completely, you can add another small amount of water. In the beginning, add a small amount of vegetable oil and water and swirl it around to coat the pot. Add rice, water, a pinch of salt and even a small 1/8 teaspoon of vinegar. Set to max setting, about an hour. I did 6 cups on my first try with this new cooker, used 6 and 1/2 cups of water and I even presoaked the rice in water for an hour prior too cooking. I set to max setting and added another 30 minutes before we were ready to eat. My results pic is posted here. You do not want the cooker to turn off  before you take rice out, or your Tahdig will be soft and mushy. To keep it crispy, Take out immediately after it turns off or before it turns off!! CRITICAL. Two cups of rice may only take one hour to make good tahdig, you need to practice with different volumes and get it the way you like it. Take it out like you would a Bundt Cake and it is not right you can easily put it back in and cook longer to get the Tahdig right. You can even eat the rice after 30 min and leave the bottom part still cooking and eat the Tahdig at the end of your meal. PARS has really done all the work for you. Forget the confusing directions, follow this for perfect Tahdig each time. I am available for questions.", "Product works great if you are making Persian rice with tahdig for 2-4 people. As other reviewers have stated, after looking at rice/water amounts throw out the instructions. They are written as if someone speaking only farsi told someone only speaking chinese at the Chinese manufacturer how to write them but they need to be in English. Read them for entertainment, not information. Once you get the oil/butter and salt amount to your taste and you play with time, the rice is perfect. First time out, using the cup they provide, used 4 cups rice, not quite 5 cups water, 2 tbsp. butter, and just ground a couple times with salt, guessed at 1 hr 20 min. Rice was perfect but tahdig was starting to burn in a couple places on top. Will add lots more butter, double the salt, and reduce time to 1 hr next time. Good luck!", "Thrilled to finally make perfect Tahdig after years of trying. Please know the timer is pretty fast and does not match minutes but the tahdig color scale on the dial that you turn the pot on with is perfect for tone of tahdig doneness! Perfect thanks PAR! Also I got a 10 cup and would not recommend smaller! I make 2 American size cups of boiled rice piled in the PAR for tahdig and it is perfect!", "I used the cup provide with this rice cooker and used only 3 cups and as you see in the picture it’s at maximum capacity….. this rice cooker is advertised as a 5 cup but no way you can fit more than 3 cups…. It’s totally misleading and false advertisement", "The product indicates it is a rice cooker with 7 cups capacity. When you read it you think it is 7 cups of Rice. No it is not. The Capacity is 6 Cups of rice with 7 Cups of water. I guess my Iranian friends are getting smart in getting around the edges in advertising. The product is very good and it does what it is supposed to (cook rice with a good \"Tah Dig\" = Crusted Rice at the bottom of it). SO if you need more capacity than 6 cups, this is not for you, select the next model but deduct 1 cup from what it says it does.", "The sellers are cheddar first they don't have permission from pars khazar this rice Maker made in China nothing special also the size is not right if they said 7 cups that means 4 cup and super expensive compared to other Chinese rice Maker", "This rice cooker is really nice. My husband loves it so much that I had to stop him from cooking rice every night. I was afraid of gaining weight :-). The only problem is that it is too small. I ordered a 5 cup size but It is just a 3 or 4 cup, in my opinion. I wish it was a bit bigger. Other than this, it's perfect.", "You get Crispy rice at the bottom alright,  but at what cost...... the electric pot suppose to boil the water+oil+salt first, then you add the rice and only then the timer should start countdown, but that is not what happened. The timer start fro: beginning and continue until th3 end. also when the rice is in there and it reach boil point, the whole mix boils over and out of the lid.... at the end of it all the rice “cake” sticks to the pan unless you saturates the dish with so much oil.... when I use their measurement the rice came out mooshy, which by the way their one cup of rice is really 3/4 of a cup or 2/3 of a cup. After the first few failures I changed amounts to see if that will do any good, but it came oily and burned or dry to the crisp... instructions are totally off! I did get kind of a nice rice cake at one time, but again the rice on top was too soft and the bottom was too oily... I am still looking for the one who will be more accurate... also, there is no way to alternate recipes like having potatoes at the bottom etc. hopefully someone will come with something better... sooner then later....", "This rice cooker greatly simplifies making Persian rice with tahdiq.  So, very pleased with the results.  However, like other rice cooker manufacturers, calling it a \"5\" cup is misleading.  the cup they provide is not a cup (ie, 8 oz), just like many other companies.  It comfortably cooks 2 cups of rice. Might be able to do 2-1/2, but I wouldn't try more. Also, the 60 minute timer is a limitation.  Would prefer 90 minutes.  It's a pain having to go back and add additional minutes.  Doable, but an annoyance.  Just cooking for 60 minutes does not give dark enough crust, barely blond. Needs an extra 15 minutes.  For brown Basmati, an extra 25-30 minutes.", "10 cup is way too small. Over priced.", "It was not 5 cup it is about 3 cup and very expensive!! I did call Amazon about the size and price! The insert is very light and cheap looking for 84 dollars!"], "reference": [28, 4, 3, 3, 2, 1, 1, 1, 0, 0, 0, 0], "score": [-0.1750000026077032, -0.058333334202567734, -0.10000000149011612, -0.10000000149011612, -0.22500000894069672, -0.10000000149011612, -0.5, -0.10000000149011612, -0.10000000149011612, -0.23333333598242864, -0.30000001192092896, -0.4000000059604645]}