{"reviews": ["Wow!  This thing is great!  I have struggled making Persian rice on the stovetop.  No more!  This cooker makes it so easy!  It makes perfect tadig.  Here is how I do it, and it works for just about any amount of rice.  I have not tried any less than 3 cups (included Persian rice cups, not standard measuring cup), but this recipe works for 3+ cups:<br />Wash the rice - get it good and clean.  I wash about 5 times, right in the cooking pan.<br />Cover rice with water - add water until the rice is covered by about 3/8 - 1/2 of an inch of water<br />Add salt.  I add about a tablespoon per 3 cups.<br />Add oil.  I never measure but add a healthy splash of oil, probably a quarter cup (standard measuring cup) per 3 cups rice.<br />Stir and set to 1 hour on timer.<br />While cooking, I crush some saffron and grind with salt to a powder, and dissolve in about 1/4 cup boiling water.  Let sit.<br />About 10 minutes before the timer is done, I add a half stick of butter (1/8 pound) cut into about 8 pieces onto the top of the cooked rice, and pour the saffron water over the rice.<br />Let it finish cooking the remaining 10 minutes.<br />Perfect Persian rice!", "Gives best result I wish I would have bought smaller one didn't know you have to use at least 3 full cup to have this size I was thinking I can use it for any amount up to", "I didn't think I needed to add yet another rice cooker to my kitchen. Then an interesting article about Persian Tahdig in the L.A. Times Food Section peaked my interest.<br /><br />The article mentioned use of the Pars Rice Cooker as an alternate way to make the recipe. (I should add that I already have both big and small Zojirushi neuro fuzzy rice cookers, plus a microwave-style rice cooker. In a pinch I can make rice the old-fashion way-- Asian and Persian style--using a covered saucepan.)<br /><br />The idea of an 'automatic' tahdig cooker was something I just HAD to try. I learned to make tahdig from Cooks Illustrated, tips from Persian friends, and now from the L.A. Times Food Section.  The Pars website was out of stock.  I lucked out when I was able to buy a 3 cup cooker on Amazon at a great Warehouse price to try it out.<br /><br />Caveat: Looking at the instructions, it was obvious upfront that it would be necessary to make tahdig several times (3 tries in my case) before finally achieving a golden crusty delicious result.<br /><br /> I used its standard rice measurer, the SAME measuring size that comes with Asian rice cookers (1 raw rice cooker cup expands to 1 regular cup of cooked rice).  I also used the rice, oil, and salt measurements for the 1 cup preparation since at first I was just testing the quality of the tahdig surface.  The measurements for oil are in metric (mm) measurements, but fortunately its rice cup included mm measurements.<br /><br />Skip the instructions that come with the rice cooker, which includes perplexing instructions for first adjusting the dial clockwise, looking for a yellow light to then turn the dial counterclockwise while cooking. (I took off 1 star from the Product Review ONLY for this issue regarding the instructions. It takes a few tries to get it right. Do NOT give up after only 1 or 2 tries!)<br /><br />Instead, adjust the dial ONE time, clockwise to the color desired to the shade shown on the dial. (Ex: the black section WILL produce black-scorched rice), so I dialed up to the most yellow color section of the dial--with pleasing golden cooked results.<br /><br /> I NEVER saw the light change from red to yellow, then realized it wasn't necessary to look for a color change of the light. Simply look for the light to turnoff, which signals that the rice is done.  To prevent soggy-ness, remove the rice pot once done. Otherwise, the rice will continue to steam, ruining the crispiness of the golden crust.<br /><br />Later I tried making the 2 cup size--which made the tahdig plus a portion of regular rice.  The tahdig had same desired results.  The regular rice section was acceptable.  I would NOT advise trying the 3 cup method. The 3 cup method didn’t allow for enough expansion of the 'upper' rice to keep the grains fluffy and separate.<br /><br />Still, if you’re more interested in the tahdig, then all you need to use is the 1 cup method.<br /><br />(In later use, if I did make 2 cups of rice, then after separating the regular rice from the tahdig rice,  I transferred the remaining regular cooked  rice into my smaller-size Asian rice cooker—using the quick-cooking rice selection to reheat and add fluffiness to the cooked rice that was in the upper section of the tahdig.  Hey...I have a thing for Asian rice, and I have the Asian rice cookers, so that works well for me if I need to reheat the regular rice.)<br /><br />Whether to add rice up front - or - wait to add rice once it comes to a rolling boil: The instructions indicate to add the rice once the water comes to a boil.  If I'm standing by the cooker doing other things, I'll add the rice once it's boiling.  However, if multi-tasking away from the kitchen, then I’ll add the rice upfront so I don’t forget it.  I did not find any discernable difference between the two methods.<br /><br />I'm glad I got it. So glad,  that I bought another to send to my tahdig-loving sister!  She hasn’t received it yet, but I’m confident she will enjoy using it and presenting nice and easy tahdigs for her future parties.", "As an Iranian I love the crispy bottom layer (tadeg).  But the temperature on 3-cup one is too high and burns the rice black with the stinky burned rice smell.  Unfortunately, Amazon piles all reviews together and this machine is getting high marks due to bigger rice cookers.  I have a 12-cup and it is awesome.  But kids moved out and we needed smaller rice cooker, so I got 3-cup one.  It is awful but I made a mistake of throwing its box away so no returning is possible.  Do not buy 3-cup version.", "I’m not one to write many reviews but as I love this Tahdig cooker, I had to sing its praises. I’ve been wanting to make Tahdig for a while and watched a lot of videos on YouTube. I found them fairly intimidating but had found references to the Pars cooker. I bought the 4 cup one as there are 2 of us and I don’t entertain big crowds any more. It did sit in its box for a while but once I started using it, it didn’t even go back into the appliance cabinet. I have made only the one cup servings which is more than enough for the 2 of us. Their cup measure is less than a regular measuring cup and it gives a lot of crunch surface area. I’m still experimenting with “darkness” settings and different kinds of oils. I’ve used olive oil, canola oil and ghee and it comes out slightly differently but perfectly and crunchy every time. I do add saffron and have added Greek yogurt to sone batches. I’ve done it with cold water as well as waiting for the water to boil ( when I add the saffron strands and mash them). It’s great every time. The Tahdig comes out of the bowl easily and it’s very easy to clean.", "I just received the ten cup rice maker and made my first batch of tagdig last night. I followed the directions others have posted (don't bother with the directions or the plastic cup included with the cooker), and it was perfect.<br /><br />For two cups (US measures) of dry basmati rice, I used 3-½ cups water along with two tablespoon of oil and a teaspoon of salt. I rinsed the rice very well (no need to soak the rice) and added everything to the cooker, smoothing out the rice so the top was even. No need to put a towel under the lid. I set the timer to 60 minutes.<br /><br />After the timer went off, I added a bit of ground saffron mixed with a tablespoon of hot water and 2 tablespoons of melted butter - sprinkled over the top. I cooked it another 15 minutes and inverted it on to a plate. It had a beautiful golden crispy shell and the rice was light and fluffy.<br /><br />Next time, I'll add the butter and saffron at the beginning with the water, which will help disperse the yellow saffron color throughout the rice, rather than leaving streaks when it's added later.<br /><br />I'd also like to try making tachin with chicken and some vegetables, but not sure about the timing. I'll obviously precook the chicken, but since it cooks for an hour I don't want the chicken to overcook. Not sure when to add the yogurt either. Any advice?", "We got the 10 cup rice cooker and I've always made tahdig the old fashioned way, but this does make a good quick version. At first I wasn't getting a good result and then I talked to a friend who has one and she helped with the proportions and it started working.<br /><br />First of all...you must get very good Persian approved basmati rice. This is critical. I made some with a lesser rice and I got mush.<br /><br />This is what you do...<br /><br />Soak the good rice for at least 30 min and up to as long as you want.<br />Rinse it until water runs clear.<br />In the bottom of the cooker put a oil (or for even better flavor oil and ghee mixed together...you may need to turn on the cooker to melt the ghee if you do this). I put enough in so that the whole bottom is covered (sides and center).<br />Add the drained rice into the cooker.<br />Add the same amount of water as rice adding one additional cup (for 3 cups rice, add 4 cups water).<br />Add a decent amount of salt to the water.<br />Cook for about an hour and a half (you will need to add extra time on the cooker).<br />When rice is done, fluff and add some saffron tea (a bit of saffron added to hot water to release flavor/color).<br /><br />It's delicious!", "Ok, so you want a Persian Rice Cooker. I am half Persian, been making and eating basmati long grain rice and making Tahdig for over 40 years...so my last Persian Rice Cooker was Imperial. I gave it to my daughter after 4 years of perfection. So after searching: I purchased this PARS 10 cup. I read all the reviews, both negative and positive. I purchased one with damaged packaging to save money. It came without instructions!!! You don't need it. Follow my directions, start enjoying Tahdig after about 1 1/2 hour: thick and crispy!! Let’s go! Take the cup they provide: For every cup of rice, add one cup of water..using their cup NOT yours!! It is not a full cup but about 160ml. I recommend you use at least 2 cups, so you will have some rice after the Tahdig is made. One cup is plenty of rice for one person. So serving 4; use 4 cups unless you like left over. After you to get past 5 cups of rice, you may want to add just a 1/2 cup more water, or check during the process, about 30 minutes and if the top rice is not quite cooked completely, you can add another small amount of water. In the beginning, add a small amount of vegetable oil and water and swirl it around to coat the pot. Add rice, water, a pinch of salt and even a small 1/8 teaspoon of vinegar. Set to max setting, about an hour. I did 6 cups on my first try with this new cooker, used 6 and 1/2 cups of water and I even presoaked the rice in water for an hour prior too cooking. I set to max setting and added another 30 minutes before we were ready to eat. My results pic is posted here. You do not want the cooker to turn off  before you take rice out, or your Tahdig will be soft and mushy. To keep it crispy, Take out immediately after it turns off or before it turns off!! CRITICAL. Two cups of rice may only take one hour to make good tahdig, you need to practice with different volumes and get it the way you like it. Take it out like you would a Bundt Cake and it is not right you can easily put it back in and cook longer to get the Tahdig right. You can even eat the rice after 30 min and leave the bottom part still cooking and eat the Tahdig at the end of your meal. PARS has really done all the work for you. Forget the confusing directions, follow this for perfect Tahdig each time. I am available for questions.", "Thrilled to finally make perfect Tahdig after years of trying. Please know the timer is pretty fast and does not match minutes but the tahdig color scale on the dial that you turn the pot on with is perfect for tone of tahdig doneness! Perfect thanks PAR! Also I got a 10 cup and would not recommend smaller! I make 2 American size cups of boiled rice piled in the PAR for tahdig and it is perfect!", "This rice cooker works great. It is perfect for tadig. I think it works better for most rice dishes, unless you are going to make a specifically Asian dish like sushi or stir fry (which would require frying in a wok after steaming). The rice that this makes is looser, more oily, and seasoned than typical rice from a regular rice cooker like a Tiger or Zojirushi rice cooker. You can make 1 to 4 cups of rice with the 4 cup model (I have the 4 cup model). I have read reviews that say you cannot make as many cups as advertised, but, at least with the 4 cup model, that is not the case. I can easily make 1 to 4 cups of rice with this cooker. It works as advertised and I would recommend it to anyone who enjoys eating rice. It is easy to use and the price is inexpensive compared to most other quality rice cookers. One piece of advice, if you would like to cook only 1 cup or rice I would recommend the 3 or 4 cup rice cooker. If you purchase a model that cooks 5 or more cups the instructions will note that the minimum amount that you can cook at one time is 2 cups. I frequently cook 1 cup of rice for myself so that 4 cup was the model I chose. I do not like to cook a lot of rice and store it, but prefer to cook rice freshly for each dinner.", "This rice cooker has not been redesigned for over 40 years... I'd recommend \"Yum Asia Sakura Rice Cooker with Ceramic Bowl and Advanced Fuzzy Logic (8 Cup, 1.5 Litre) 6 Rice Cook Functions, 6 Multicook Functions, Motouch LED Display, 120V Power\" instead. It has many other functionalities like slow cook, sitkcy rice, soup, etc. It also makes great tadig!<br /><br />I bought this from a local Persian store but it's the same product and this review applies to all of them.<br /><br />This rice cooker should not have ever been made or sold and I'll explain why:<br /><br />Someone at Pars decided to expand the line without having to do a little R&D. They probably hired a Persian guy and a Polish dude, had them cut the top of a 10 cup rice cooker, shrunk the inner pot, made it thinner and called it a day without calibrating the burner.<br /><br />The burner was never designed for smaller than a 10 cup rice cooker and it runs at the same temperature and intervals. An smaller, thinner inner pot cannot dissipate and distribute the heat as fast as it should and for that reason it burns the rice every time. If you can smell the Teflon melting, that's too hot. It's dangerous to operate and dangerous to eat out of. Most of you who posted the pictures of your tadig, they are burned... if you see a black ring in the middle of brown, that's burned tadig.<br /><br />Do not buy smaller than 10 cup Pars rice cooker until this is fixed. A 10 cup is not much bigger but still cooks one or two cups better than the smaller capacity rice cooker Pars makes.", "The best and the easiest way to make persian rice with tadic..  I was given as a gift  one 6-7 cup along with the finest Indian Authentic Basmati rice.  It is the best persian rice one can make.  Put rice, water, oil, salt, pepper. or any other ingredient - together in the pot, turn it on and forget it.  Voila a perfect Persian rice.  I love it.  I have already purchased three cookers and the rice to give for gifts.  Highly recommend it.", "Love it so easy to cook and clean, there is just one problem this rice cooker is so small and the measuring cup measures less than a cup. I ordered 3 cups rice cooker but in reality it cooks 2 cups. Overall for my small family it works perfectly fine I cooked this mixture of rice and quinoa in 20 minutes and came out as I wanted 😋.", "I have not tried it for conventional white rice but a Persian rice cooker is so easy to use!! 30min gets 1 cup of rice cooked to perfection!  Tasty and very soft!  follow the directions, no rocket science here.  I added some garlic and onions to give a bit of flare and no issues!.. Rice was perfect first time out!", "I love this machine!  It was so easy to use, once I figured out the instructions!  I used proportions for one cup of rice, set for 50 minutes, added some Lima beans and voilá, perfect rice!", "It works beautifully but I had requested a 5 cup rice cooker and got 4 cup one which works perfect with 3 cups of rice."], "reference": [112, 18, 16, 16, 8, 4, 4, 4, 3, 2, 1, 1, 1, 0, 0, 0], "score": [0.20000000298023224, 0.10000000149011612, 0.10000000149011612, 0.30000001192092896, 0.10000000149011612, 0.30000001192092896, 0.10000000149011612, -0.058333334202567734, -0.10000000149011612, 0.18888889501492181, 0.30000001192092896, 0.30000001192092896, 0.30000001192092896, 0.699999988079071, 0.30000001192092896, 0.30000001192092896]}