{"reviews": ["I bought these to help filter out noise at the office generally for music listening. I will split the review into three section: Noise Cancelling, Sound Quality, and Other.<br /><br />Noise Cancelling:<br />They will work for some people but not all. At the home office they work great, they filter out the frequency of noise produced by computer fans. However, I don't believe the noise cancelling is all that adaptive, rather it is just filtering a fixed number of frequencies. For example, the higher frequency noise from my air purifier is still noticeable, but dampened. This seems to be the case with all noise. I would expect their algorithm is doing something like filtering out the average frequencies in the average environment so overall you do indeed get a quieter listening experience.  ̶I̶ ̶f̶i̶n̶d̶ ̶t̶h̶e̶ ̶\"̶A̶m̶b̶i̶e̶n̶t̶ ̶A̶w̶a̶r̶e̶\"̶ ̶s̶e̶t̶t̶i̶n̶g̶ ̶t̶o̶ ̶b̶e̶ ̶t̶h̶e̶ ̶q̶u̶i̶e̶t̶e̶s̶t̶.̶  (UPDATE: Meant to say ANC (duh) slightly confusing what mode I was in based off of the quick start manual. Ambient would be if you wanted to hear more than if the ANC was just off.) For the price this is very acceptable. The more adaptable, on the fly noise cancelling algorithms are extremely difficult to implement, and hence you pay a premium for them. Overall, I would compare these to a really good pair of foam tip IEMs in terms of noise cancellation. These will definitely not provide any hearing protection for things like shooting, loud shop work, etc... so keep that in mind and use your head.<br /><br />Sound Quality:<br />These are definitely a \"consumer  grade\" listening experience, which for most people won't be a bad thing. For the price I am indifferent. I would say the bass is higher than normal with more muted/muddy treble. This isn't necessarily a bad thing and I would say most people would find them \"good\".  For what they cost, the sound exactly like what I would expect, better than a 20 dollar pair of headphones and not as good as a $150 dollar pair of IEMs, but your mileage may vary. For comparison with a competitor, I have some Sony wf-c500 wireless earbuds (no ANC) and these sound roughly the same, maybe slightly less clear treble and bass. I would still pick these over the Sony's because these have more features for the price and for other reasons I will list below.<br /><br />Other:<br /><br />Battery -- I think the battery life specs are roughly accurate, I get a full day on them, but haven't really pushed them to the 40 hours though. Battery life seems great, the case seems to get you maybe 2 charges. The case is nothing special, I wish the hinge had more tension in it like the Sony's so it felt more premium, I can kind of wiggle it a little bit but definitely not a deal breaker. I have yet to run them to the point where they alert you if they are low just once or they keep doing it. If they keep doing it I will update and remove a star because I don't quite understand why you would annoy the user with a message consistently for the last X% of battery (original rating is 4 stars).<br /><br />Size and Eartips -- these are rather large, but acceptable given the price and feature set.  They don't fit in the ear as well as the Sony ones do but they don't seem to fall out either. The Sony design fits into the ear better and \"hugs\" it so to speak, they seal better as well. I do really wish these came with a set of foam tips, they would actually compete in a different price bracket for that much, mainly because of the noise reduction. They would also help the fit. The included silicon ear tips are like the cheapest on the market, not as supple as more premium earbuds. There's nothing inherently wrong with them but they may rip after a while. I think if JBL addressed the fit (decrease the depth of the \"body\" in the ear so they seal better since there would be  less weight pulling down on the eartip) and eartips they'd have an extremely solid 50 dollar pair of earbuds.<br /><br />Controls -  ̶U̶n̶l̶e̶s̶s̶ ̶I̶'̶m̶ ̶m̶i̶s̶s̶i̶n̶g̶ ̶i̶t̶,̶ ̶I̶ ̶d̶i̶s̶l̶i̶k̶e̶ ̶t̶h̶e̶ ̶c̶o̶n̶t̶r̶o̶l̶s̶ ̶d̶o̶ ̶n̶o̶t̶ ̶h̶a̶v̶e̶ ̶v̶o̶l̶u̶m̶e̶ ̶a̶d̶j̶u̶s̶t̶m̶e̶n̶t̶,̶ ̶m̶a̶s̶s̶i̶v̶e̶ ̶m̶i̶s̶p̶l̶a̶y̶ ̶f̶r̶o̶m̶ ̶J̶B̶L̶,̶ ̶l̶o̶o̶s̶e̶ ̶a̶ ̶s̶t̶a̶r̶ ̶f̶o̶r̶ ̶t̶h̶i̶s̶.̶ ̶I̶ ̶d̶o̶ ̶n̶o̶t̶ ̶w̶a̶n̶t̶ ̶t̶o̶ ̶h̶a̶v̶e̶ ̶t̶o̶ ̶i̶n̶v̶o̶k̶e̶ ̶a̶n̶ ̶a̶s̶s̶i̶s̶t̶a̶n̶t̶ ̶t̶o̶ ̶r̶a̶i̶s̶e̶ ̶t̶h̶e̶ ̶v̶o̶l̶u̶m̶e̶.̶ ̶T̶h̶e̶ ̶S̶o̶n̶y̶ ̶e̶a̶r̶b̶u̶d̶s̶ ̶d̶o̶ ̶h̶a̶v̶e̶ ̶v̶o̶l̶u̶m̶e̶;̶ ̶h̶o̶w̶e̶v̶e̶r̶,̶ ̶  (UPDATE: Volume controls can be added through the app as a functionality; however, you loose the ability to change noise modes. I'm still rating 4 stars because I want both, would put 4.5 but can't. I don't see why both sides need a long press for google assistant or siri, one of these long presses could change the noise mode.) I would still pick the JBL buds because the volume steps are more gradual. I can get these to a comfortable level where with the Sony ones it always either a little too loud or a little too quiet. Other than volume I love that the controls are capacitive. Sony opted for actual push buttons in theirs which makes them unusable when laying on your side or for example working on your car, as you constantly bumping/pushing the buttons inadvertently in both cases -- so big win for the JBLs.<br /><br />Overall, a quality earbud for the price but improvements could be made, not sure you can find a more feature rich earbud for this price.", "I bought these for my husband to listen to the TV at night in bed. Thus, I do not have to hear the TV.  First the pros, they seem well made, I like the case, they charge fast, they connect quickly via Bluetooth to the TV, the sound comes through loud and clear, the battery lasts all night.  Now for the cons, the different ear pieces don’t seem to be shaped for a good fit in the ear —- they are more round and need to be narrower, (my husband uses the smallest size and his ears are normal size for a man, the next size up was too big), the volume control is either loud or mute—doesn’t seem to adjust easily and the direction on how to do the volume adjustment are not very clear or do not seem to work very well. I want to adjust the volume on the ear piece and not have to down load an app to do it. Overall, for the price, I did expect more but my husband does like them.  I bought a cheap pair of another JBL model for myself and I actually like mine better. But, I only listen to ebooks and movies on an iPad with mine.", "I'm a very picky \"audiophile\" and was looking for a TWS set to use out and about. I've tried a bunch of different models in the past, and sold them because of sound, mostly. I've tried the Galaxy Buds, Buds+, Buds Pro, Buds2 Pro, Jabra Elite 7, Soundcore Liberty 2 Pro, AirPods, Sony WF-1000XM3, among others. These have the best sound I have personally heard out of any TWS earbuds.<br /><br />First let's talk non sound stuff. The build quality is acceptable for something in the $50-100 price range, the plastic feels cheap but the hinge is nice. Touch controls work well, and I appreciate the USB-C charging. No wireless charging is a disappointment. Fit isn't the best for me, they don't feel snug how I like but they don't fall out and seal well. This will be different for every person. ANC is mediocre at best, only mildly cancelling out noise. Nowhere near as good as the stuff from Sony or Samsung. (As to be expected, these are cheaper.)<br /><br />Looking at the FR graph (thanks, RTINGS) we can see almost perfect compliance with the Harman Target. If you don't know what this means, it basically indicates these follow an industry-standard researched data point on what the average person will think sounds better. With other TWS buds that follow this target well, like the Galaxy Buds 2 Pro and Jabra Elite 7, I've had issues with a \"compressed\" or a sharpness in the treble. This probably is due to some upper treble differences or my own HRTF. With these JBLs I don't get that. Excellent sound, these are scientifically and objectively great.", "I bought both the Tune 130 and 230 earbuds during a Black Friday sale with the intent of testing both out and keeping the pair I like more.  The added sound from the base in the 130 is noticeable and they definitely win on the sound.  However, I like both so much that I'm keeping both for separate uses.  These 130's with better sound I keep in my gym bag and use for working out.  The other pair I keep in my laptop bag and use when traveling, listening to podcasts, and for work calls.  My opinion is that the both fit the ears well and don't fall out.  I kept the standard size in but there is a small and larger tip.<br /><br />I love how quickly these pair with already connected bluetooth devices and don't have connection issues.  The mono feature is also awesome and I use it all the time.  Make sure you adjust the functions of the earbud beforehand because they cannot be changed through the JBL app when only one earbud is in use.  You can also switch earbuds or add the second one seamlessly while already in use without using controls.  Battery life is great.  I've been using them for 2 months now and just plugged one of the cases in for the first time.", "First of all, DOWNLOAD THE APP if your sound isn't to your liking! The app has an adjustable EQ and other important features like noise canceling and ambient sound adjustment. I use the largest ear pieces provided for a secure and tight fit, which enhances bass response. My only complaint is that I wish they were LOUDER! I mean, they're ok, but one more level would be best for me personally bc when I jam my music, I JAM my music!<br />My music preferences are classic rock, new rock, melodic rock, and 80s stuff (both rock and new wave)<br />Overall, they're not \"amazing\", but they're really good. Can't go wrong with a name like JBL<br />(For the reviewers who say they lack bass response, try tighter fitting ear pieces. You MUST have a tight fit to enhance bass!)<br /><br />EDIT: Just discovering these buds DO NOT have a touch volume control which kind of sucks! Volume is ONLY controlled via the device. I wish I had known that. I may return them due to this", "I’m a professional musician so audio quality is extremely important to me. I received the JBL Tune 130NC TWS True Wireless In-Ear Noise Cancelling Headphones yesterday. Wow! Absolutely blown away by the quality! I immediately downloaded the app and played around with different eq settings and started writing my own. Love the control! This is a must for best performance. I wore them at my daughter’s basketball game last night and was pleasantly surprised how they blocked the annoying sound of the buzzer and whistle as I tend to wear earplugs. Made the experience so much more enjoyable! I’ll try these in the recording studio in the future as alternative test monitor for recordings.", "As with any product before I buy it I do extensive research I found the 130NC to be rated the best so I bit the bullet as they were 50% off at $54 when I bought them. Initial experience is as soon as you open the case they connect.<br /><br />I'll start with the meh and there's only two the noise canceling is MEH and I wish they got a little bit louder (they're loud though don't worry)<br /><br />The user experience is definitely better using an android based system because you can do the hearing test to dial in the EQ levels before you change anything in the app to truly get the best sound with Dolby atomos.<br />The sound quality is 10/10 best bang for your buck and the EQ presets are VERY GOOD there's no sacrifice in any sound it's a very broad range and everything is clear.<br />The JBL app is amazing you can customize which ear bud controls what to exactly how you want it. Highly recommend these ear buds just bite the bullet you will not be disappointed", "The sound quality and clarity is outstanding! In the first song I tried: I could tell where each instrument were located in the recording booth. The instruments and vocals are so true to life and don't compete. It's the kind of clarity where you confuse sounds you're listening to for sounds in the real world.<br /><br />The earbuds are extremely comfortable. I have wiggled my head violently and rode a bike with them in: they didn't even budge.<br /><br />I really enjoy the touch sensors on these. The left sensor activates passthrough mode so you can hear people. While the right is your playback options: 1 press to pause/play, 2 to skip, 3 to go back to the previous song. It's so much more intuitive and useful than any other earbud I have tried. JBL made the sensors small and precise, which helps with not accidentally registering a press when taking them out. The only downside is that I was missing the sensor for the first week, but I got accustomed to it.<br /><br />I bought these because I needed something to block out sound for my job. I work next to a motor that was making my ears ring hours after I clocked out. These earbuds block out the sound very well; any potential hearing damage is now gone thanks to these.<br /><br />These are absolutely amazing pieces of kit and I look forward to owning this for years to come!", "I use these to drown out my old lady snoring.  I use one at a time, and it’s lasting over 8 hours.  I Donny have to get up a change it out.  The only thing I wish I knew prior to purchase, was the noise canceling only works when you have both ear buds in.  Not that big of a deal.  Noise canceling works fine when using both.  I was going to buy the beats ear buds, but these were half price.  I’m sure the beats have better sound.  Very happy with the purchase", "My Apple AirPods battery life was diminishing after less than one year, much to my dismay. Figured I’d give the JBLs a try as a backup. The JBL Tune 130NC earbuds have better sound than the AirPods  at. Less than half the price. Noise cancellation seems comparable. Battery life after several weeks seems to exceed that of the AirPods at the same age.<br />Overall happy with the purchase. Only rated four stars because I’ve only been using them for less than one month.", "For $50 , I was a little hesitant about these . I was going to just buy the $25 ones with no lid , let me tell you , spend that extra $25 on these and you won’t regret it.  Amazing sound , plus with the app you can download, you can really make these things loud!! The eq customization is just phenomenal. For the $50 price tag, it’s just straight up robbery 😆. Even if I paid the full$100, I still would be very satisfied. Good job JBL!…..*EDIT* these are so great I just ordered me some more . For the price , even if I don’t use them , I can flip them for $100 when the sale is gone . I’m amazed at how outstanding these<br />Sound .", "They have great sound and noise cancelling. But.. they won't stay in my ears. Even the biggest rubber won't keep them in my ears. Don't think my ears holes are that big. I have e other sets of buds that do stay in but don't have NC or have charging problems. SMH.", "The battery life is great and so is the sound. The touch controls are terrible. They have no consistency. From the app, I have set the left button for Ambient Sound Control and the right bud for Playback control. This works OK when streaming and playing music. When streaming video, the touch controls behave differently. The touch controls only seem to control Ambient sounds on the right bud while the left bud controls do nothing. How was this not tested?", "Overall I think they are good earbuds. I like that I can customize somewhat the sound with the app (equalizer). The case is very slick and battery life lasts forever. However, they don’t stay on. I have to constantly readjust them because they start to fall out of my ears. If this is something that would bother you don’t buy them. I love JBL headphones because they have this multiple devices feature where I can use them in multiple devices (up to 2 or 3 depending on the model) without having to connect them again. However, these earbuds don’t have that feature. I’ll use them for a while and then get a different pair.", "First off get the app, without the app they are mediocre earbuds, with mediocre sound but with the app you can customize these things too your heart content down too what button presses do what on the earphones, noise canceling works great, batterys last at least 6-8 hours depending on volume, when you tune the equalizer they'll bump like some 12 inch subs in your ear, all around great ear buds for price point", "I didn't want to spend a lot of money on headphones. They work fine for walking the dog. I used them on the airplane and the sound is really low. Plus they're really bulky so my ears start to hurt. So I don't love them for airplanes. But they do the job. They're fine. Just wish not so bulky. They even have three sizes of ear pieces and even the smallest still feel really bulky.", "I am not an Acoustics Engineer but these ear buds sound great!<br />My 2/3-year-old earbuds died, I use them regularly and researched various brands, types, and quality levels. I settled on these because Amazon listed them as a “Limited Deal” at half their regular price, at $50 they are a real bargain!<br />This model has active noise reduction, true stereo sound reproduction, and a comfortable, secure fit.<br />I set them up and paired them with my iPhone 13 Pro Max 3 minutes after I opened the package and began listening. I downloaded the app and was able to customize the sound to my personal tastes, another feature that is appreciated and doesn't come with other brands in the same or similar price range.<br />I highly recommend this product!", "Great Great sound, depth, stereo separation. Somehow these stay in your ear while your blasting out some great  80s 90s alternative.  They go very loud, and the phone app is really awesome with many different equalizers you can set. Probably the Samsung expensive buds are not much better.  Excellent deep bass, great highs.", "When wearing these I need to constantly push them back in my ear. The sound is great if you jam them in your ear but the material or design make it so they never stay in for more than 10 mins without adjusting. Almost returned them first day when the sound was basically a whisper as I'm not used to putting earbuds that far into my ear. I don't know if it's the general design of the earbuds or the material but these sort of fail the basics of being an earbud which is simply \"goes in you ear, stays in your ear\". They come with three sizes and the big one is too big, the middle one wouldn't fit and small keeps falling out lol. Gonna return these and seek another brand.", "My daughter has a set of JBL's and likes them. I've tried them out and did  too so I ordered these for Christmas. Early self-gifting! Ho ho ho! They're my first pair of ear buds.<br /><br />The Good Stuff - they were easy to set up, I can use them with my phone and flat screen, as well as my laptop. The sound is great and they're fairly easy to pair. Once paired they connect to my iPhone as soon as I take them out of the case so use is easy and relatively trouble free. The case is simple to charge them in and the case is simple to charge up. I've had these for almost 2 weeks, and charged once so far, but they didn't need it, I just did it. There appears to be plenty of juice for how I expect to use them.<br /><br />The Pretty Good Stuff - they're not small but they do fit well in my ear. I might prefer a smaller device in the future but for my first set these are great and I won't change out till and when and if these stop working or I lose them, which I hope isn't any time soon so - they may be it for me, which is fine.<br /><br />The Learning Curve Stuff - the touch sensitive controls are okay for me, but I'm still getting comfortable with what does what when. I can always use my phone to pickup, adjust volume, etc. I'm probably another couple weeks out from being at ease using them. Others may not have any problem.<br /><br />I give them 5 stars because they appear to be exactly what they advertised and do what I wanted them to do. For the price they're a great value, for me.", "I have a decent pair of wired ear phones, but the sound is fuller with the JBLs that I'm experiencing better sound quality in my favorite music.", "I truly love the way these sound. They are fantastic. My only complaint is they lose the battery charger even if you don't use them.<br /><br />Definitely worth the money spent.", "I was very pleased with these earbuds at first, great sound, and excellent noise canceling for the price.  Flash forward to 3 months later the sound quality in the right ear stopped working.  I have tried to clean, tried to reset everything but still have the same thing happen.  The weird thing is that at first, it starts ok then progresses back to quiet.  In the end, I should have gone with something more pricey that may have better quality.  I may try one more thing if it works I will remove the review, until then consider this my full review.<br />*Update*<br />Was able to bring it back by soaking the tip of the earbud (without the cover) in alcohol for about 20 min, blowing into it directly after,  and letting it dry fully.  Don't dip the whole thing though. after 24 hours of letting it sit it was perfectly fine.", "The JBL earbuds I got are amazing. I was looking for a pair of airbuds for working out, with a great quality of sound. This product is very versatile in the sound settings, which let you customize the sound settings such as bass and treble. I’ve had issues with earbuds falling out while working out, but these baby’s stay in great! Overall amazing product!", "It is physically impossible to get the same effect as over the ear headphones but they sound very good. A bit petter than stock Apple ear buds but no wires. Download the JBL equalizer to pump the bass and the sound even better. Good control surface and the battery life is like they made a deal with the devil.", "Had these since September. Rarely used them except for some YouTube videos in the background while I clean or when I went fishing. In that short amount of time the right side is almost completely silent, even putting the balance all the way to right and there's barely any sound. Complete garbage. Apparently jbl isn't known for quality any more. Definitely recommend to stay away", "I am really disappointed because I want to give these 5 stars so badly. They sound amazing and the various noise cancelling features are fantastic. I also love how customizable the controls are. The problem is none of that matters because they won't stay in my ears. I've tried every size tips they came with, but they always fall out after just a few minutes of use. It's infuriating. I don't understand why more brands won't use the winged style tips because they are so comfortable and secure. I wish I could have the sound and features of these earbuds with the comfort of the bose sports.", "Was skeptical of ear buds, but they do not fall out. The ear oadding comes in 3 different sizes. The size that fis my ear was nice and snug. I was surprised at the quality of the sound. Has significant noise cancellation as well. I have a JBL soundbar/surround sound & the sound is exceptional.  JBL makes very good sound quality items.", "Great sound on my daily walks.", "I wanted to like these, the sound and battery life were really good, calls were okay as well.  However they would fall out of my ears every 5 minutes no matter which size earpiece insert I used.  I swapped these for the JBL230NC instead and they do not come out on their own and performance is similar to the 130NC.", "Sound was very good.  Connected to the JBL APP allowed the ability to customize sound and... left or right earbud controls.  Just overall they are too complicated to enjoy all the features or understand them. Needs more in depth explanation of other features. Assumes we all now the tech talk.  Headphones though are great for times of listening to music. Really great for me. I might try to answer the phone from time to time. But other than music... I don't find use for the other features.  My brand new Qled TV could not find them for pairing. I will probably keep them.", "I enjoyed the sound on these enough, but I couldn’t handle the design. They’re so uncomfortable and take forever to adjust. I really don’t get the design.<br /><br />Worse is the audio quality on calls. People hear me okay, but they just are not loud enough to hear whoever is on the other end. I checked to make sure everything was set correctly in the app and played with it a bit, but it was difficult to make out what people were saying and was so low at max volume that I could hear sounds in my home or out and about more than what the buds were putting out<br /><br />Sent them back within a couple days. I’ll just pay a premium and get a set I know will work well for music, video and calls.", "I tried these because they were noise-cancelling and on sale and I’ve always loved JBL. The sound was fine but no matter what I did, they fell out of my ear. I tried all three sizes and even had a friend help me place them in my ear to no avail. If I had them in and started chewing or Bent down, they would fall right out.<br />I believe this is because of the design. They seem top heavy.<br />The other thing is the options are limited as far as controls. You had an either or choice for audio. Also, if I had more than one app open, my play/pause would not work.<br />I finally decided on another much less expensive brand and got MUCH more for my buck and they STAY comfortably IN my ear and have all the controls I need.<br />I’ve bought JBL in the past and love my speakers but these were a big let down. I do not recommend.", "Got these to tune out coco melon and toddler tunes. Great sound and they stay put!", "For $50 these are awesome. Battery life is super long sound is really clear and never had noise cancelling before and it's very nice. Bought a second pair for less than a single set of other brands.", "When I first tried these earbuds, I was completely underwhelmed...  But then I downloaded the accompany app that actually utilizes their special features and functionally. (The app is free, and seems to be add free.).  Now, I'm considering super gluing the earbuds to my ears.  (Don't do that, I'm just saying the sound is awesome!)", "Very tiny to hold. Good quality sound. Battery life could be increased. I use these daily. 4 hrs continuous play from xm radio.", "Only a week (6hrs) of use but I thought I would provide a report. Plenty of battery left; sound is excellent; price is right; Bluetooth sync worked well.", "The good sound of jbl I used to know and the noise canceling works well too.  Really good price. Comfortable to wear.  very satisfied.  Much more satisfying than the very expensive and breakable Bose.  what more do i want?", "While these ear buds have a great sound they don’t stay in my ears real well, they do come with different size ear plugs but the whole ear piece is so big! So all in all not real happy with them!", "I like JBL as a brand, and they do get it right most of the time with their products. In terms of earbuds, I have the Tune 115 and these buds have proven to be a solid product. The Tune 115 has survived some series of falls and water submerging without even having an IPX rating. I have seen the 130NC  on sale and had to pull the trigger. IMHO The 130s buds are a great value for sure. Pretty good noise canceling with a solid bass presence. Understandably, they are not as loud and bass saturated as my Sony WF-XB700(which has bigger-sized buds). However, these JBLs have other features such as ambiance mode, good touch controls( and I am someone who prefers button controls), and of course: a decent ANC.  The sound is clear and well-balanced, as expected from JBL. I like the app a lot btw..very easy to control and customize an EQ. The fit is so-so sometimes, but that could be solved with non-JBL ear tips. The supplied ear tips are good, but the size jumps a little between the small and the large tips... This minor issue does not warrant a one-star fewer IMHO-Especially for the sale price. You get SO MUCH more than what you pay for..", "I purchased my JBLTUNE130 earbuds on Black Friday for half the price and for the price they are not bad at all. Instead of the buttons, they are touch sensitive and may be annoying if you use your earbuds to sleep, constantly wear hoods, or workout with these and sweat a lot. From reading other reviews, there are only three different sizes for your ears and it is hit or miss if they will fit yours because of so many unique ear shapes. If you travel in loud areas, the sound is not too loud to overcome musicians on the streets or the hustle and bustle of catching the train everyday but want the balance of quality and price, these are it.", "Good sound and good app you can download to make adjustments for sound settings.", "I was thinking of rating this 4 or 5 stars but tilt more towards 5 since it's a very solid product. The sound is excellent, the microphone is better than any other I've had in terms or noise canceling since I get less complaints when I'm doing noise on it. My only real complaint is that the earbud falls off a little too easily sometimes and it's a shame because that might be a deal breaker for people that might want to do more physical activities. Overall I'm satisfied with the product.", "Great sound. The sound quality is amazing an the JBL app is great.", "Really like these for the most part. I have auper small ears and somwtimes they dont stay in as well as i was hopeing. But when they stay in the sound is wonderful. Never have any issues with bluetooth connection like others i had in the past. Me and the hubby both have a set.", "I'm very pleased with this item. Great battery life and superb sound.", "The sound is decent but they just fall out if I look down or remotely downward", "These are mediocre headphones. decent sound when nothing loud is around you. The noise cancellation is not very strong. I invested a bit of money and got the Bose ANC, wow! they are amazing.", "Good clear sound", "So far the head phone are comfortable and the sound is great. The noise cancellation really works", "Bought these because of the reviews on their sound and the 10 continuous hours of playtime with 2 hour charge time. They perform as advertised! I used them on an 8 hour flight with no problem. Very good sound quality. Good noise cancellation. Can’t beat them at this price.", "The sound is very good", "These have outstanding sound, unfortunately once I started moving they would fallout of my ears.  I tried all 3 sizes of the supplied eartips and none of them would hold securely in my ear.  Within 3 minutes of walking I had to stop and try to secure these, and nothing is worth that trouble.  The case is also slippery as can be, it's smooth plastic that affords nothing gripwise, between trying to use the case and keeping the buds in my ear I now know what a juggler's job is like.  Looks like I'll stay with the old fashioned wired earbuds.", "I had the white version of these headphones but they flushed down the school toilet. I bought these about a week ago they car fast but the sound was super low", "pretty self explanatory; they're comfortable, sound is amazing, different size buds. i bought myself a 2nd back up pair.", "The sound is clear, all the features my 17 year old son loved.", "Me and my girlfriend share these. I use them all day for a few days at a time and the battery never fails me. The sound…10/10 I am in love!!! Definitely recommend these to everyone!", "The sound is good although it tends to disconnect on its own after a while. Noise cancellation is pretty decent.", "They work well, my son never hears me! The sound is solid and clear. Amazing bass!", "Got it at half price. Amazing sound for the price. Bass is there no question and for earbuds there is really really good seperation of sound. Its not easy to find in this price range. Get it NOW.", "Well worth the money,great sound,long battery life,overall am very pleased woth these buds", "The sound and battery life are good. I have apple stuff, so Bluetooth switching not the best. Maybe be it’s the shape of my ears, but they don’t stay in well.  Guess I’ll have to order another set of AirPod pros. Shame though bc these are a very good price for the sound they deliver. I’ve tried all three sizes they come with.  I might try using the foam tips that came with my Sony pods on these.", "I bought 3 of these. The sound is AMAZING! In my opinion they’re better then apple AirPods. If I had the money I’d purchase a bigger Bluetooth one for my home. The bass is great, it’s easy to answer calls with them. They’re compact and fit comfortably in my ears and typically I can’t stand earbuds. I love these. I got myself these and both my boys. My kids are in their teens and they LOVED them as well. The price was great!", "I enjoy the product for its sound quality in general.  It does provide adequate high and low end sound and a decent noise cancelling feature.  I am disappointed with the reliability of the battery life.  I have had one of the ear pods fail after charging the device.  Frustration is not what anyone wants with a product.", "Great sound, easy to set up! My favorite thing about these is the noise cancelling white noise!", "Holds a decent charge and like the clear sound", "I love these very much, the battery life is amazing, my old ones barely lasted 4 hours, these last over 9 hours, and the quality is also amazing...fit well, they don't hurt your ears, and the sound is outstanding..highly recommend these..", "Great sound and comfort. This is my third JBL purchase, and would gladly purchase again.", "No matter what I did even change the cushions they still fell out of my ears , sound was good I had to return them", "Wonderful, great sound. Battery life it's amazing. I would buy it again 10 times", "Fit well in small ears.  Great sound.", "I am very happy with my JBL earbuds, downloaded the app for sound. Noise cancelling, 5 stars", "This is my first Amazon review. I bought these to replace my Galaxy Buds Plus. Much better sound so far. I'll see how battery is soon, but sound is much better. Much more bass. I will say that the app isn't very intuitive.", "They are ok.. they fall out from time to time. Good sound tho for those looking for club sound inside their ear.. 3out if 5 stars only because they will fall out while working out. But far for 1st time buyers", "Sound good, could use a little more bass but other than that are nice headphones and sound is clear. fit and are comfortable too", "Easy to link with phone and great sound. Battery life is good and range is also good", "I'm trying to use these buds with Google's Pixel 6. And it's bad. It's really bad. The buds can't keep the connection and disconnect and reconnect multiple times. Which is really irritating.<br />I'm not saying these particular buds are bad. Google was newer interested to fix its everbroken Bluetooth part of android.<br />And when the buds do connect the sound is good.", "This JBLs sound as good or better than the expensive AirPods, I have them both (AirPods and JBLs) and side by side, the quality wise, they are super great! AirPods no more needed! Stop buying them!", "Purchased for someone else.  She says “they’re a bit of a pain to use for the Bluetooth function.”  I listened to them, and thought they had a nice sound with strong bass.", "I really enjoy these earbuds they have great sound", "I have been a long time JBL customer. I find their products decently priced, easy to use, and sound quality is usually good. These earbuds are very comfy and light. I can wear them for hours with zero pain. With that said, they don’t feel secure right away. Took some getting used to. The default sound is alright but these link to the JBL app and you can alter the eq to your liking which I love. For the price and performance I definitely recommend. Especially if you wear earbuds for long periods of time. I will say the noise cancel feature isn't great. If you are buying specifically for that feature, I’d skip these.", "The headphones are good overall when playing music but when taking a call the sound is quite and kind of muffled.", "Item easy to pair, easy to manage and has a great sound. Would definitely recommend this.", "The quality of the sound itself is good and battery lasts a really long time but they aren’t loud at all. I have to have the volume up almost all the way to really hear. I’ve gotten better quality headphones for cheaper. The TOZO ones are my favorite.", "These have great sound and good bass. The noise cancelling feature works pretty well. I use them at work", "Nice a high quality sound for their price. Not the best Noise cancelling system", "The sound and controls are good as they are through the app, but I have small ears and they fell out of my ears too much, so I returned and got a different type of JBL Earbuds.", "Great sound and excellent price!", "The quality is great, sound is good too, but it falls very easily from the ear, and it gets annoying all the time since it will not stick in place, and you just want to stomp it out of frustration. It has a great battery life for what it is worth, WAY easier to use compared to the ones I bought from earfun. You can also program some stuff through an app, I would still recommend these even if it gets frustrating when they keep falling off", "Amazing bass perfectly clear sound and the battery last forever", "The sound is great but they won't stay in the ear no matter what position they are in.", "First thing when they connect tht sudden feeling of the noise cancellation is just crazy ...then to when you turn the music up ...u feel so engulfed by the sound and that tru bass is immediately felt...if you looking for loud no ...but if you looking for balanced amazing sound this is it", "Nice price point 49$<br />Decent sound . Nice bass.<br /><br />App has a custom eq.<br /><br />Noise cancelling is very subtle.  Sometimes it sounds like i have nc off when its on.", "I got these for 50 percent off and what a steal. They cancel out a ton unless the occasional gym bro is shouting across the gym. Download the app to customize the sound. I made mine bass heavy and it sounds great. Only downside is that these fall out of my ears sometimes while I'm lifting heavy.", "Won't stay in ur ears. Keeps falling. Even change to rubber Pic to smaller size but it changes the sound. Other then they have good sound and good app to work them."], "reference": [118, 44, 39, 25, 24, 22, 19, 19, 13, 12, 11, 8, 6, 6, 5, 4, 4, 4, 3, 3, 3, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.10000000149011612, 0.699999988079071, 0.3333333383003871, 0.36666667461395264, -0.30000001192092896, -0.10000000149011612, 0.699999988079071, 0.29999999329447746, 0.4000000059604645, 0.4000000059604645, 0.800000011920929, 0.699999988079071, 0.8999999761581421, 0.699999988079071, 0.20000000298023224, 0.30000001192092896, 0.4000000059604645, 0.800000011920929, 0.20000000298023224, 0.800000011920929, 0.20000000298023224, 0.800000011920929, 0.8999999761581421, 0.6000000238418579, 0.5, 0.10000000149011612, 0.20000000298023224, 0.6500000059604645, 0.800000011920929, 0.800000011920929, 0.10000000149011612, 0.20000000298023224, 0.10000000149011612, 0.8999999761581421, 0.800000011920929, 0.699999988079071, 0.800000011920929, 0.800000011920929, 0.800000011920929, 0.699999988079071, 0.8999999761581421, 0.30000001192092896, 0.699999988079071, 0.800000011920929, 0.8999999761581421, 0.4000000059604645, 0.8999999761581421, 0.4000000059604645, 0.6000000238418579, 0.8999999761581421, 0.8999999761581421, 0.10000000149011612, 0.8999999761581421, 0.10000000149011612, 0.10000000149011612, 0.8999999761581421, 0.800000011920929, 0.8999999761581421, 0.10000000149011612, 0.699999988079071, 0.800000011920929, 0.8999999761581421, 0.20000000298023224, 0.8999999761581421, 0.699999988079071, 0.8999999761581421, 0.6000000238418579, 0.8999999761581421, 0.8999999761581421, 0.4000000059604645, 0.8999999761581421, 0.8999999761581421, 0.800000011920929, 0.5, 0.30000001192092896, 0.6000000238418579, 0.8999999761581421, 0.20000000298023224, 0.699999988079071, 0.20000000298023224, 0.8999999761581421, 0.5, 0.30000001192092896, 0.8999999761581421, 0.6000000238418579, 0.800000011920929, 0.800000011920929, 0.10000000149011612, 0.8999999761581421, 0.30000001192092896, 0.8999999761581421, 0.20000000298023224, 0.2500000074505806, 0.6000000238418579, 0.20000000298023224, 0.20000000298023224]}