{"reviews": ["To the engineers who designed these. It's a lovely product, and the battery life is outstanding. The design looks and feels like a very high quality product.<br /><br />But we cannot keep doing this: The highs are way too high. The sound is way too high, the sound is metallic, and shrill.  These take harshness to level 100.<br /><br />THESE WILL CAUSE HEARING LOSS TO ANYONE USING THEM DUE TO THE UNNATURAL EXTREMELY HARSH HIGH PITCHED SOUND. They sound like metal plates slamming together.<br /><br />I implore you to please find a better speaker material. I would say more, but you already know what you've done, and you know exactly how to fix it.<br /><br />Not trying to be unappreciative.<br /><br />You've made a beautiful product. I just wish the sound was reasonable natural and neutral.<br /><br />Sincerely,<br /><br />Charles", "I've been giving these a shot for the last 2 months they don't have a stable connection with my phone galaxy s21 the sound comes in and out on phone calls and while listening to music.", "They sound good but after a few months they have lost sound. I can hardly hear anything out of the right bud and the left randomly looses sound. Now after 5 months they are dead and have no sound coming from ether side", "I’ve had a number of JBL products in the past that where great, these headphones are not. I am disappointed in the quality of sound. Even when you download the app to adjust the sound it is poor. I bought these as a backup set for my Bose earbuds and to replace the off brand earbuds originally had. These earbuds are on par with the off brand set, except the JBL do have noise canceling. But the sound quality is not even close to the Bose. They also are difficult to set in your ears and do not stay well. I would not purchase these earbuds again.", "Honestly i didnt like much about these.. they seem cheaply made. They constantly fall out of my  ears. I couldn’t get the app to recognize the earbuds to change the sound. I returned them! They suck", "The manual is crap, printed in low contrast font, too small for a human to read.  The earbuds won't fit regardless of which of the three ear pieces I use.  The ANC doesn't work.  The sound drops out intermittently.  And, most importantly, the manual sucks.", "Zero sound on right earbud after day 3 of use<br />Very disappointed", "I own two JBL Bluetooth speakers and love them I think they have great sound quality.<br />So I was disappointed when these sound like any off-brand generic headphones out there.<br />they also want you to download and use an app to take advantage of all of their options and that's just a huge negative for me it does improve the sound quality after tweaking it in some, but not enough to justify using the software that is more an advertisement to sell you stuff than an improvement on the product. I want a quality product right out of the box with No apps!<br /><br />The battery life and functions are good they sound best on a call and I've been told I sound amazing like I'm standing in the room with whom I'm talking with, so kept them for that reason.<br />but these were a replacement for a pair of sony headphones that went missing. and now I need a replacement for this subpar set for music quality and volume.", "Ear pieces don't fit well they fall out I have tried all three sizes none stay in my ear well, and the sound quality is ok, but there is a lag between video and sound. everytime I put it in my ear it automatically goes to transparency mode  so I have to go into app to turn it off", "I've bought and been happy with JBL products before. But these do not meet the same quality standards. The sound is constantly cutting out making me miss parts of conversations, while the microphone barely works and I have to keep repeating myself.", "I have been looking for a set of buds to use while not having to worry about them falling out for to sweat or any physical activity...these are pretty spot on, with the exception that the sound is not as great as expected and as others have given them credit for. Honestly, I've had cheaper ear bud sets that have had better sound but the comfort of them hasn't satisfied me. My volume had to be just at it's max for me to clearly listen or hear the music or podcasts I listen to. The same volume on my cheaper set is about half to get the same. I assigned 3 stars because of comfort and lack of sound.", "Awful sound and I tried many devices. Won't stay in, tried the various cup sizes. I had an older pair of JBL in-ear headphones that were awesome in sound and stayed in so I don't understand how these could be *sooo* much worse. I ensured they are not in \"headset mode\" for music and played with the JBL app config as well - no luck. The only positive is they seem to work good in headset mode as other people say the mic is clear and ANC removes background noise.", "No matter which cushion I used, the earbuds kept falling out.  The sound isn't the best quality & the noise cancelation is minimal. WILL NOT BE PURCHASING AGAIN.", "TLDR; bad sound, bad ear fit, bad charge.<br /><br />I bought these at Target, and they’ve been one of the worst headsets yet. They don’t stay in my ears very well. They don’t noise cancellation very well, they don’t produce much sound, and worst of all when I pull them out of the case they’re almost always dead for some reason.<br /><br />These also come with an app to operate the headphones and adjust sound levels but that’s pointless because I had to change the levels to max settings in order to hear anything normally.<br /><br />They do have some tap options that let you switch from music to hear voices it was kinda nice.<br /><br />But overall these are bad design and bad sound. I can not recommend these and advise looking else where. Which is weird since JBL usually has excellent products. I have nothing against JBL I bought the Charge 5 and that’s a great portable jukebox.", "The sound on these was sufficient.<br />But they would not stay securely in my ears.<br />Very disappointing.<br />Window for return has passed, so I can not get my money back.", "These will not stay in your ears, regardless of which size earbuds you use. It loses connection if you are more than 10 feet from the bluetooth source. And the sound is very tinny. I'm returning mine.", "The sound on this is very tinny, even when I've played around with the EQ quite a bit.<br />The base is almost non-existent.<br />I've turned the noise cancelling on and off and can't really tell any difference", "Let’s start with fit. Maybe it’s my ears but they absolutely refuse to stay on my ears. I’ve tried all three sizes and they are either too big or too small. So just given that they are pretty much useless if you plan on any activity where your head might move.<br /><br />As far as the sound, it’s really not great. Sure there are different settings but overall the quality was far below the AirPods I used to use.<br /><br />Lesson learned, pay the extra for AirPods. These are not worth the price or aggravation.", "Sound is too flat. Needs more full sound.", "I bought these to replace a lost Tozo set. The controls suck in comparison and they let more noise in.<br /><br />If you have no case, you can't easily power these off with any touch button.<br />If you have no case, pairing after losing connection sucks. Following the instructions for manual pairing doesn't work most of the time, so a total reset it needed.<br /><br />Also, these are very easy to accidentally switch around between ears, which then reverses the controls.<br /><br />Worst, the biggest size still lets ton of sound come through. I use these on planes and the workshop, and they fell short.<br /><br />Going back to Tozo, which had none of these issues.", "Worked good for 2 months now they cut in an out sound is fuzzy. DON'T WASTE YOUR MONEY!!", "Not bad for the price noise cancellation does not work but as for sound and battery life I liked them always lose my air pods so I wanted to get something cheaper good buy!", "I don't like it fell of and the sound it's not worth for the price"], "reference": [3, 3, 2, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [-0.1999999980131785, -0.5, -0.15000000596046448, -0.699999988079071, -0.10000000149011612, -0.10000000149011612, -0.20000000298023224, -0.10000000149011612, -0.4000000059604645, -0.5, -0.16666666666666666, -0.20000000298023224, -0.6000000238418579, -0.23333333432674408, -0.6000000238418579, -0.4000000059604645, -0.30000001192092896, -0.4000000059604645, -0.20000000298023224, -0.20000000298023224, -0.30000001192092896, -0.30000001192092896, -0.5]}