{"reviews": ["These connected with ease to my phone. The sound quality is great. They stay charge just as long as my name brand head phones. I would definitely buy these again.", "Bought them for my hubby for work. He absolutely loves them. They work great and fit great in his ears. Very comfortable. The sound is good. Very easy to pair to your phone. They come in a light weighted case it's very fancy.", "These are weird at first since they sit over the ear more than go in. But once you get used to it, it's nice. I wore these as I cleaned my car out and they didn't disconnect or anything. Aldo the battery life is better than a phone in my opinion.", "I got these for my husband who loves to watch videos on his phone. The sound is great, and the charging case that comes with it is awesome. The battery last a while and he likes the way they fit into his ear. He could not be more happy with these. Definitely a great buy!", "I like the fact that these don’t have to sit in my ear but rather around my ear.  I forget that they are even on until it starts beeping that they are about to go dead. They are lightweight and don’t make my ears hurt after wearing them for long periods of time. They were really easy to connect to my phone. Once connected you don’t have to keep connecting with every use. They also don’t take long to charge. I use once side at a time to allow me to not have to charge as often. Good thing is you don’t have to switch out ear sizes either. AND they won’t break the bank as far as cost. Good purchase. Will recommend.", "These things are great amazing sound quality and very comfortable connected to my phone easy.  fit great with out going in my ears very high quality would definitely recommend", "Arrived nicely packaged and recharged! Sounds is great and last for hours!! Mic works great for answering phone and they were very easy to pair to phone!", "I like these a lot! The sound works amazing and so easy to pair with your phone!! Everyone can hear me talk alsooo.", "Got these delivered today and they are absolutely perfect! I love that they don't actually go in your ears and sit right outside so I'm not uncomfortable or anything. The sound quality is great. It's loud but it doesn't crajke while it's loud. It connected super easy to my phone and the sound quality for calls is great. I was able to fall my mom and she could hear me clearly and I could hear her. Honestly, some of the best earbuds I've had so far and I've only used them for about 5 hours today! I'm already sold on them and might even buy my husband a pair now!", "These headphones are better than expected. It's hard to find good earbuds that don't actually go into your ear. The sounds is great and it has alot of features where you don't physically need your phone to play/pause or skip a song. They seem pretty sturdy I like that the case charges the headphones automatically."], "reference": [0, 0, 0, 0, 0, 0, 0, 0, 0,0], "score": [0.6000000238418579, 0.699999988079071, 0.5, 0.10000000149011612, 0.5, 0.800000011920929, 0.5, 0.8999999761581421, 0.800000011920929, 0.699999988079071]}