{"reviews": ["My husband loves these.He doesn't like ear bugs that go in his ear at all.So these are perfect.There's no chords , they charge fast and last a long time", "We love these! Very comfortable and work great for those of us who don't want to stick the airbud inside our ear! Sound is fantastic, charges fast and even has a cool looking case. Very satisfied with them.", "These are comfortable headphones, they hover just outside of your ear and do not go in which is very comfortable as I have sensitive ears. The sound is clear in the controls are easy to operate. There is a manual to help you learn the controls very easily. Definitely worth the money. Just as a no the color I ordered was black even though the color on the outside of the box with the cream color. So don't be fooled by the outside of the box. It's a great buy and these are my lounge headphones", "These sound great and are very comfortable since they don't fit in your ear but just on the outside.  Sound quality is great from mid, highs and lows.  Also love the case that comes with it.", "I purchased these with no expectations but was pleasantly surprised. Very lightweight and comfortable. First pair of ear buds that I’ve bought without something going in my ear and I love it! Sound quality on point and good battery life.", "To not b deep in the ear canal, these things are really impressive. They fit comfortably over the ear. I wasn't sure I was gone like but it's fine. They are light weight. They wound loud & clear for all types of music & calls. They are easy to operate & store weel in their charging case. I will b getting another pair bc they are safe for work.", "I got these for my husband who loves to watch videos on his phone. The sound is great, and the charging case that comes with it is awesome. The battery last a while and he likes the way they fit into his ear. He could not be more happy with these. Definitely a great buy!", "I like the fact that these don’t have to sit in my ear but rather around my ear.  I forget that they are even on until it starts beeping that they are about to go dead. They are lightweight and don’t make my ears hurt after wearing them for long periods of time. They were really easy to connect to my phone. Once connected you don’t have to keep connecting with every use. They also don’t take long to charge. I use once side at a time to allow me to not have to charge as often. Good thing is you don’t have to switch out ear sizes either. AND they won’t break the bank as far as cost. Good purchase. Will recommend.", "I don’t prefer the ones that sit in your ear. These are an excellent alternative and the sound quality great and as good if not better.  They fit easily and comfortably on your ear. Charged up super quick and lasted for hours. So comfortable you forget you’re wearing them. I used to do yard work and gardening.", "So I’ve had a couple sets of open ear buds. They have for the most part done well. These ones are a little different. They fit more secure to my ear and put sound directly into the canal. The bass is good, the sound is great. I’m quite pleased.", "I’m not a fan of earphones around my ear but these are cool and lightweight. Easy to pair nice sound quality. Fast charge last about a few hours before needing to be charged again over all cool earbuds .", "One of my gripes sometimes with earphones that are not in-ear is that they don't give you the same quality of sound and the same experience. However, in-ear earphones don't work for me. Constantly falling out, hurting my ear, etc. These are a welcome change. The hook around the ear ensures they are stable and won't fall out (I have tested this by shaking my head like a crazy person). I do have smaller ears than most people so I was very skeptical that the other part would fit, but it does. I do have a little discomfort but I think that will change as I get used to them. Overall, I recommend these."], "reference": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.6000000238418579, 0.699999988079071, 0.5, 0.6000000238418579, 0.6000000238418579, 0.20000000298023224, 0.4000000059604645, 0.5, 0.20000000298023224, 0.10000000149011612, 0.30000001192092896, -0.20000001043081284]}