{"reviews": ["These look and sound much better than I expected. They have a very expensive look and are easily charged and connected to Bluetooth.  They fit comfortably in my ears and the sound is similar to my more expensive ear buds. Would recommend these to anyone.", "Very light and comfortable, good sound, hold battery very long. Perfect fit.", "This product is great. It provides solid sound even though it does not enter the ear canal. If you have sensitive ears this is the product for you. It charges well and provides great range. It has great stability and fits my ears wonderfully.", "These are comfortable headphones, they hover just outside of your ear and do not go in which is very comfortable as I have sensitive ears. The sound is clear in the controls are easy to operate. There is a manual to help you learn the controls very easily. Definitely worth the money. Just as a no the color I ordered was black even though the color on the outside of the box with the cream color. So don't be fooled by the outside of the box. It's a great buy and these are my lounge headphones", "I like these very much! I have a nice sound, they don't just out of my ears. Once you blue tooth these to a device they automatically connect just by pulling them out of the case. I also like how the case that they sit in are magnetic so they simply cling to the case as you go to put them in!", "The comfort and sound of these earbuds are amazing! Very easy to operate. Case isn't overly bulky, fits right into your pocket! Highly recommend if your ears are sensitive, sounds doesn't go directly into your ear canal.", "Bought them for my hubby for work. He absolutely loves them. They work great and fit great in his ears. Very comfortable. The sound is good. Very easy to pair to your phone. They come in a light weighted case it's very fancy.", "These were nice especially for the price. They were comfy and the sound was nice.", "I got these for my husband who loves to watch videos on his phone. The sound is great, and the charging case that comes with it is awesome. The battery last a while and he likes the way they fit into his ear. He could not be more happy with these. Definitely a great buy!", "These headphones are very comfortable, has good quality sound, but I thought that when I played my music, nobody would be able to hear it. Apparently, since it doesn’t go into your ears, there is some exterior noise that could be heard by others. So don’t use it for a private conversation on a phone. The inside of your ears will not be sore.", "Open Ear Headphones, Bluetooth Ear Buds 5.3 Wireless Earbuds with LED Digital . Great quality , great sound, great quality", "These are awesome easy to use and charges fast comfortable for my ears there not heavy sound is awesome fits well very pleased and love the travel case", "Great sound ! Comfortable to wear . Great price for what your getting. Highly recommend!", "I like these a lot! The sound works amazing and so easy to pair with your phone!! Everyone can hear me talk alsooo.", "So I’ve had a couple sets of open ear buds. They have for the most part done well. These ones are a little different. They fit more secure to my ear and put sound directly into the canal. The bass is good, the sound is great. I’m quite pleased.", "Very great quality! The sound is amazing.  Very comfortable and strong battery life.", "The sound out of these ear buds is amazing! So clear. Easy to use. Love them." ,"One of my gripes sometimes with earphones that are not in-ear is that they don't give you the same quality of sound and the same experience. However, in-ear earphones don't work for me. Constantly falling out, hurting my ear, etc. These are a welcome change. The hook around the ear ensures they are stable and won't fall out (I have tested this by shaking my head like a crazy person). I do have smaller ears than most people so I was very skeptical that the other part would fit, but it does. I do have a little discomfort but I think that will change as I get used to them. Overall, I recommend these."], "reference": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,0], "score": [0.30000001192092896, 0.800000011920929, 0.30000001192092896, 0.699999988079071, 0.5, 0.8999999761581421, 0.800000011920929, 0.800000011920929, 0.800000011920929, 0.4000000059604645, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.8999999761581421, 0.45000000670552254, 0.8999999761581421, 0.800000011920929,-0.20000000298023224]}