{"reviews": ["The WANTERONG Hand Held Vacuum Cleaner Cordless : Portable Handheld Vacuum Rechargeable Small Car Vacuum with 120W High Power, Mini Hand Vacuuming for Home Car Carpet Pet Hair:<br /><br />  This is a medium build quality handheld vacuum. It is made fully of ABS plastic, of a roughly medium density. It’s not quite as heavy duty as big named brands, but has great suction and works really well. and is less than half the price. It also comes with several really handy attachments. If you need an inexpensive handheld vacuum, this is a good one to consider. Really fair price for the power you get. I don’t think it will take a fall from any great height, but it does a good job for not allot of money. It has sucked up everything we have needed it too so far. For us it’s allot of cat hair and cleaning up around the litter box, and it has no problem with either. The filter is washable which is a nice touch. I like this for the money.", "Wanted this vacuum to use in my car.  After putting any on the attachments on it had absolutely no suction.  I plan to return!", "This vacuum is lightweight, and east to move around to your car or if you want to vacuum anything at home. I mostly use it on my car. I like that it is portable and you don't need to connect anything to your car outlet. I just charge this at home , and it lasts me like about 30 min. I is very powerful , so picks up everything. I also like that it has no bag. Just empty the dusk cup and good to go. Overall good product for the money!!", "I have a 2 and 5 years old kids at home. I really like this Vacuum because I can just grab it and go clean up the mess they make. I dont have to drag a cord along side me. This vacuum really picks it up great!!", "The vacuum arrived on time and the box was in good condition.<br /><br />I used the vacuum on my vehicle and experienced the following:<br />1. The vacuum has difficulty with small pebbles/other debris you would track into your car<br />2. The brush attachment was fair at picking up pet hair, but it mainly was caught in the brush attachment and not pulled into the canister.<br />3. The extension hose adapter didn't fit in the end of the canister, allowing it to fall out and made using the crevice tool a bit unwieldy.<br /><br />I would suggest the manufacturer also include a small tool bag so the vacuum and attachments can be easily stored in your car/home.<br /><br />Pros:<br />1. The USB charger makes it easy to charge just about anywhere.  You will need to supply your own wall adapter, the vacuum comes with it's special charging cord.<br />2. I discovered the vacuum comes in very handy for small clean-up situations around the house. It's quick and easy to set up, and with pets in the home it's great at picking up animal hair off of hard floors or surfaces.<br />3. The filter is very easy to clean. I like the metal cover, which allows you to tap to clean without worrying if you'll damage the filter media.<br />4. The vacuum seems to hold a charge for a long time, has a good run time with a full charge and recharges fairly quickly.<br /><br />Cons:<br />1. The suction is on the weak side, and the vacuum head attachment has limited areas to allow dirt/debris to be pulled into the canister.<br />2. When removing attachments, hold the canister, NOT the vacuum body.  The canister has a twist/lock feature, and you can easily pull the canister off when removing an attachment.<br />3. No storage bag to keep tools/vacuum together whether storing at home or in your car.<br />4. The flap inside the canister that is supposed to keep dirt/debris in can get dislodged if you put the hose attachment in too far. It's held in place by a tab through a slot in the flap. A simple dab of glue would prevent a lot of dislodged flaps.<br />5. Hose adapter was too large to fit in canister opening. This rendered the extension hose pretty much useless.<br />6. No tool bag to hold vacuum and accessories for easy storage.<br /><br />I would compare ratings and performance with other similar handheld vacuums before getting again.", "This is perfect for in the car or cleaning up small messes ha you don’t want to drag out the big vacuum for. The auction is good, and it comes with all kinds of attachments for different kinds of messes. It’s easy to empty and charge also.", "I needed a light and portable vacuum to clean my car and this one did an ok job. The suction power isn't overly powerful and I had to go back and forth a few times to pick up all the debris. The battery life is also good if you don't have to vacuum for too long. The vacuum in general is comfortable to grip and it is easy to use.", "I ordered this little vacuum specifically for cleaning our cars, which it works great! It has a lot of attachments and the charge lasts longer than our stick vacuums (which actually did pretty well themselves).<br /><br />I have carpeted stairs in my current home, which are not fun to clean, but it's much easier using this vacuum than the stick vacuum.<br /><br />I think the price point is about right for this vacuum and it's done a great job so far.", "refillable equipped with 3 different nozzle shapes to meet usage, product well received, easy to use, has a strong suction power of 10,000pa and rated input power of 120W, which can quickly and thoroughly clean dust, pet hair, and dirt, has a sophisticated design and enhanced stainless steel double filter, light and portable, only 1.1 pounds, and it won't feel tired even if held for a long time, long working time 18-30 minutes continuously, and can be fully charged in 3.5 hours, low noise ≤60dB, I have nothing negative to say about this vacuum, no there are regrets.", "The pros of this hand-held vac are its strong suction and a useful assortment of accessories. It’s user friendly; easy to empty and clean the basket; and light weight. It worked very well for picking up a good number of paper fragments from a paper shredder which I accidentally spilled onto the carpet in my office. It did a fine job for various small projects such as picking up crumbs, dust, and wood shavings as a result of drilling some holes.<br /><br />However, there are some cons. It is constructed using what feels like a thinner plastic, so it can feel a bit fragile even if it is made well enough to hold up to frequent use. For charging, it uses a special USB cable with a barrel connector for the vacuum side of the cable rather than using a USB connector for the vacuum side. There is no charge indicator on the vacuum that indicates when it is charged. Instead, the USB Type A side of the charging cable is encased in a small housing that contains an LED that glows RED when it needs a charge and changes to GREEN when fully charged. You are locked into using the cable that comes with the vacuum to check the charge status and to indicate its charged state. For me this is a major inconvenience and a poor design.<br /><br />The suction part of the vacuum works well but the electrical design for charging is old school. Evaluating this reasonably priced vacuum for its suction capability - its intended purpose - and the included useful accessories I’m giving it 4-stars. I will update should my rating change.", "Why on this green Earth did I wait so long to get one of these?!?! I’ve known for years that one would be useful. I just never imagined HOW useful.<br /><br />It cleaned my baseboards, by heat register grill, a rice flour spill, and sugar. Sugar, people.<br /><br />It got cobwebs and crevices in my couch. It worked wonders on my drapes! It cleaned the carpets in my car! The attachments all work! I LOVE this vacuum!<br /><br />Add to that emptying thi bagless vac couldn’t be easier, or more mess free.<br /><br />Bottom line: looking for a handheld vacuum for your car? Buy this. Looking for a vacuum for your home? Buy another one! Buy one for every level! You will use this much, much more than you think you will. Highly, highly recommended!", "Compact - will be easy to store.  The suction is good especially for a small handheld vacuum !  Washable filter is a big plus !  I poured about 1/4 cup of water on hardwood floor - it picked it up - floor needed a paper towel swipe bc it was still damp.  Again, I think that’s good for a small appliance.  It quickly gets most of the liquid & that’s what I want.", "Love this little vacuum! It’s perfect for the car or for small messes where you don’t want to deal with pulling out vacuum.", "Great vacuum for the price! I was in need of a vacuum and and I didn't to break the bank with buying an expensive vacuum. Luckily I found this one! Has great suction and barely has any issues on my hardwood floors. The attachments are great can get to any weird corner or area. Its a little loud, but I can deal with that as I have had way louder vacuums in the past. Great overall product for how much you are paying!", "Perfect for vacuum my car it’s exactly what I needed it does a great job for a little machine it sucks up I lot I really like this product definitely recommend!", "Works great for quick cleanups - in the car or a small pile of dirt. Won’t replace your large vacuum but really compact for the quick jobs.", "This vacuum is light and easy to use. I feel like it could be made a bit better. The attachments are thinner plastic, but do all work as intended. The suction is adequate, but not super powerful. The battery has surpassed my expectations and lasted a very long time.", "Very good purchase. Good suction and very powerful vacuum. Noise production low. Durable quality and good accessories included also. Will definitely recommend.", "This vacuum is great for the value. I bought it because I needed something cordless and portable and it is exactly that. Very convenient and easy to charge and use . I got it the clean the hairs on my bathroom whenever my husband shave so it’s doing the job so far.", "Very pleased with the power of this handheld vacuum, it picks up dust and dirt very well. For the price I do recommend this vacuum as it is light weight and the waste basket is easy to remove and put back on. While I have only used this for a solid week I do anticipate this vacuum to last for long time based on the quality.", "The fact that this is a wet/dry capable vacuum is the only reason I didn't give it two stars. It has less than average suction power, the battery dies quick, the charger is tiny and got lost almost right away, and the accessories don't attach to the side or come with a case or anything. Not a very good vacuum."], "reference": [1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.699999988079071, 0.20000000298023224, 0.5, 0.800000011920929, 0.3125000037252903, 0.699999988079071, 0.5000000074505806, 0.5, 0.699999988079071, 0.15000000596046448, 0.399999996026357, 0.6000000238418579, 0.8499999940395355, 0.36666665971279144, 0.8999999761581421, 0.20000000298023224, 0.8999999761581421, 0.8999999761581421, 0.800000011920929, 0.75, -0.44999999552965164]}