{"reviews": ["It has good suction. I planned to use it only in my car but now I use it at my home as well. All the corners, the furniture crevices are now clean.<br /><br />Battery is good, flushing container is super easy.", "The vacuum arrived on time and the box was in good condition.<br /><br />I used the vacuum on my vehicle and experienced the following:<br />1. The vacuum has difficulty with small pebbles/other debris you would track into your car<br />2. The brush attachment was fair at picking up pet hair, but it mainly was caught in the brush attachment and not pulled into the canister.<br />3. The extension hose adapter didn't fit in the end of the canister, allowing it to fall out and made using the crevice tool a bit unwieldy.<br /><br />I would suggest the manufacturer also include a small tool bag so the vacuum and attachments can be easily stored in your car/home.<br /><br />Pros:<br />1. The USB charger makes it easy to charge just about anywhere.  You will need to supply your own wall adapter, the vacuum comes with it's special charging cord.<br />2. I discovered the vacuum comes in very handy for small clean-up situations around the house. It's quick and easy to set up, and with pets in the home it's great at picking up animal hair off of hard floors or surfaces.<br />3. The filter is very easy to clean. I like the metal cover, which allows you to tap to clean without worrying if you'll damage the filter media.<br />4. The vacuum seems to hold a charge for a long time, has a good run time with a full charge and recharges fairly quickly.<br /><br />Cons:<br />1. The suction is on the weak side, and the vacuum head attachment has limited areas to allow dirt/debris to be pulled into the canister.<br />2. When removing attachments, hold the canister, NOT the vacuum body.  The canister has a twist/lock feature, and you can easily pull the canister off when removing an attachment.<br />3. No storage bag to keep tools/vacuum together whether storing at home or in your car.<br />4. The flap inside the canister that is supposed to keep dirt/debris in can get dislodged if you put the hose attachment in too far. It's held in place by a tab through a slot in the flap. A simple dab of glue would prevent a lot of dislodged flaps.<br />5. Hose adapter was too large to fit in canister opening. This rendered the extension hose pretty much useless.<br />6. No tool bag to hold vacuum and accessories for easy storage.<br /><br />I would compare ratings and performance with other similar handheld vacuums before getting again.", "This vacuum cleaner is perfect for those small places where it’s difficult to use a regular sized vacuum cleaner. I personally bought it to keep in my car and with a 4 year old constantly making a mess in the car, it’s turned out to be a great investment."], "reference": [1, 0, 0], "score": [-0.10000000149011612, -0.05000000074505806, -0.15000000223517418]}