{"reviews": ["I got this couple of days ago and have been using it in my car most of the time. It's so much more powerful and it sucks up dirt pretty good. It can clean hard to reach corners. Used it on my sofa as well and worked out great.", "refillable equipped with 3 different nozzle shapes to meet usage, product well received, easy to use, has a strong suction power of 10,000pa and rated input power of 120W, which can quickly and thoroughly clean dust, pet hair, and dirt, has a sophisticated design and enhanced stainless steel double filter, light and portable, only 1.1 pounds, and it won't feel tired even if held for a long time, long working time 18-30 minutes continuously, and can be fully charged in 3.5 hours, low noise ≤60dB, I have nothing negative to say about this vacuum, no there are regrets.", "Works great for quick cleanups - in the car or a small pile of dirt. Won’t replace your large vacuum but really compact for the quick jobs.", "I really like the vacuum cleaner<br />I can use it everywhere, no need to find an electric outlet<br />It has great power in suctioning dirt especially on my sofa and car seats.<br />Its very handy and very useful", "Very pleased with the power of this handheld vacuum, it picks up dust and dirt very well. For the price I do recommend this vacuum as it is light weight and the waste basket is easy to remove and put back on. While I have only used this for a solid week I do anticipate this vacuum to last for long time based on the quality.", "[[VIDEOID:28296190de8dc799a11bbe8b0dc2db2a]] From now on I don't have to worry about dirt getting deep inside the little hole  ones of my piano… this handheld vacuum cleaner is very convenient, light and compact, I used it about 30 minutes  for every time and the battery is lower, just need to charge the battery for about 3:30 minutes and the battery is full…It looks small but the suction is very strong, has a long hose I can vacuum in the hole of the sofa…it's really great to receive it.  Thank you producer 👍", "Works great for quick cleanups in the car or a small pile of dirt.", "[[VIDEOID:338c8db47e350d7a4ab24eaef73a8095]] Easy to use portable light weight , compact and durable. Works great for quick cleanups - in the car or a small pile of dirt. Handy to use in kitchen area . Quick cleanup and handy. Happy  and completely  satisfied by the purchase."], "reference": [1, 0, 0, 0, 0, 0, 0, 0], "score": [0.4000000059604645, 0.699999988079071, 0.30000001192092896, 0.6000000238418579, 0.699999988079071, 0.4000000059604645, 0.30000001192092896, 0.30000001192092896]}