{"reviews": ["Very good suction , Use it in my car & on my furniture", "I like this product. Small, light, easy to use and affordable. Comes with attachments which were useful for vacum difficult area in my car.", "This vacuum is lightweight, and east to move around to your car or if you want to vacuum anything at home. I mostly use it on my car. I like that it is portable and you don't need to connect anything to your car outlet. I just charge this at home , and it lasts me like about 30 min. I is very powerful , so picks up everything. I also like that it has no bag. Just empty the dusk cup and good to go. Overall good product for the money!!", "I got this couple of days ago and have been using it in my car most of the time. It's so much more powerful and it sucks up dirt pretty good. It can clean hard to reach corners. Used it on my sofa as well and worked out great.", "It’s useful for my car. I’m meticulous 😂 whenever I need to vacuum I can use it! I charge it and use!", "Very easy and convenient to use, easy to empty and has good suction! It’s small and convenient to keep right in my car. Works amazing for cleaning up messes from kids, and animals…and myself 😂", "It has good suction. I planned to use it only in my car but now I use it at my home as well. All the corners, the furniture crevices are now clean.<br /><br />Battery is good, flushing container is super easy.", "Good suction for the size. Gets pet hair out of carpet. Battery life is sufficient to clean entire car. Small size gets in all the tight crevices", "To be honest I have had handheld vacuums that had much more suction power than this one. Not saying that I need it to be super strong but, this one was definitely kind of weak even. It's good for small areas like if you needed to vacuum a keyboard but if you were even to do the interior of your car, I am not sure how well that would turn out. So far, I am only using it in those small areas since the suction power isn't that great.", "I use this for the kids crumbs they leave all over the house and car.  It’s been working great !", "Suction isn’t that powerful but it gets the job done<br />And can cleans the inside of your car right at home", "This is perfect for in the car or cleaning up small messes ha you don’t want to drag out the big vacuum for. The auction is good, and it comes with all kinds of attachments for different kinds of messes. It’s easy to empty and charge also.", "I needed a light and portable vacuum to clean my car and this one did an ok job. The suction power isn't overly powerful and I had to go back and forth a few times to pick up all the debris. The battery life is also good if you don't have to vacuum for too long. The vacuum in general is comfortable to grip and it is easy to use.", "Has everything needed to pickup small messes and vacuum out my car.", "Bought for my car,  it is very easy to use and easy to clean!", "Surprisingly, very lightweight. At first use I found it very easy to use not very loud.. it has just the right suctioning power. One of the good things about this is that it plugs into a USB port, which I’m finding a lot of equipment nowadays is using.. The vaccum charged pretty fast within 20 minutes. I would say I’m not sure if that’s full power, but it was enough to get me started. The charge provided me the ability to vacuum my entire car without powering down, so I would say the 20 minutes was ample enough charge. If you’re looking for something lightweight and easy to handle this is definitely for you.", "Why on this green Earth did I wait so long to get one of these?!?! I’ve known for years that one would be useful. I just never imagined HOW useful.<br /><br />It cleaned my baseboards, by heat register grill, a rice flour spill, and sugar. Sugar, people.<br /><br />It got cobwebs and crevices in my couch. It worked wonders on my drapes! It cleaned the carpets in my car! The attachments all work! I LOVE this vacuum!<br /><br />Add to that emptying thi bagless vac couldn’t be easier, or more mess free.<br /><br />Bottom line: looking for a handheld vacuum for your car? Buy this. Looking for a vacuum for your home? Buy another one! Buy one for every level! You will use this much, much more than you think you will. Highly, highly recommended!", "Picked this up for clean out my cars and it has been so nice. Its light and has some decent suction power. The included accessories make it simple to get to hard to reach places. The extensions is nice fore between seats and the brush makes cleaning floors a breeze. This would be great for what I'm using for my car, or using it for small tasks like cleaning furniture, stairs beds etc.", "I needed something to keep in my car since I always have dogs in it! This is quick and easy to use", "Love this little vacuum! It’s perfect for the car or for small messes where you don’t want to deal with pulling out vacuum.", "Perfect for vacuum my car it’s exactly what I needed it does a great job for a little machine it sucks up I lot I really like this product definitely recommend!", "I bought it for my car clean, it is small, it is easy open to clean inside, thanks", "Works great for quick cleanups - in the car or a small pile of dirt. Won’t replace your large vacuum but really compact for the quick jobs.", "Small but powerful vaccum it helps me a lot to keep my car clean  especially my daughter’s car seat !!", "I really like the vacuum cleaner<br />I can use it everywhere, no need to find an electric outlet<br />It has great power in suctioning dirt especially on my sofa and car seats.<br />Its very handy and very useful", "Works great for quick cleanups in the car or a small pile of dirt.", "I liked how well it cleaned up the floor mats in the car.", "It has good suction and works great for home and car small messes. It can gets into the corners and brush attachments works perfect for sweeping along the baseboards.", "[[VIDEOID:338c8db47e350d7a4ab24eaef73a8095]] Easy to use portable light weight , compact and durable. Works great for quick cleanups - in the car or a small pile of dirt. Handy to use in kitchen area . Quick cleanup and handy. Happy  and completely  satisfied by the purchase.", "This vacuum cleaner is perfect for those small places where it’s difficult to use a regular sized vacuum cleaner. I personally bought it to keep in my car and with a 4 year old constantly making a mess in the car, it’s turned out to be a great investment."], "reference": [2, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "score": [0.4000000059604645, 0.10000000149011612, 0.15000000223517418, 0.20000000298023224, 0.30000001192092896, 0.6000000238418579, -0.10000000149011612, 0.4000000059604645, 0.10000000149011612, 0.10000000149011612, 0.4000000059604645, 0.699999988079071, 0.30000001192092896, 0.4000000059604645, 0.8999999761581421, 0.30000001192092896, 0.30000000447034836, 0.20000000298023224, 0.30000001192092896, 0.699999988079071, 0.8999999761581421, 0.699999988079071, 0.30000001192092896, 0.699999988079071, 0.699999988079071, 0.4000000059604645, 0.699999988079071, 0.699999988079071, 0.30000001192092896, -0.15000000223517418]}